{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\obine\Music\Documents\Project\codes\Nigeria_log_file.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}10 Apr 2025, 17:39:33

{com}. do "C:\Users\obine\AppData\Local\Temp\STD3a18_000000.tmp"
{txt}
{com}. 
. capture program drop myboot     
{txt}
{com}. program define myboot, rclass
{txt}  1{com}. ** CRE-TOBIT
.  preserve 
{txt}  2{com}. heckman real_tpricefert_cens_mrk subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem i.year, select (commercial_dummy= subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem good_soil  i.year) twostep
{txt}  3{com}. predict yhat, xb
{txt}  4{com}. predict imr, mills
{txt}  5{com}. 
. sum yhat, detail
{txt}  6{com}. 
. ************winzonrizing fertilizer market price
. foreach v of varlist  yhat  {c -(}
{txt}  7{com}.         _pctile `v' [aw=weight] , p(1 95) 
{txt}  8{com}.         gen `v'_w=`v'
{txt}  9{com}.         *replace  `v'_w = r(r1) if  `v'_w < r(r1) &  `v'_w!=.
.         replace  `v'_w = r(r2) if  `v'_w > r(r2) &  `v'_w!=.
{txt} 10{com}.         local l`v' : var lab `v'
{txt} 11{com}.         lab var  `v'_w  "`l`v'' - Winzorized top & bottom 5%"
{txt} 12{com}. {c )-}
{txt} 13{com}. 
. 
. local time_avg "yhat_w"
{txt} 14{com}. foreach x in `time_avg' {c -(}
{txt} 15{com}.         bysort hhid : egen TAvg_`x' = mean(`x')
{txt} 16{com}. {c )-}
{txt} 17{com}. ** CRE-TOBIT 
. tobit total_qty_w yhat_w subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem  annual_mean_temp annual_precipitation  TAvg_total_qty_w TAvg_yhat_w TAvg_subsidy_qty_w TAvg_dist_market_w  TAvg_real_maize_price_mr TAvg_real_rice_price_mr TAvg_land_holding TAvg_real_hhvalue TAvg_org_fert TAvg_hh_headage TAvg_attend_sch TAvg_femhead TAvg_num_mem TAvg_annual_mean_temp TAvg_annual_precipitation imr i.year, ll(0)
{txt} 18{com}. margins, predict(ystar(0,.)) dydx(*) post
{txt} 19{com}. restore
{txt} 20{com}. end
{txt}
{com}. bootstrap, reps(100) seed(123) cluster(hhid) idcluster(newid): myboot
{res}{txt}(running {bf:myboot} on estimation sample)

{p 0 9 2}
warning: {bf:myboot} does not set {bf:e(sample)}, so no 
observations will be excluded from the resampling because of 
missing values or other reasons. To exclude observations, press 
Break, save the data, drop any observations that are to be excluded, 
and rerun {bf:bootstrap}.{p_end}
{res}
{text}Bootstrap replications ({result:100}){text}: {res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}.{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}10{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}.{res}{text}20{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}.{res}{text}.{res}{text}30{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}{bf:x}{res}{text}40{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}50{res}{text}{bf:x}{res}{text}.{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}.{res}{text}.{res}{text}.{res}{text}60{res}{text}.{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}70{res}{text}{bf:x}{res}{text}.{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}80{res}{text}.{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}100{text} done
{res}{text}{text:{bf:x}}: Error occurred when {bf:bootstrap} executed {bf:myboot}.
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,960}
{txt}{col 58}{lalign 13:Replications}{col 71} = {res}{ralign 5:68}

{txt}{ralign 91:(Replications based on {res:740} clusters in {res:hhid})}
{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}   Observed{col 39}   Bootstrap{col 67}         Norm{col 80}al-based
{col 27}{c |} coefficient{col 39}  std. err.{col 51}      z{col 59}   P>|z|{col 67}     [95% con{col 80}f. interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 19}yhat_w {c |}{col 27}{res}{space 2}-.1004768{col 39}{space 2} .1098646{col 50}{space 1}   -0.91{col 59}{space 3}0.360{col 67}{space 4}-.3158075{col 80}{space 3} .1148538
{txt}{space 12}subsidy_qty_w {c |}{col 27}{res}{space 2}-.0397867{col 39}{space 2}  .336994{col 50}{space 1}   -0.12{col 59}{space 3}0.906{col 67}{space 4}-.7002828{col 80}{space 3} .6207093
{txt}{space 12}dist_market_w {c |}{col 27}{res}{space 2} .2783419{col 39}{space 2} .1899101{col 50}{space 1}    1.47{col 59}{space 3}0.143{col 67}{space 4} -.093875{col 80}{space 3} .6505588
{txt}{space 6}real_maize_price_mr {c |}{col 27}{res}{space 2} .0063134{col 39}{space 2} .0211594{col 50}{space 1}    0.30{col 59}{space 3}0.765{col 67}{space 4}-.0351583{col 80}{space 3} .0477851
{txt}{space 7}real_rice_price_mr {c |}{col 27}{res}{space 2}-.0207563{col 39}{space 2} .0198358{col 50}{space 1}   -1.05{col 59}{space 3}0.295{col 67}{space 4}-.0596338{col 80}{space 3} .0181212
{txt}{space 13}land_holding {c |}{col 27}{res}{space 2} .7960025{col 39}{space 2} 2.622963{col 50}{space 1}    0.30{col 59}{space 3}0.762{col 67}{space 4}-4.344911{col 80}{space 3} 5.936916
{txt}{space 13}real_hhvalue {c |}{col 27}{res}{space 2}-.0270513{col 39}{space 2}  .011843{col 50}{space 1}   -2.28{col 59}{space 3}0.022{col 67}{space 4}-.0502632{col 80}{space 3}-.0038394
{txt}{space 17}org_fert {c |}{col 27}{res}{space 2}-19.11864{col 39}{space 2} 13.74292{col 50}{space 1}   -1.39{col 59}{space 3}0.164{col 67}{space 4}-46.05426{col 80}{space 3}  7.81699
{txt}{space 15}hh_headage {c |}{col 27}{res}{space 2} .2415463{col 39}{space 2} .6528695{col 50}{space 1}    0.37{col 59}{space 3}0.711{col 67}{space 4}-1.038054{col 80}{space 3} 1.521147
{txt}{space 15}attend_sch {c |}{col 27}{res}{space 2} 7.522517{col 39}{space 2} 8.542792{col 50}{space 1}    0.88{col 59}{space 3}0.379{col 67}{space 4}-9.221047{col 80}{space 3} 24.26608
{txt}{space 18}femhead {c |}{col 27}{res}{space 2} -1.32226{col 39}{space 2} 13.02009{col 50}{space 1}   -0.10{col 59}{space 3}0.919{col 67}{space 4}-26.84117{col 80}{space 3} 24.19665
{txt}{space 18}num_mem {c |}{col 27}{res}{space 2}-.2005422{col 39}{space 2} 2.040927{col 50}{space 1}   -0.10{col 59}{space 3}0.922{col 67}{space 4}-4.200685{col 80}{space 3} 3.799601
{txt}{space 9}annual_mean_temp {c |}{col 27}{res}{space 2} .8728964{col 39}{space 2}   1.5813{col 50}{space 1}    0.55{col 59}{space 3}0.581{col 67}{space 4}-2.226395{col 80}{space 3} 3.972188
{txt}{space 5}annual_precipitation {c |}{col 27}{res}{space 2} -.030015{col 39}{space 2} .1793611{col 50}{space 1}   -0.17{col 59}{space 3}0.867{col 67}{space 4}-.3815563{col 80}{space 3} .3215264
{txt}{space 9}TAvg_total_qty_w {c |}{col 27}{res}{space 2} .4967261{col 39}{space 2} .0226799{col 50}{space 1}   21.90{col 59}{space 3}0.000{col 67}{space 4} .4522743{col 80}{space 3} .5411778
{txt}{space 14}TAvg_yhat_w {c |}{col 27}{res}{space 2} .0753618{col 39}{space 2} .1454349{col 50}{space 1}    0.52{col 59}{space 3}0.604{col 67}{space 4}-.2096853{col 80}{space 3} .3604089
{txt}{space 7}TAvg_subsidy_qty_w {c |}{col 27}{res}{space 2}-.0451887{col 39}{space 2} .0575301{col 50}{space 1}   -0.79{col 59}{space 3}0.432{col 67}{space 4}-.1579455{col 80}{space 3} .0675681
{txt}{space 7}TAvg_dist_market_w {c |}{col 27}{res}{space 2}-.3692315{col 39}{space 2}   .09581{col 50}{space 1}   -3.85{col 59}{space 3}0.000{col 67}{space 4}-.5570157{col 80}{space 3}-.1814473
{txt}{space 1}TAvg_real_maize_price_mr {c |}{col 27}{res}{space 2}-.0200021{col 39}{space 2}  .034618{col 50}{space 1}   -0.58{col 59}{space 3}0.563{col 67}{space 4}-.0878522{col 80}{space 3} .0478479
{txt}{space 2}TAvg_real_rice_price_mr {c |}{col 27}{res}{space 2} .0038275{col 39}{space 2} .0167701{col 50}{space 1}    0.23{col 59}{space 3}0.819{col 67}{space 4}-.0290413{col 80}{space 3} .0366964
{txt}{space 8}TAvg_land_holding {c |}{col 27}{res}{space 2}-3.022182{col 39}{space 2} 2.477381{col 50}{space 1}   -1.22{col 59}{space 3}0.222{col 67}{space 4}-7.877759{col 80}{space 3} 1.833395
{txt}{space 8}TAvg_real_hhvalue {c |}{col 27}{res}{space 2} .0296161{col 39}{space 2} .0130681{col 50}{space 1}    2.27{col 59}{space 3}0.023{col 67}{space 4} .0040032{col 80}{space 3}  .055229
{txt}{space 12}TAvg_org_fert {c |}{col 27}{res}{space 2} 20.21384{col 39}{space 2} 8.473829{col 50}{space 1}    2.39{col 59}{space 3}0.017{col 67}{space 4} 3.605437{col 80}{space 3} 36.82224
{txt}{space 10}TAvg_hh_headage {c |}{col 27}{res}{space 2}-.2346085{col 39}{space 2} .3959914{col 50}{space 1}   -0.59{col 59}{space 3}0.554{col 67}{space 4}-1.010737{col 80}{space 3} .5415204
{txt}{space 10}TAvg_attend_sch {c |}{col 27}{res}{space 2}-7.093163{col 39}{space 2}  10.0659{col 50}{space 1}   -0.70{col 59}{space 3}0.481{col 67}{space 4}-26.82196{col 80}{space 3} 12.63563
{txt}{space 13}TAvg_femhead {c |}{col 27}{res}{space 2} 7.230122{col 39}{space 2}  18.3215{col 50}{space 1}    0.39{col 59}{space 3}0.693{col 67}{space 4}-28.67935{col 80}{space 3}  43.1396
{txt}{space 13}TAvg_num_mem {c |}{col 27}{res}{space 2}-.1263973{col 39}{space 2} 1.220536{col 50}{space 1}   -0.10{col 59}{space 3}0.918{col 67}{space 4}-2.518605{col 80}{space 3}  2.26581
{txt}{space 4}TAvg_annual_mean_temp {c |}{col 27}{res}{space 2} -.596368{col 39}{space 2} 1.577976{col 50}{space 1}   -0.38{col 59}{space 3}0.705{col 67}{space 4}-3.689145{col 80}{space 3} 2.496409
{txt}TAvg_annual_precipitation {c |}{col 27}{res}{space 2} .0229017{col 39}{space 2}  .178877{col 50}{space 1}    0.13{col 59}{space 3}0.898{col 67}{space 4}-.3276909{col 80}{space 3} .3734942
{txt}{space 22}imr {c |}{col 27}{res}{space 2}-7.063918{col 39}{space 2} 30.42775{col 50}{space 1}   -0.23{col 59}{space 3}0.816{col 67}{space 4}-66.70122{col 80}{space 3} 52.57338
{txt}{space 25} {c |}
{space 21}year {c |}
{space 20}2012  {c |}{col 27}{res}{space 2} 12.61279{col 39}{space 2} 5.674876{col 50}{space 1}    2.22{col 59}{space 3}0.026{col 67}{space 4} 1.490241{col 80}{space 3} 23.73534
{txt}{space 20}2015  {c |}{col 27}{res}{space 2} 23.77569{col 39}{space 2} 32.68943{col 50}{space 1}    0.73{col 59}{space 3}0.467{col 67}{space 4}-40.29442{col 80}{space 3} 87.84579
{txt}{space 20}2018  {c |}{col 27}{res}{space 2} 4.500499{col 39}{space 2} 6.196372{col 50}{space 1}    0.73{col 59}{space 3}0.468{col 67}{space 4}-7.644168{col 80}{space 3} 16.64517
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 79}Note: One or more parameters could not be estimated in 32 bootstrap replicates; standard-error estimates include only complete replications.{p_end}

{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD3a18_000000.tmp"
{txt}
{com}. heckman real_tpricefert_cens_mrk subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem i.year, select (commercial_dummy= subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem good_soil  i.year) twostep
{txt}note: two-step estimate of rho = -1.054279 is being truncated to -1
{res}
{txt}Heckman selection model -- two-step estimates   Number of obs     = {res}     2,960
{txt}(regression model with sample selection)              Selected    = {res}       777
                                                {txt}      Nonselected = {res}     2,183

                                                {txt}Wald chi2({res}14{txt})     =  {res}    26.08
                                                {txt}Prob > chi2       =     {res}0.0253

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      z{col 58}   P>|z|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}real_tpricefert_cens_mrk {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2} 5.514288{col 38}{space 2}  3.52975{col 49}{space 1}    1.56{col 58}{space 3}0.118{col 66}{space 4}-1.403896{col 79}{space 3} 12.43247
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2} 2.550006{col 38}{space 2} 1.781492{col 49}{space 1}    1.43{col 58}{space 3}0.152{col 66}{space 4}-.9416532{col 79}{space 3} 6.041665
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2} .2647049{col 38}{space 2} .2162539{col 49}{space 1}    1.22{col 58}{space 3}0.221{col 66}{space 4}-.1591449{col 79}{space 3} .6885547
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2}-.2482749{col 38}{space 2}  .091177{col 49}{space 1}   -2.72{col 58}{space 3}0.006{col 66}{space 4}-.4269784{col 79}{space 3}-.0695713
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2}-21.68282{col 38}{space 2} 16.39501{col 49}{space 1}   -1.32{col 58}{space 3}0.186{col 66}{space 4}-53.81644{col 79}{space 3}  10.4508
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0385828{col 38}{space 2}  .094371{col 49}{space 1}   -0.41{col 58}{space 3}0.683{col 66}{space 4}-.2235466{col 79}{space 3} .1463809
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2}-184.6365{col 38}{space 2}  135.634{col 49}{space 1}   -1.36{col 58}{space 3}0.173{col 66}{space 4}-450.4743{col 79}{space 3} 81.20123
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}   8.9986{col 38}{space 2} 5.323375{col 49}{space 1}    1.69{col 58}{space 3}0.091{col 66}{space 4}-1.435023{col 79}{space 3} 19.43222
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} 43.60196{col 38}{space 2} 70.60027{col 49}{space 1}    0.62{col 58}{space 3}0.537{col 66}{space 4}-94.77203{col 79}{space 3}  181.976
{txt}{space 17}femhead {c |}{col 26}{res}{space 2} 169.5959{col 38}{space 2}  98.6579{col 49}{space 1}    1.72{col 58}{space 3}0.086{col 66}{space 4}-23.77002{col 79}{space 3} 362.9618
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2}-20.10455{col 38}{space 2} 13.76457{col 49}{space 1}   -1.46{col 58}{space 3}0.144{col 66}{space 4}-47.08262{col 79}{space 3} 6.873507
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2} 12.38033{col 38}{space 2} 64.55688{col 49}{space 1}    0.19{col 58}{space 3}0.848{col 66}{space 4}-114.1488{col 79}{space 3} 138.9095
{txt}{space 19}2015  {c |}{col 26}{res}{space 2} 217.0654{col 38}{space 2} 69.91401{col 49}{space 1}    3.10{col 58}{space 3}0.002{col 66}{space 4} 80.03645{col 79}{space 3} 354.0943
{txt}{space 19}2018  {c |}{col 26}{res}{space 2}-50.43774{col 38}{space 2} 64.26783{col 49}{space 1}   -0.78{col 58}{space 3}0.433{col 66}{space 4}-176.4004{col 79}{space 3} 75.52489
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} 648.5588{col 38}{space 2} 316.6244{col 49}{space 1}    2.05{col 58}{space 3}0.041{col 66}{space 4} 27.98633{col 79}{space 3} 1269.131
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}commercial_dummy         {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2}-.0095462{col 38}{space 2} .0010141{col 49}{space 1}   -9.41{col 58}{space 3}0.000{col 66}{space 4}-.0115338{col 79}{space 3}-.0075585
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2}-.0054338{col 38}{space 2} .0006677{col 49}{space 1}   -8.14{col 58}{space 3}0.000{col 66}{space 4}-.0067425{col 79}{space 3}-.0041252
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2}-.0002683{col 38}{space 2}  .000239{col 49}{space 1}   -1.12{col 58}{space 3}0.262{col 66}{space 4}-.0007367{col 79}{space 3} .0002001
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2} .0002368{col 38}{space 2} .0000702{col 49}{space 1}    3.37{col 58}{space 3}0.001{col 66}{space 4} .0000992{col 79}{space 3} .0003745
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2} .0334944{col 38}{space 2} .0167537{col 49}{space 1}    2.00{col 58}{space 3}0.046{col 66}{space 4} .0006578{col 79}{space 3}  .066331
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-1.54e-06{col 38}{space 2} .0001204{col 49}{space 1}   -0.01{col 58}{space 3}0.990{col 66}{space 4}-.0002374{col 79}{space 3} .0002343
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2} .4097053{col 38}{space 2} .0767516{col 49}{space 1}    5.34{col 58}{space 3}0.000{col 66}{space 4} .2592749{col 79}{space 3} .5601358
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}-.0149842{col 38}{space 2} .0026918{col 49}{space 1}   -5.57{col 58}{space 3}0.000{col 66}{space 4}  -.02026{col 79}{space 3}-.0097083
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} .0296757{col 38}{space 2} .0882814{col 49}{space 1}    0.34{col 58}{space 3}0.737{col 66}{space 4}-.1433526{col 79}{space 3} .2027041
{txt}{space 17}femhead {c |}{col 26}{res}{space 2}-.2123379{col 38}{space 2} .0836533{col 49}{space 1}   -2.54{col 58}{space 3}0.011{col 66}{space 4}-.3762953{col 79}{space 3}-.0483804
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2} .0399223{col 38}{space 2} .0079571{col 49}{space 1}    5.02{col 58}{space 3}0.000{col 66}{space 4} .0243266{col 79}{space 3}  .055518
{txt}{space 15}good_soil {c |}{col 26}{res}{space 2} .1856225{col 38}{space 2} .0899945{col 49}{space 1}    2.06{col 58}{space 3}0.039{col 66}{space 4} .0092366{col 79}{space 3} .3620084
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2}   .01167{col 38}{space 2} .0804425{col 49}{space 1}    0.15{col 58}{space 3}0.885{col 66}{space 4}-.1459944{col 79}{space 3} .1693343
{txt}{space 19}2015  {c |}{col 26}{res}{space 2}-.0583315{col 38}{space 2} .0830648{col 49}{space 1}   -0.70{col 58}{space 3}0.483{col 66}{space 4}-.2211355{col 79}{space 3} .1044725
{txt}{space 19}2018  {c |}{col 26}{res}{space 2} -.001766{col 38}{space 2} .0807293{col 49}{space 1}   -0.02{col 58}{space 3}0.983{col 66}{space 4}-.1599926{col 79}{space 3} .1564605
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} .0470748{col 38}{space 2}  .218905{col 49}{space 1}    0.22{col 58}{space 3}0.830{col 66}{space 4}-.3819712{col 79}{space 3} .4761208
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/mills                   {txt}{c |}
{space 18}lambda {c |}{col 26}{res}{space 2}-758.8742{col 38}{space 2} 444.7573{col 49}{space 1}   -1.71{col 58}{space 3}0.088{col 66}{space 4}-1630.582{col 79}{space 3} 112.8341
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                     rho {c |} {res}  -1.00000
                   {txt}sigma {c |} {res} 758.87418
{txt}{hline 25}{c BT}{hline 64}

{com}. predict yhat, xb
{txt}
{com}. predict imr, mills
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD3a18_000000.tmp"
{txt}
{com}. tabstat total_qty_w yhat yhat_w [aweight = weight], statistics( mean median sd min max ) columns(statistics)
{err}variable {bf}yhat_w{sf} not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "C:\Users\obine\AppData\Local\Temp\STD3a18_000000.tmp"
{txt}
{com}. ************winzonrizing fertilizer market price
. foreach v of varlist  yhat  {c -(}
{txt}  2{com}.         _pctile `v' [aw=weight] , p(1 95) 
{txt}  3{com}.         gen `v'_w=`v'
{txt}  4{com}.         *replace  `v'_w = r(r1) if  `v'_w < r(r1) &  `v'_w!=.
.         replace  `v'_w = r(r2) if  `v'_w > r(r2) &  `v'_w!=.
{txt}  5{com}.         local l`v' : var lab `v'
{txt}  6{com}.         lab var  `v'_w  "`l`v'' - Winzorized top & bottom 5%"
{txt}  7{com}. {c )-}
{txt}(135 real changes made)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD3a18_000000.tmp"
{txt}
{com}. tabstat total_qty_w yhat yhat_w [aweight = weight], statistics( mean median sd min max ) columns(statistics)

{txt}{ralign 12:Variable} {...}
{c |}      Mean       p50        SD       Min       Max
{hline 13}{c +}{hline 50}
{ralign 12:total_qty_w} {...}
{c |}{...}
 {res} 45.05122         0  118.0924         0      1000
{txt}{ralign 12:yhat} {...}
{c |}{...}
 {res} 1319.027  1214.136  590.7483  252.9596  5324.883
{txt}{ralign 12:yhat_w} {...}
{c |}{...}
 {res} 1265.542  1214.136  383.7083  252.9596  2271.363
{txt}{hline 13}{c BT}{hline 50}

{com}. 
{txt}end of do-file

{com}. exit, clear
{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\obine\Music\Documents\Project\codes\Nigeria_log_file.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}11 Apr 2025, 18:30:16

{com}. do "C:\Users\obine\AppData\Local\Temp\STD2bac_000000.tmp"
{txt}
{com}. use  "C:\Users\obine\Music\Documents\Project\codes\without_median\complete\Real_heckman.dta", clear
{txt}(Nigeria GHS-Panel Wave 1 PP Ag Section 11D - Fertilizer Acquisition)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD2bac_000000.tmp"
{txt}
{com}. tabstat total_qty_w subsidy_qty_w mrk_dist_w real_tpricefert_cens_mrk num_mem hh_headage real_hhvalue worker real_maize_price_mr real_rice_price_mr land_holding [aweight = weight], statistics( mean median sd min max ) columns(statistics)

{txt}{ralign 12:Variable} {...}
{c |}      Mean       p50        SD       Min       Max
{hline 13}{c +}{hline 50}
{ralign 12:total_qty_w} {...}
{c |}{...}
 {res} 45.05122         0  118.0924         0      1000
{txt}{ralign 12:subsidy_qt~w} {...}
{c |}{...}
 {res}  32.5475         0  104.1844         0       750
{txt}{ralign 12:mrk_dist_w} {...}
{c |}{...}
 {res} 6.490536         3  10.42416         0        50
{txt}{ralign 12:real_tpric~k} {...}
{c |}{...}
 {res} 57.69903         0  194.1335         0  2587.196
{txt}{ralign 12:num_mem} {...}
{c |}{...}
 {res}  7.32168         7   3.57727         1        34
{txt}{ralign 12:hh_headage} {...}
{c |}{...}
 {res} 57.24329        55  10.63282        25       100
{txt}{ralign 12:real_hhvalue} {...}
{c |}{...}
 {res} 136.7469      69.5  223.6598         0      2488
{txt}{ralign 12:worker} {...}
{c |}{...}
 {res} 3.274765         3  1.803255         0        12
{txt}{ralign 12:real_maize~r} {...}
{c |}{...}
 {res} 187.5356  160.0922  130.5668  .0517439  1737.701
{txt}{ralign 12:real_rice_~r} {...}
{c |}{...}
 {res} 624.9888  522.0399  429.7302  6.467991  1746.358
{txt}{ralign 12:land_holding} {...}
{c |}{...}
 {res} 1.230784    .64485   1.62508     .0005    9.6602
{txt}{hline 13}{c BT}{hline 50}

{com}. egen med_zone = median (zone)
{txt}
{com}. replace zone = med_zone if zone ==.
{txt}(228 real changes made)

{com}. misstable summarize total_qty_w subsidy_qty_w mrk_dist_w real_tpricefert_cens_mrk num_mem hh_headage real_hhvalue worker real_maize_price_mr real_rice_price_mr land_holding  subsidy_dummy femhead informal_save formal_credit informal_credit ext_acess attend_sch pry_edu finish_pry finish_sec safety_net net_seller net_buyer soil_qty_rev2 zone year plot_elevation plot_slope plot_wetness dist_market_w annual_mean_temp annual_precipitation org_fert
{txt}(variables nonmissing or string)

{com}. 
. 
. *replace hh_headage = 72 if hh_headage >72
. gen lland_holding = log(land_holding)
{txt}
{com}. gen lreal_hhvalue = log(real_hhvalue + 1)
{txt}
{com}. 
. 
. sum real_tpricefert_cens_mrk, detail

      {txt}price of commercial fertilizer purchased in naira
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      2,960
{txt}25%    {res}        0              0       {txt}Sum of wgt. {res}      2,960

{txt}50%    {res}        0                      {txt}Mean          {res} 60.23217
                        {txt}Largest       Std. dev.     {res} 206.3627
{txt}75%    {res} 51.54821       2587.196
{txt}90%    {res} 192.1107       2587.196       {txt}Variance      {res} 42585.58
{txt}95%    {res} 231.6935       2587.196       {txt}Skewness      {res} 9.757362
{txt}99%    {res} 480.2767       2587.196       {txt}Kurtosis      {res} 116.1278
{txt}
{com}. 
. gen good_soil = (soil_qty_rev2==1)
{txt}
{com}. gen fair_soil = (soil_qty_rev2==2)
{txt}
{com}. 
. 
. local time_avg "total_qty_w subsidy_qty_w mrk_dist_w real_tpricefert_cens_mrk num_mem hh_headage real_hhvalue worker real_maize_price_mr real_rice_price_mr land_holding  subsidy_dummy femhead informal_save formal_credit informal_credit ext_acess attend_sch pry_edu finish_pry finish_sec safety_net net_seller net_buyer soil_qty_rev2 lland_holding lreal_hhvalue plot_elevation plot_slope plot_wetness annual_mean_temp annual_precipitation org_fert dist_market_w formal_bank formal_save"
{txt}
{com}. 
. foreach x in `time_avg' {c -(}
{txt}  2{com}. 
.         bysort hhid : egen TAvg_`x' = mean(`x')
{txt}  3{com}. 
. {c )-}
{txt}
{com}. 
. 
. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD2bac_000000.tmp"
{txt}
{com}. 
. capture program drop myboot     
{txt}
{com}. program define myboot, rclass
{txt}  1{com}. ** CRE-TOBIT
.  preserve 
{txt}  2{com}. heckman real_tpricefert_cens_mrk subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage  i.year, select (commercial_dummy= subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr lland_holding lreal_hhvalue org_fert hh_headage good_soil  i.year) twostep
{txt}  3{com}. predict yhat, xb
{txt}  4{com}. predict imr, mills
{txt}  5{com}. 
. gen lyhat = log(yhat)
{txt}  6{com}. local time_avg "lyhat"
{txt}  7{com}. foreach x in `time_avg' {c -(}
{txt}  8{com}.         bysort hhid : egen TAvg_`x' = mean(`x')
{txt}  9{com}. {c )-}
{txt} 10{com}. ** CRE-TOBIT 
. tobit total_qty_w lyhat subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage annual_mean_temp annual_precipitation  TAvg_total_qty_w TAvg_lyhat TAvg_subsidy_qty_w TAvg_dist_market_w  TAvg_real_maize_price_mr TAvg_real_rice_price_mr TAvg_land_holding TAvg_real_hhvalue TAvg_org_fert TAvg_hh_headage TAvg_annual_mean_temp TAvg_annual_precipitation imr i.year, ll(0)
{txt} 11{com}. margins, predict(ystar(0,.)) dydx(*) post
{txt} 12{com}. restore
{txt} 13{com}. end
{txt}
{com}. bootstrap, reps(100) seed(123) cluster(hhid) idcluster(newid): myboot
{res}{txt}(running {bf:myboot} on estimation sample)

{p 0 9 2}
warning: {bf:myboot} does not set {bf:e(sample)}, so no 
observations will be excluded from the resampling because of 
missing values or other reasons. To exclude observations, press 
Break, save the data, drop any observations that are to be excluded, 
and rerun {bf:bootstrap}.{p_end}
{res}
{text}Bootstrap replications ({result:100}){text}: {res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}10{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}20{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}30{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}40{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}50{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}60{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}70{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}80{res}{text}.{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}90{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}100{text} done
{res}{text}{text:{bf:x}}: Error occurred when {bf:bootstrap} executed {bf:myboot}.
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,960}
{txt}{col 58}{lalign 13:Replications}{col 71} = {res}{ralign 5:95}

{txt}{ralign 91:(Replications based on {res:740} clusters in {res:hhid})}
{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}   Observed{col 39}   Bootstrap{col 67}         Norm{col 80}al-based
{col 27}{c |} coefficient{col 39}  std. err.{col 51}      z{col 59}   P>|z|{col 67}     [95% con{col 80}f. interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}lyhat {c |}{col 27}{res}{space 2}-10.14827{col 39}{space 2} 54.40847{col 50}{space 1}   -0.19{col 59}{space 3}0.852{col 67}{space 4}-116.7869{col 80}{space 3} 96.49037
{txt}{space 12}subsidy_qty_w {c |}{col 27}{res}{space 2}-.0977411{col 39}{space 2} 2.839386{col 50}{space 1}   -0.03{col 59}{space 3}0.973{col 67}{space 4}-5.662835{col 80}{space 3} 5.467353
{txt}{space 12}dist_market_w {c |}{col 27}{res}{space 2} .2075801{col 39}{space 2} .2083965{col 50}{space 1}    1.00{col 59}{space 3}0.319{col 67}{space 4}-.2008695{col 80}{space 3} .6160297
{txt}{space 6}real_maize_price_mr {c |}{col 27}{res}{space 2} .0016815{col 39}{space 2} .0280841{col 50}{space 1}    0.06{col 59}{space 3}0.952{col 67}{space 4}-.0533623{col 80}{space 3} .0567252
{txt}{space 7}real_rice_price_mr {c |}{col 27}{res}{space 2}-.0163765{col 39}{space 2} .0197221{col 50}{space 1}   -0.83{col 59}{space 3}0.406{col 67}{space 4}-.0550312{col 80}{space 3} .0222781
{txt}{space 13}land_holding {c |}{col 27}{res}{space 2} 1.022934{col 39}{space 2} 2.264603{col 50}{space 1}    0.45{col 59}{space 3}0.651{col 67}{space 4}-3.415606{col 80}{space 3} 5.461474
{txt}{space 13}real_hhvalue {c |}{col 27}{res}{space 2}-.0410314{col 39}{space 2} .0207624{col 50}{space 1}   -1.98{col 59}{space 3}0.048{col 67}{space 4} -.081725{col 80}{space 3}-.0003378
{txt}{space 17}org_fert {c |}{col 27}{res}{space 2}-18.49358{col 39}{space 2} 20.78337{col 50}{space 1}   -0.89{col 59}{space 3}0.374{col 67}{space 4}-59.22823{col 80}{space 3} 22.24107
{txt}{space 15}hh_headage {c |}{col 27}{res}{space 2} .2028532{col 39}{space 2} 1.097352{col 50}{space 1}    0.18{col 59}{space 3}0.853{col 67}{space 4}-1.947916{col 80}{space 3} 2.353623
{txt}{space 9}annual_mean_temp {c |}{col 27}{res}{space 2} .8631661{col 39}{space 2}  5.56245{col 50}{space 1}    0.16{col 59}{space 3}0.877{col 67}{space 4}-10.03903{col 80}{space 3} 11.76537
{txt}{space 5}annual_precipitation {c |}{col 27}{res}{space 2}-.0295365{col 39}{space 2} 1.190466{col 50}{space 1}   -0.02{col 59}{space 3}0.980{col 67}{space 4}-2.362808{col 80}{space 3} 2.303735
{txt}{space 9}TAvg_total_qty_w {c |}{col 27}{res}{space 2} .4978773{col 39}{space 2} .0339212{col 50}{space 1}   14.68{col 59}{space 3}0.000{col 67}{space 4} .4313929{col 80}{space 3} .5643617
{txt}{space 15}TAvg_lyhat {c |}{col 27}{res}{space 2}-5.192252{col 39}{space 2} 63.12219{col 50}{space 1}   -0.08{col 59}{space 3}0.934{col 67}{space 4}-128.9095{col 80}{space 3}  118.525
{txt}{space 7}TAvg_subsidy_qty_w {c |}{col 27}{res}{space 2}  .164319{col 39}{space 2} .1317418{col 50}{space 1}    1.25{col 59}{space 3}0.212{col 67}{space 4}-.0938901{col 80}{space 3} .4225281
{txt}{space 7}TAvg_dist_market_w {c |}{col 27}{res}{space 2}-.1958775{col 39}{space 2} .1584534{col 50}{space 1}   -1.24{col 59}{space 3}0.216{col 67}{space 4}-.5064405{col 80}{space 3} .1146855
{txt}{space 1}TAvg_real_maize_price_mr {c |}{col 27}{res}{space 2} .0020352{col 39}{space 2} .0484118{col 50}{space 1}    0.04{col 59}{space 3}0.966{col 67}{space 4}-.0928502{col 80}{space 3} .0969207
{txt}{space 2}TAvg_real_rice_price_mr {c |}{col 27}{res}{space 2}  -.01553{col 39}{space 2}  .029398{col 50}{space 1}   -0.53{col 59}{space 3}0.597{col 67}{space 4}-.0731491{col 80}{space 3} .0420891
{txt}{space 8}TAvg_land_holding {c |}{col 27}{res}{space 2}-5.730739{col 39}{space 2} 3.069855{col 50}{space 1}   -1.87{col 59}{space 3}0.062{col 67}{space 4}-11.74754{col 80}{space 3} .2860663
{txt}{space 8}TAvg_real_hhvalue {c |}{col 27}{res}{space 2} .0301217{col 39}{space 2} .0204181{col 50}{space 1}    1.48{col 59}{space 3}0.140{col 67}{space 4} -.009897{col 80}{space 3} .0701405
{txt}{space 12}TAvg_org_fert {c |}{col 27}{res}{space 2} 10.58092{col 39}{space 2} 29.16555{col 50}{space 1}    0.36{col 59}{space 3}0.717{col 67}{space 4}-46.58252{col 80}{space 3} 67.74435
{txt}{space 10}TAvg_hh_headage {c |}{col 27}{res}{space 2} .3394588{col 39}{space 2} .6228562{col 50}{space 1}    0.55{col 59}{space 3}0.586{col 67}{space 4}-.8813168{col 80}{space 3} 1.560234
{txt}{space 4}TAvg_annual_mean_temp {c |}{col 27}{res}{space 2} -.640108{col 39}{space 2} 5.478964{col 50}{space 1}   -0.12{col 59}{space 3}0.907{col 67}{space 4}-11.37868{col 80}{space 3} 10.09846
{txt}TAvg_annual_precipitation {c |}{col 27}{res}{space 2} .0200973{col 39}{space 2}  1.19724{col 50}{space 1}    0.02{col 59}{space 3}0.987{col 67}{space 4}-2.326449{col 80}{space 3} 2.366644
{txt}{space 22}imr {c |}{col 27}{res}{space 2}-66.25851{col 39}{space 2} 36.76793{col 50}{space 1}   -1.80{col 59}{space 3}0.072{col 67}{space 4}-138.3223{col 80}{space 3} 5.805309
{txt}{space 25} {c |}
{space 21}year {c |}
{space 20}2012  {c |}{col 27}{res}{space 2} 11.40656{col 39}{space 2}  12.9119{col 50}{space 1}    0.88{col 59}{space 3}0.377{col 67}{space 4}-13.90029{col 80}{space 3} 36.71342
{txt}{space 20}2015  {c |}{col 27}{res}{space 2} 11.02389{col 39}{space 2} 26.64106{col 50}{space 1}    0.41{col 59}{space 3}0.679{col 67}{space 4}-41.19163{col 80}{space 3}  63.2394
{txt}{space 20}2018  {c |}{col 27}{res}{space 2} 6.477499{col 39}{space 2} 14.61555{col 50}{space 1}    0.44{col 59}{space 3}0.658{col 67}{space 4}-22.16846{col 80}{space 3} 35.12346
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 79}Note: One or more parameters could not be estimated in 5 bootstrap replicates; standard-error estimates include only complete replications.{p_end}

{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD2bac_000000.tmp"
{txt}
{com}. 
. capture program drop myboot     
{txt}
{com}. program define myboot, rclass
{txt}  1{com}. ** CRE-TOBIT
.  preserve 
{txt}  2{com}. heckman real_tpricefert_cens_mrk subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage  i.year, select (commercial_dummy= subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr lland_holding lreal_hhvalue org_fert hh_headage good_soil  i.year) twostep
{txt}  3{com}. predict yhat, xb
{txt}  4{com}. predict imr, mills
{txt}  5{com}. 
. 
. local time_avg "yhat"
{txt}  6{com}. foreach x in `time_avg' {c -(}
{txt}  7{com}.         bysort hhid : egen TAvg_`x' = mean(`x')
{txt}  8{com}. {c )-}
{txt}  9{com}. ** CRE-TOBIT 
. tobit total_qty_w yhat subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage annual_mean_temp annual_precipitation  TAvg_total_qty_w TAvg_yhat TAvg_subsidy_qty_w TAvg_dist_market_w  TAvg_real_maize_price_mr TAvg_real_rice_price_mr TAvg_land_holding TAvg_real_hhvalue TAvg_org_fert TAvg_hh_headage TAvg_annual_mean_temp TAvg_annual_precipitation imr i.year, ll(0)
{txt} 10{com}. margins, predict(ystar(0,.)) dydx(*) post
{txt} 11{com}. restore
{txt} 12{com}. end
{txt}
{com}. bootstrap, reps(100) seed(123) cluster(hhid) idcluster(newid): myboot
{res}{txt}(running {bf:myboot} on estimation sample)

{p 0 9 2}
warning: {bf:myboot} does not set {bf:e(sample)}, so no 
observations will be excluded from the resampling because of 
missing values or other reasons. To exclude observations, press 
Break, save the data, drop any observations that are to be excluded, 
and rerun {bf:bootstrap}.{p_end}
{res}
{text}Bootstrap replications ({result:100}){text}: {res}{text}{bf:x}{res}{text}{bf:x}{res}{text}{bf:x}{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

end of do-file

{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

{com}. end
{err}command {bf}end{sf} is unrecognized
{txt}{search r(199), local:r(199);}

{com}. exit, clear
{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\obine\Music\Documents\Project\codes\Nigeria_log_file.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}11 Apr 2025, 18:40:49
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD798_000000.tmp"
{txt}
{com}. use  "C:\Users\obine\Music\Documents\Project\codes\without_median\complete\Real_heckman.dta", clear
{txt}(Nigeria GHS-Panel Wave 1 PP Ag Section 11D - Fertilizer Acquisition)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD798_000000.tmp"
{txt}
{com}. 
. tabstat total_qty_w subsidy_qty_w mrk_dist_w real_tpricefert_cens_mrk num_mem hh_headage real_hhvalue worker real_maize_price_mr real_rice_price_mr land_holding [aweight = weight], statistics( mean median sd min max ) columns(statistics)

{txt}{ralign 12:Variable} {...}
{c |}      Mean       p50        SD       Min       Max
{hline 13}{c +}{hline 50}
{ralign 12:total_qty_w} {...}
{c |}{...}
 {res} 45.05122         0  118.0924         0      1000
{txt}{ralign 12:subsidy_qt~w} {...}
{c |}{...}
 {res}  32.5475         0  104.1844         0       750
{txt}{ralign 12:mrk_dist_w} {...}
{c |}{...}
 {res} 6.490536         3  10.42416         0        50
{txt}{ralign 12:real_tpric~k} {...}
{c |}{...}
 {res} 57.69903         0  194.1335         0  2587.196
{txt}{ralign 12:num_mem} {...}
{c |}{...}
 {res}  7.32168         7   3.57727         1        34
{txt}{ralign 12:hh_headage} {...}
{c |}{...}
 {res} 57.24329        55  10.63282        25       100
{txt}{ralign 12:real_hhvalue} {...}
{c |}{...}
 {res} 136.7469      69.5  223.6598         0      2488
{txt}{ralign 12:worker} {...}
{c |}{...}
 {res} 3.274765         3  1.803255         0        12
{txt}{ralign 12:real_maize~r} {...}
{c |}{...}
 {res} 187.5356  160.0922  130.5668  .0517439  1737.701
{txt}{ralign 12:real_rice_~r} {...}
{c |}{...}
 {res} 624.9888  522.0399  429.7302  6.467991  1746.358
{txt}{ralign 12:land_holding} {...}
{c |}{...}
 {res} 1.230784    .64485   1.62508     .0005    9.6602
{txt}{hline 13}{c BT}{hline 50}

{com}. egen med_zone = median (zone)
{txt}
{com}. replace zone = med_zone if zone ==.
{txt}(228 real changes made)

{com}. misstable summarize total_qty_w subsidy_qty_w mrk_dist_w real_tpricefert_cens_mrk num_mem hh_headage real_hhvalue worker real_maize_price_mr real_rice_price_mr land_holding  subsidy_dummy femhead informal_save formal_credit informal_credit ext_acess attend_sch pry_edu finish_pry finish_sec safety_net net_seller net_buyer soil_qty_rev2 zone year plot_elevation plot_slope plot_wetness dist_market_w annual_mean_temp annual_precipitation org_fert
{txt}(variables nonmissing or string)

{com}. 
. 
. *replace hh_headage = 72 if hh_headage >72
. gen lland_holding = log(land_holding)
{txt}
{com}. gen lreal_hhvalue = log(real_hhvalue + 1)
{txt}
{com}. 
. 
. sum real_tpricefert_cens_mrk, detail

      {txt}price of commercial fertilizer purchased in naira
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      2,960
{txt}25%    {res}        0              0       {txt}Sum of wgt. {res}      2,960

{txt}50%    {res}        0                      {txt}Mean          {res} 60.23217
                        {txt}Largest       Std. dev.     {res} 206.3627
{txt}75%    {res} 51.54821       2587.196
{txt}90%    {res} 192.1107       2587.196       {txt}Variance      {res} 42585.58
{txt}95%    {res} 231.6935       2587.196       {txt}Skewness      {res} 9.757362
{txt}99%    {res} 480.2767       2587.196       {txt}Kurtosis      {res} 116.1278
{txt}
{com}. 
. gen good_soil = (soil_qty_rev2==1)
{txt}
{com}. gen fair_soil = (soil_qty_rev2==2)
{txt}
{com}. 
. 
. local time_avg "total_qty_w subsidy_qty_w mrk_dist_w real_tpricefert_cens_mrk num_mem hh_headage real_hhvalue worker real_maize_price_mr real_rice_price_mr land_holding  subsidy_dummy femhead informal_save formal_credit informal_credit ext_acess attend_sch pry_edu finish_pry finish_sec safety_net net_seller net_buyer soil_qty_rev2 lland_holding lreal_hhvalue plot_elevation plot_slope plot_wetness annual_mean_temp annual_precipitation org_fert dist_market_w formal_bank formal_save"
{txt}
{com}. 
. foreach x in `time_avg' {c -(}
{txt}  2{com}. 
.         bysort hhid : egen TAvg_`x' = mean(`x')
{txt}  3{com}. 
. {c )-}
{txt}
{com}. 
. 
. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD798_000000.tmp"
{txt}
{com}.  preserve 
{txt}
{com}. heckman real_tpricefert_cens_mrk subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem  i.year, select (commercial_dummy= subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem good_soil  i.year) twostep
{txt}note: two-step estimate of rho = -1.054279 is being truncated to -1
{res}
{txt}Heckman selection model -- two-step estimates   Number of obs     = {res}     2,960
{txt}(regression model with sample selection)              Selected    = {res}       777
                                                {txt}      Nonselected = {res}     2,183

                                                {txt}Wald chi2({res}14{txt})     =  {res}    26.08
                                                {txt}Prob > chi2       =     {res}0.0253

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      z{col 58}   P>|z|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}real_tpricefert_cens_mrk {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2} 5.514288{col 38}{space 2}  3.52975{col 49}{space 1}    1.56{col 58}{space 3}0.118{col 66}{space 4}-1.403896{col 79}{space 3} 12.43247
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2} 2.550006{col 38}{space 2} 1.781492{col 49}{space 1}    1.43{col 58}{space 3}0.152{col 66}{space 4}-.9416532{col 79}{space 3} 6.041665
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2} .2647049{col 38}{space 2} .2162539{col 49}{space 1}    1.22{col 58}{space 3}0.221{col 66}{space 4}-.1591449{col 79}{space 3} .6885547
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2}-.2482749{col 38}{space 2}  .091177{col 49}{space 1}   -2.72{col 58}{space 3}0.006{col 66}{space 4}-.4269784{col 79}{space 3}-.0695713
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2}-21.68282{col 38}{space 2} 16.39501{col 49}{space 1}   -1.32{col 58}{space 3}0.186{col 66}{space 4}-53.81644{col 79}{space 3}  10.4508
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0385828{col 38}{space 2}  .094371{col 49}{space 1}   -0.41{col 58}{space 3}0.683{col 66}{space 4}-.2235466{col 79}{space 3} .1463809
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2}-184.6365{col 38}{space 2}  135.634{col 49}{space 1}   -1.36{col 58}{space 3}0.173{col 66}{space 4}-450.4743{col 79}{space 3} 81.20123
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}   8.9986{col 38}{space 2} 5.323375{col 49}{space 1}    1.69{col 58}{space 3}0.091{col 66}{space 4}-1.435023{col 79}{space 3} 19.43222
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} 43.60196{col 38}{space 2} 70.60027{col 49}{space 1}    0.62{col 58}{space 3}0.537{col 66}{space 4}-94.77203{col 79}{space 3}  181.976
{txt}{space 17}femhead {c |}{col 26}{res}{space 2} 169.5959{col 38}{space 2}  98.6579{col 49}{space 1}    1.72{col 58}{space 3}0.086{col 66}{space 4}-23.77002{col 79}{space 3} 362.9618
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2}-20.10455{col 38}{space 2} 13.76457{col 49}{space 1}   -1.46{col 58}{space 3}0.144{col 66}{space 4}-47.08262{col 79}{space 3} 6.873507
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2} 12.38033{col 38}{space 2} 64.55688{col 49}{space 1}    0.19{col 58}{space 3}0.848{col 66}{space 4}-114.1488{col 79}{space 3} 138.9095
{txt}{space 19}2015  {c |}{col 26}{res}{space 2} 217.0654{col 38}{space 2} 69.91401{col 49}{space 1}    3.10{col 58}{space 3}0.002{col 66}{space 4} 80.03645{col 79}{space 3} 354.0943
{txt}{space 19}2018  {c |}{col 26}{res}{space 2}-50.43774{col 38}{space 2} 64.26783{col 49}{space 1}   -0.78{col 58}{space 3}0.433{col 66}{space 4}-176.4004{col 79}{space 3} 75.52489
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} 648.5588{col 38}{space 2} 316.6244{col 49}{space 1}    2.05{col 58}{space 3}0.041{col 66}{space 4} 27.98633{col 79}{space 3} 1269.131
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}commercial_dummy         {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2}-.0095462{col 38}{space 2} .0010141{col 49}{space 1}   -9.41{col 58}{space 3}0.000{col 66}{space 4}-.0115338{col 79}{space 3}-.0075585
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2}-.0054338{col 38}{space 2} .0006677{col 49}{space 1}   -8.14{col 58}{space 3}0.000{col 66}{space 4}-.0067425{col 79}{space 3}-.0041252
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2}-.0002683{col 38}{space 2}  .000239{col 49}{space 1}   -1.12{col 58}{space 3}0.262{col 66}{space 4}-.0007367{col 79}{space 3} .0002001
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2} .0002368{col 38}{space 2} .0000702{col 49}{space 1}    3.37{col 58}{space 3}0.001{col 66}{space 4} .0000992{col 79}{space 3} .0003745
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2} .0334944{col 38}{space 2} .0167537{col 49}{space 1}    2.00{col 58}{space 3}0.046{col 66}{space 4} .0006578{col 79}{space 3}  .066331
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-1.54e-06{col 38}{space 2} .0001204{col 49}{space 1}   -0.01{col 58}{space 3}0.990{col 66}{space 4}-.0002374{col 79}{space 3} .0002343
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2} .4097053{col 38}{space 2} .0767516{col 49}{space 1}    5.34{col 58}{space 3}0.000{col 66}{space 4} .2592749{col 79}{space 3} .5601358
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}-.0149842{col 38}{space 2} .0026918{col 49}{space 1}   -5.57{col 58}{space 3}0.000{col 66}{space 4}  -.02026{col 79}{space 3}-.0097083
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} .0296757{col 38}{space 2} .0882814{col 49}{space 1}    0.34{col 58}{space 3}0.737{col 66}{space 4}-.1433526{col 79}{space 3} .2027041
{txt}{space 17}femhead {c |}{col 26}{res}{space 2}-.2123379{col 38}{space 2} .0836533{col 49}{space 1}   -2.54{col 58}{space 3}0.011{col 66}{space 4}-.3762953{col 79}{space 3}-.0483804
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2} .0399223{col 38}{space 2} .0079571{col 49}{space 1}    5.02{col 58}{space 3}0.000{col 66}{space 4} .0243266{col 79}{space 3}  .055518
{txt}{space 15}good_soil {c |}{col 26}{res}{space 2} .1856225{col 38}{space 2} .0899945{col 49}{space 1}    2.06{col 58}{space 3}0.039{col 66}{space 4} .0092366{col 79}{space 3} .3620084
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2}   .01167{col 38}{space 2} .0804425{col 49}{space 1}    0.15{col 58}{space 3}0.885{col 66}{space 4}-.1459944{col 79}{space 3} .1693343
{txt}{space 19}2015  {c |}{col 26}{res}{space 2}-.0583315{col 38}{space 2} .0830648{col 49}{space 1}   -0.70{col 58}{space 3}0.483{col 66}{space 4}-.2211355{col 79}{space 3} .1044725
{txt}{space 19}2018  {c |}{col 26}{res}{space 2} -.001766{col 38}{space 2} .0807293{col 49}{space 1}   -0.02{col 58}{space 3}0.983{col 66}{space 4}-.1599926{col 79}{space 3} .1564605
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} .0470748{col 38}{space 2}  .218905{col 49}{space 1}    0.22{col 58}{space 3}0.830{col 66}{space 4}-.3819712{col 79}{space 3} .4761208
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/mills                   {txt}{c |}
{space 18}lambda {c |}{col 26}{res}{space 2}-758.8742{col 38}{space 2} 444.7573{col 49}{space 1}   -1.71{col 58}{space 3}0.088{col 66}{space 4}-1630.582{col 79}{space 3} 112.8341
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                     rho {c |} {res}  -1.00000
                   {txt}sigma {c |} {res} 758.87418
{txt}{hline 25}{c BT}{hline 64}

{com}. predict yhat, xb
{txt}
{com}. predict imr, mills
{txt}
{com}. 
. gen lyhat = log(yhat)
{txt}
{com}. gen ltotal_qty_w = log(total_qty_w + 1)
{txt}
{com}. local time_avg "lyhat ltotal_qty_w"
{txt}
{com}. foreach x in `time_avg' {c -(}
{txt}  2{com}.         bysort hhid : egen TAvg_`x' = mean(`x')
{txt}  3{com}. {c )-}
{txt}
{com}. 
. ** CRE-TOBIT 
. tobit ltotal_qty_w lyhat subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem annual_mean_temp annual_precipitation  TAvg_ltotal_qty_w TAvg_lyhat TAvg_subsidy_qty_w TAvg_dist_market_w  TAvg_real_maize_price_mr TAvg_real_rice_price_mr TAvg_land_holding TAvg_real_hhvalue TAvg_org_fert TAvg_hh_headage TAvg_attend_sch TAvg_femhead TAvg_num_mem  TAvg_annual_mean_temp TAvg_annual_precipitation imr i.year, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 2}Log likelihood = {res:-4585.6661}

Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-4585.6661}  
Iteration 1:{space 2}Log likelihood = {res:-3280.6171}  
Iteration 2:{space 2}Log likelihood = {res:-2933.2846}  
Iteration 3:{space 2}Log likelihood = {res:-2781.9341}  
Iteration 4:{space 2}Log likelihood = {res:-2768.4322}  
Iteration 5:{space 2}Log likelihood = {res:-2767.8382}  
Iteration 6:{space 2}Log likelihood = {res:-2767.8379}  
Iteration 7:{space 2}Log likelihood = {res:-2767.8379}  
{res}
{txt}{col 1}Tobit regression{col 52}{lalign 17:Number of obs}{col 69} = {res}{ralign 7:2,960}
{txt}{col 52}{ralign 17:Uncensored}{col 69} = {res}{ralign 7:777}
{txt}{col 1}Limits: Lower = {ralign 4:{res:0}}{col 52}{ralign 17:Left-censored}{col 69} = {res}{ralign 7:2,183}
{txt}{col 1}        Upper = {ralign 4:{txt:+inf}}{col 52}{ralign 17:   Right-censored}{col 69} = {res}{ralign 7:0}

{txt}{col 52}{lalign 17:LR chi2({res:33})}{col 69} = {res}{ralign 7:1551.55}
{txt}{col 52}{lalign 17:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-2767.8379}{txt}{col 52}{lalign 17:Pseudo R2}{col 69} = {res}{ralign 7:0.2189}

{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}             ltotal_qty_w{col 27}{c |} Coefficient{col 39}  Std. err.{col 51}      t{col 59}   P>|t|{col 67}     [95% con{col 80}f. interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}lyhat {c |}{col 27}{res}{space 2}-8.441195{col 39}{space 2} 2.444273{col 50}{space 1}   -3.45{col 59}{space 3}0.001{col 67}{space 4}-13.23386{col 80}{space 3}-3.648526
{txt}{space 12}subsidy_qty_w {c |}{col 27}{res}{space 2}-.0242189{col 39}{space 2} .0248912{col 50}{space 1}   -0.97{col 59}{space 3}0.331{col 67}{space 4}-.0730249{col 80}{space 3}  .024587
{txt}{space 12}dist_market_w {c |}{col 27}{res}{space 2} .0166479{col 39}{space 2} .0138905{col 50}{space 1}    1.20{col 59}{space 3}0.231{col 67}{space 4}-.0105883{col 80}{space 3} .0438842
{txt}{space 6}real_maize_price_mr {c |}{col 27}{res}{space 2} .0003616{col 39}{space 2} .0013668{col 50}{space 1}    0.26{col 59}{space 3}0.791{col 67}{space 4}-.0023184{col 80}{space 3} .0030417
{txt}{space 7}real_rice_price_mr {c |}{col 27}{res}{space 2}-.0008084{col 39}{space 2} .0008556{col 50}{space 1}   -0.94{col 59}{space 3}0.345{col 67}{space 4}-.0024861{col 80}{space 3} .0008693
{txt}{space 13}land_holding {c |}{col 27}{res}{space 2}-.0654558{col 39}{space 2}  .130739{col 50}{space 1}   -0.50{col 59}{space 3}0.617{col 67}{space 4}-.3218055{col 80}{space 3}  .190894
{txt}{space 13}real_hhvalue {c |}{col 27}{res}{space 2}-.0014515{col 39}{space 2} .0007127{col 50}{space 1}   -2.04{col 59}{space 3}0.042{col 67}{space 4}-.0028488{col 80}{space 3}-.0000541
{txt}{space 17}org_fert {c |}{col 27}{res}{space 2}-1.216282{col 39}{space 2} 1.052144{col 50}{space 1}   -1.16{col 59}{space 3}0.248{col 67}{space 4}-3.279299{col 80}{space 3} .8467359
{txt}{space 15}hh_headage {c |}{col 27}{res}{space 2}-.0092222{col 39}{space 2} .0473098{col 50}{space 1}   -0.19{col 59}{space 3}0.845{col 67}{space 4} -.101986{col 80}{space 3} .0835416
{txt}{space 15}attend_sch {c |}{col 27}{res}{space 2} 1.000127{col 39}{space 2} .4556219{col 50}{space 1}    2.20{col 59}{space 3}0.028{col 67}{space 4} .1067548{col 80}{space 3} 1.893499
{txt}{space 18}femhead {c |}{col 27}{res}{space 2}-.5498775{col 39}{space 2} .9523515{col 50}{space 1}   -0.58{col 59}{space 3}0.564{col 67}{space 4}-2.417224{col 80}{space 3} 1.317469
{txt}{space 18}num_mem {c |}{col 27}{res}{space 2}-.0691386{col 39}{space 2} .1337509{col 50}{space 1}   -0.52{col 59}{space 3}0.605{col 67}{space 4}-.3313939{col 80}{space 3} .1931167
{txt}{space 9}annual_mean_temp {c |}{col 27}{res}{space 2} .0327202{col 39}{space 2} .1006566{col 50}{space 1}    0.33{col 59}{space 3}0.745{col 67}{space 4}-.1646446{col 80}{space 3} .2300851
{txt}{space 5}annual_precipitation {c |}{col 27}{res}{space 2} .0039736{col 39}{space 2} .0098887{col 50}{space 1}    0.40{col 59}{space 3}0.688{col 67}{space 4}-.0154159{col 80}{space 3} .0233632
{txt}{space 8}TAvg_ltotal_qty_w {c |}{col 27}{res}{space 2} 2.699491{col 39}{space 2} .0990947{col 50}{space 1}   27.24{col 59}{space 3}0.000{col 67}{space 4} 2.505189{col 80}{space 3} 2.893794
{txt}{space 15}TAvg_lyhat {c |}{col 27}{res}{space 2} 16.72262{col 39}{space 2}  2.62974{col 50}{space 1}    6.36{col 59}{space 3}0.000{col 67}{space 4} 11.56629{col 80}{space 3} 21.87895
{txt}{space 7}TAvg_subsidy_qty_w {c |}{col 27}{res}{space 2}-.0298171{col 39}{space 2} .0077541{col 50}{space 1}   -3.85{col 59}{space 3}0.000{col 67}{space 4} -.045021{col 80}{space 3}-.0146131
{txt}{space 7}TAvg_dist_market_w {c |}{col 27}{res}{space 2}-.0399156{col 39}{space 2} .0076882{col 50}{space 1}   -5.19{col 59}{space 3}0.000{col 67}{space 4}-.0549904{col 80}{space 3}-.0248408
{txt}{space 1}TAvg_real_maize_price_mr {c |}{col 27}{res}{space 2}-.0044251{col 39}{space 2}  .002321{col 50}{space 1}   -1.91{col 59}{space 3}0.057{col 67}{space 4}-.0089761{col 80}{space 3} .0001259
{txt}{space 2}TAvg_real_rice_price_mr {c |}{col 27}{res}{space 2} .0021469{col 39}{space 2} .0008905{col 50}{space 1}    2.41{col 59}{space 3}0.016{col 67}{space 4} .0004008{col 80}{space 3}  .003893
{txt}{space 8}TAvg_land_holding {c |}{col 27}{res}{space 2} .0672505{col 39}{space 2} .1422121{col 50}{space 1}    0.47{col 59}{space 3}0.636{col 67}{space 4}-.2115954{col 80}{space 3} .3460964
{txt}{space 8}TAvg_real_hhvalue {c |}{col 27}{res}{space 2} .0021595{col 39}{space 2} .0009134{col 50}{space 1}    2.36{col 59}{space 3}0.018{col 67}{space 4} .0003685{col 80}{space 3} .0039504
{txt}{space 12}TAvg_org_fert {c |}{col 27}{res}{space 2} 3.203379{col 39}{space 2} .8289933{col 50}{space 1}    3.86{col 59}{space 3}0.000{col 67}{space 4}  1.57791{col 80}{space 3} 4.828848
{txt}{space 10}TAvg_hh_headage {c |}{col 27}{res}{space 2}-.0684863{col 39}{space 2} .0319302{col 50}{space 1}   -2.14{col 59}{space 3}0.032{col 67}{space 4}-.1310942{col 80}{space 3}-.0058783
{txt}{space 10}TAvg_attend_sch {c |}{col 27}{res}{space 2}-1.318188{col 39}{space 2} .6615237{col 50}{space 1}   -1.99{col 59}{space 3}0.046{col 67}{space 4}-2.615287{col 80}{space 3}-.0210885
{txt}{space 13}TAvg_femhead {c |}{col 27}{res}{space 2}-.4775802{col 39}{space 2} .8721841{col 50}{space 1}   -0.55{col 59}{space 3}0.584{col 67}{space 4}-2.187737{col 80}{space 3} 1.232576
{txt}{space 13}TAvg_num_mem {c |}{col 27}{res}{space 2} .2560988{col 39}{space 2} .1015448{col 50}{space 1}    2.52{col 59}{space 3}0.012{col 67}{space 4} .0569924{col 80}{space 3} .4552051
{txt}{space 4}TAvg_annual_mean_temp {c |}{col 27}{res}{space 2}-.0121784{col 39}{space 2} .1012216{col 50}{space 1}   -0.12{col 59}{space 3}0.904{col 67}{space 4}-.2106512{col 80}{space 3} .1862944
{txt}TAvg_annual_precipitation {c |}{col 27}{res}{space 2}-.0041793{col 39}{space 2} .0098958{col 50}{space 1}   -0.42{col 59}{space 3}0.673{col 67}{space 4}-.0235828{col 80}{space 3} .0152242
{txt}{space 22}imr {c |}{col 27}{res}{space 2} .9351316{col 39}{space 2} 2.455681{col 50}{space 1}    0.38{col 59}{space 3}0.703{col 67}{space 4}-3.879905{col 80}{space 3} 5.750168
{txt}{space 25} {c |}
{space 21}year {c |}
{space 20}2012  {c |}{col 27}{res}{space 2} .4671464{col 39}{space 2} .3184212{col 50}{space 1}    1.47{col 59}{space 3}0.142{col 67}{space 4}-.1572059{col 80}{space 3} 1.091499
{txt}{space 20}2015  {c |}{col 27}{res}{space 2} 1.673219{col 39}{space 2} .6301641{col 50}{space 1}    2.66{col 59}{space 3}0.008{col 67}{space 4} .4376088{col 80}{space 3} 2.908828
{txt}{space 20}2018  {c |}{col 27}{res}{space 2} .5197633{col 39}{space 2} .3960805{col 50}{space 1}    1.31{col 59}{space 3}0.190{col 67}{space 4}-.2568613{col 80}{space 3} 1.296388
{txt}{space 25} {c |}
{space 20}_cons {c |}{col 27}{res}{space 2} -66.2957{col 39}{space 2}  20.8326{col 50}{space 1}   -3.18{col 59}{space 3}0.001{col 67}{space 4}-107.1437{col 80}{space 3}-25.44767
{txt}{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}var(e.ltotal_qty_w){c |}{col 27}{res}{space 2} 14.11811{col 39}{space 2}  .827469{col 67}{space 4} 12.58539{col 80}{space 3}  15.8375
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. margins, predict(ystar(0,.)) dydx(*) post
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,960}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:E(ltotal_qty_w*|ltotal_qty_w>0), predict(ystar(0,.))}{p_end}
{p2col:dy/dx wrt:}{res:lyhat subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem annual_mean_temp annual_precipitation TAvg_ltotal_qty_w TAvg_lyhat TAvg_subsidy_qty_w TAvg_dist_market_w TAvg_real_maize_price_mr TAvg_real_rice_price_mr TAvg_land_holding TAvg_real_hhvalue TAvg_org_fert TAvg_hh_headage TAvg_attend_sch TAvg_femhead TAvg_num_mem TAvg_annual_mean_temp TAvg_annual_precipitation imr 2012.year 2015.year 2018.year}{p_end}
{p2colreset}{...}

{res}{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39} Delta-method
{col 27}{c |}      dy/dx{col 39}   std. err.{col 51}      z{col 59}   P>|z|{col 67}     [95% con{col 80}f. interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}lyhat {c |}{col 27}{res}{space 2}-2.403197{col 39}{space 2} .6942228{col 50}{space 1}   -3.46{col 59}{space 3}0.001{col 67}{space 4}-3.763849{col 80}{space 3}-1.042545
{txt}{space 12}subsidy_qty_w {c |}{col 27}{res}{space 2}-.0068951{col 39}{space 2} .0070881{col 50}{space 1}   -0.97{col 59}{space 3}0.331{col 67}{space 4}-.0207876{col 80}{space 3} .0069974
{txt}{space 12}dist_market_w {c |}{col 27}{res}{space 2} .0047396{col 39}{space 2}  .003953{col 50}{space 1}    1.20{col 59}{space 3}0.231{col 67}{space 4} -.003008{col 80}{space 3} .0124873
{txt}{space 6}real_maize_price_mr {c |}{col 27}{res}{space 2}  .000103{col 39}{space 2} .0003891{col 50}{space 1}    0.26{col 59}{space 3}0.791{col 67}{space 4}-.0006597{col 80}{space 3} .0008656
{txt}{space 7}real_rice_price_mr {c |}{col 27}{res}{space 2}-.0002301{col 39}{space 2} .0002435{col 50}{space 1}   -0.95{col 59}{space 3}0.345{col 67}{space 4}-.0007074{col 80}{space 3} .0002471
{txt}{space 13}land_holding {c |}{col 27}{res}{space 2}-.0186352{col 39}{space 2} .0372152{col 50}{space 1}   -0.50{col 59}{space 3}0.617{col 67}{space 4}-.0915756{col 80}{space 3} .0543052
{txt}{space 13}real_hhvalue {c |}{col 27}{res}{space 2}-.0004132{col 39}{space 2} .0002029{col 50}{space 1}   -2.04{col 59}{space 3}0.042{col 67}{space 4}-.0008108{col 80}{space 3}-.0000156
{txt}{space 17}org_fert {c |}{col 27}{res}{space 2}-.3462738{col 39}{space 2} .2994259{col 50}{space 1}   -1.16{col 59}{space 3}0.247{col 67}{space 4}-.9331378{col 80}{space 3} .2405902
{txt}{space 15}hh_headage {c |}{col 27}{res}{space 2}-.0026255{col 39}{space 2} .0134697{col 50}{space 1}   -0.19{col 59}{space 3}0.845{col 67}{space 4}-.0290257{col 80}{space 3} .0237746
{txt}{space 15}attend_sch {c |}{col 27}{res}{space 2} .2847347{col 39}{space 2} .1296031{col 50}{space 1}    2.20{col 59}{space 3}0.028{col 67}{space 4} .0307174{col 80}{space 3} .5387521
{txt}{space 18}femhead {c |}{col 27}{res}{space 2}-.1565494{col 39}{space 2} .2711849{col 50}{space 1}   -0.58{col 59}{space 3}0.564{col 67}{space 4} -.688062{col 80}{space 3} .3749633
{txt}{space 18}num_mem {c |}{col 27}{res}{space 2}-.0196837{col 39}{space 2} .0380706{col 50}{space 1}   -0.52{col 59}{space 3}0.605{col 67}{space 4}-.0943007{col 80}{space 3} .0549334
{txt}{space 9}annual_mean_temp {c |}{col 27}{res}{space 2} .0093154{col 39}{space 2}  .028657{col 50}{space 1}    0.33{col 59}{space 3}0.745{col 67}{space 4}-.0468513{col 80}{space 3} .0654821
{txt}{space 5}annual_precipitation {c |}{col 27}{res}{space 2} .0011313{col 39}{space 2} .0028151{col 50}{space 1}    0.40{col 59}{space 3}0.688{col 67}{space 4}-.0043861{col 80}{space 3} .0066487
{txt}{space 8}TAvg_ltotal_qty_w {c |}{col 27}{res}{space 2} .7685416{col 39}{space 2} .0263219{col 50}{space 1}   29.20{col 59}{space 3}0.000{col 67}{space 4} .7169515{col 80}{space 3} .8201317
{txt}{space 15}TAvg_lyhat {c |}{col 27}{res}{space 2} 4.760907{col 39}{space 2} .7462947{col 50}{space 1}    6.38{col 59}{space 3}0.000{col 67}{space 4} 3.298196{col 80}{space 3} 6.223618
{txt}{space 7}TAvg_subsidy_qty_w {c |}{col 27}{res}{space 2}-.0084889{col 39}{space 2} .0022042{col 50}{space 1}   -3.85{col 59}{space 3}0.000{col 67}{space 4}-.0128091{col 80}{space 3}-.0041687
{txt}{space 7}TAvg_dist_market_w {c |}{col 27}{res}{space 2}-.0113639{col 39}{space 2} .0021825{col 50}{space 1}   -5.21{col 59}{space 3}0.000{col 67}{space 4}-.0156416{col 80}{space 3}-.0070863
{txt}{space 1}TAvg_real_maize_price_mr {c |}{col 27}{res}{space 2}-.0012598{col 39}{space 2} .0006609{col 50}{space 1}   -1.91{col 59}{space 3}0.057{col 67}{space 4}-.0025552{col 80}{space 3} .0000356
{txt}{space 2}TAvg_real_rice_price_mr {c |}{col 27}{res}{space 2} .0006112{col 39}{space 2} .0002534{col 50}{space 1}    2.41{col 59}{space 3}0.016{col 67}{space 4} .0001145{col 80}{space 3} .0011079
{txt}{space 8}TAvg_land_holding {c |}{col 27}{res}{space 2} .0191461{col 39}{space 2} .0404851{col 50}{space 1}    0.47{col 59}{space 3}0.636{col 67}{space 4}-.0602033{col 80}{space 3} .0984955
{txt}{space 8}TAvg_real_hhvalue {c |}{col 27}{res}{space 2} .0006148{col 39}{space 2} .0002601{col 50}{space 1}    2.36{col 59}{space 3}0.018{col 67}{space 4}  .000105{col 80}{space 3} .0011246
{txt}{space 12}TAvg_org_fert {c |}{col 27}{res}{space 2} .9119978{col 39}{space 2}  .235768{col 50}{space 1}    3.87{col 59}{space 3}0.000{col 67}{space 4}  .449901{col 80}{space 3} 1.374095
{txt}{space 10}TAvg_hh_headage {c |}{col 27}{res}{space 2}-.0194979{col 39}{space 2} .0090864{col 50}{space 1}   -2.15{col 59}{space 3}0.032{col 67}{space 4} -.037307{col 80}{space 3}-.0016889
{txt}{space 10}TAvg_attend_sch {c |}{col 27}{res}{space 2}-.3752862{col 39}{space 2} .1882366{col 50}{space 1}   -1.99{col 59}{space 3}0.046{col 67}{space 4}-.7442232{col 80}{space 3}-.0063493
{txt}{space 13}TAvg_femhead {c |}{col 27}{res}{space 2}-.1359665{col 39}{space 2}  .248289{col 50}{space 1}   -0.55{col 59}{space 3}0.584{col 67}{space 4}-.6226039{col 80}{space 3}  .350671
{txt}{space 13}TAvg_num_mem {c |}{col 27}{res}{space 2}  .072911{col 39}{space 2} .0288808{col 50}{space 1}    2.52{col 59}{space 3}0.012{col 67}{space 4} .0163057{col 80}{space 3} .1295163
{txt}{space 4}TAvg_annual_mean_temp {c |}{col 27}{res}{space 2}-.0034672{col 39}{space 2} .0288178{col 50}{space 1}   -0.12{col 59}{space 3}0.904{col 67}{space 4}-.0599491{col 80}{space 3} .0530147
{txt}TAvg_annual_precipitation {c |}{col 27}{res}{space 2}-.0011898{col 39}{space 2} .0028171{col 50}{space 1}   -0.42{col 59}{space 3}0.673{col 67}{space 4}-.0067112{col 80}{space 3} .0043315
{txt}{space 22}imr {c |}{col 27}{res}{space 2} .2662307{col 39}{space 2}  .699154{col 50}{space 1}    0.38{col 59}{space 3}0.703{col 67}{space 4}-1.104086{col 80}{space 3} 1.636547
{txt}{space 25} {c |}
{space 21}year {c |}
{space 20}2012  {c |}{col 27}{res}{space 2} .1227032{col 39}{space 2} .0836061{col 50}{space 1}    1.47{col 59}{space 3}0.142{col 67}{space 4}-.0411618{col 80}{space 3} .2865683
{txt}{space 20}2015  {c |}{col 27}{res}{space 2}  .496449{col 39}{space 2} .2017242{col 50}{space 1}    2.46{col 59}{space 3}0.014{col 67}{space 4}  .101077{col 80}{space 3} .8918211
{txt}{space 20}2018  {c |}{col 27}{res}{space 2} .1372635{col 39}{space 2} .1057639{col 50}{space 1}    1.30{col 59}{space 3}0.194{col 67}{space 4}-.0700299{col 80}{space 3}  .344557
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 91}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. restore
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD798_000000.tmp"
{txt}
{com}.  preserve 
{txt}
{com}. heckman real_tpricefert_cens_mrk subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem  i.year, select (commercial_dummy= subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem good_soil  i.year) twostep
{txt}note: two-step estimate of rho = -1.054279 is being truncated to -1
{res}
{txt}Heckman selection model -- two-step estimates   Number of obs     = {res}     2,960
{txt}(regression model with sample selection)              Selected    = {res}       777
                                                {txt}      Nonselected = {res}     2,183

                                                {txt}Wald chi2({res}14{txt})     =  {res}    26.08
                                                {txt}Prob > chi2       =     {res}0.0253

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      z{col 58}   P>|z|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}real_tpricefert_cens_mrk {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2} 5.514288{col 38}{space 2}  3.52975{col 49}{space 1}    1.56{col 58}{space 3}0.118{col 66}{space 4}-1.403896{col 79}{space 3} 12.43247
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2} 2.550006{col 38}{space 2} 1.781492{col 49}{space 1}    1.43{col 58}{space 3}0.152{col 66}{space 4}-.9416532{col 79}{space 3} 6.041665
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2} .2647049{col 38}{space 2} .2162539{col 49}{space 1}    1.22{col 58}{space 3}0.221{col 66}{space 4}-.1591449{col 79}{space 3} .6885547
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2}-.2482749{col 38}{space 2}  .091177{col 49}{space 1}   -2.72{col 58}{space 3}0.006{col 66}{space 4}-.4269784{col 79}{space 3}-.0695713
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2}-21.68282{col 38}{space 2} 16.39501{col 49}{space 1}   -1.32{col 58}{space 3}0.186{col 66}{space 4}-53.81644{col 79}{space 3}  10.4508
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0385828{col 38}{space 2}  .094371{col 49}{space 1}   -0.41{col 58}{space 3}0.683{col 66}{space 4}-.2235466{col 79}{space 3} .1463809
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2}-184.6365{col 38}{space 2}  135.634{col 49}{space 1}   -1.36{col 58}{space 3}0.173{col 66}{space 4}-450.4743{col 79}{space 3} 81.20123
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}   8.9986{col 38}{space 2} 5.323375{col 49}{space 1}    1.69{col 58}{space 3}0.091{col 66}{space 4}-1.435023{col 79}{space 3} 19.43222
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} 43.60196{col 38}{space 2} 70.60027{col 49}{space 1}    0.62{col 58}{space 3}0.537{col 66}{space 4}-94.77203{col 79}{space 3}  181.976
{txt}{space 17}femhead {c |}{col 26}{res}{space 2} 169.5959{col 38}{space 2}  98.6579{col 49}{space 1}    1.72{col 58}{space 3}0.086{col 66}{space 4}-23.77002{col 79}{space 3} 362.9618
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2}-20.10455{col 38}{space 2} 13.76457{col 49}{space 1}   -1.46{col 58}{space 3}0.144{col 66}{space 4}-47.08262{col 79}{space 3} 6.873507
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2} 12.38033{col 38}{space 2} 64.55688{col 49}{space 1}    0.19{col 58}{space 3}0.848{col 66}{space 4}-114.1488{col 79}{space 3} 138.9095
{txt}{space 19}2015  {c |}{col 26}{res}{space 2} 217.0654{col 38}{space 2} 69.91401{col 49}{space 1}    3.10{col 58}{space 3}0.002{col 66}{space 4} 80.03645{col 79}{space 3} 354.0943
{txt}{space 19}2018  {c |}{col 26}{res}{space 2}-50.43774{col 38}{space 2} 64.26783{col 49}{space 1}   -0.78{col 58}{space 3}0.433{col 66}{space 4}-176.4004{col 79}{space 3} 75.52489
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} 648.5588{col 38}{space 2} 316.6244{col 49}{space 1}    2.05{col 58}{space 3}0.041{col 66}{space 4} 27.98633{col 79}{space 3} 1269.131
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}commercial_dummy         {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2}-.0095462{col 38}{space 2} .0010141{col 49}{space 1}   -9.41{col 58}{space 3}0.000{col 66}{space 4}-.0115338{col 79}{space 3}-.0075585
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2}-.0054338{col 38}{space 2} .0006677{col 49}{space 1}   -8.14{col 58}{space 3}0.000{col 66}{space 4}-.0067425{col 79}{space 3}-.0041252
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2}-.0002683{col 38}{space 2}  .000239{col 49}{space 1}   -1.12{col 58}{space 3}0.262{col 66}{space 4}-.0007367{col 79}{space 3} .0002001
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2} .0002368{col 38}{space 2} .0000702{col 49}{space 1}    3.37{col 58}{space 3}0.001{col 66}{space 4} .0000992{col 79}{space 3} .0003745
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2} .0334944{col 38}{space 2} .0167537{col 49}{space 1}    2.00{col 58}{space 3}0.046{col 66}{space 4} .0006578{col 79}{space 3}  .066331
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-1.54e-06{col 38}{space 2} .0001204{col 49}{space 1}   -0.01{col 58}{space 3}0.990{col 66}{space 4}-.0002374{col 79}{space 3} .0002343
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2} .4097053{col 38}{space 2} .0767516{col 49}{space 1}    5.34{col 58}{space 3}0.000{col 66}{space 4} .2592749{col 79}{space 3} .5601358
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}-.0149842{col 38}{space 2} .0026918{col 49}{space 1}   -5.57{col 58}{space 3}0.000{col 66}{space 4}  -.02026{col 79}{space 3}-.0097083
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} .0296757{col 38}{space 2} .0882814{col 49}{space 1}    0.34{col 58}{space 3}0.737{col 66}{space 4}-.1433526{col 79}{space 3} .2027041
{txt}{space 17}femhead {c |}{col 26}{res}{space 2}-.2123379{col 38}{space 2} .0836533{col 49}{space 1}   -2.54{col 58}{space 3}0.011{col 66}{space 4}-.3762953{col 79}{space 3}-.0483804
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2} .0399223{col 38}{space 2} .0079571{col 49}{space 1}    5.02{col 58}{space 3}0.000{col 66}{space 4} .0243266{col 79}{space 3}  .055518
{txt}{space 15}good_soil {c |}{col 26}{res}{space 2} .1856225{col 38}{space 2} .0899945{col 49}{space 1}    2.06{col 58}{space 3}0.039{col 66}{space 4} .0092366{col 79}{space 3} .3620084
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2}   .01167{col 38}{space 2} .0804425{col 49}{space 1}    0.15{col 58}{space 3}0.885{col 66}{space 4}-.1459944{col 79}{space 3} .1693343
{txt}{space 19}2015  {c |}{col 26}{res}{space 2}-.0583315{col 38}{space 2} .0830648{col 49}{space 1}   -0.70{col 58}{space 3}0.483{col 66}{space 4}-.2211355{col 79}{space 3} .1044725
{txt}{space 19}2018  {c |}{col 26}{res}{space 2} -.001766{col 38}{space 2} .0807293{col 49}{space 1}   -0.02{col 58}{space 3}0.983{col 66}{space 4}-.1599926{col 79}{space 3} .1564605
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} .0470748{col 38}{space 2}  .218905{col 49}{space 1}    0.22{col 58}{space 3}0.830{col 66}{space 4}-.3819712{col 79}{space 3} .4761208
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/mills                   {txt}{c |}
{space 18}lambda {c |}{col 26}{res}{space 2}-758.8742{col 38}{space 2} 444.7573{col 49}{space 1}   -1.71{col 58}{space 3}0.088{col 66}{space 4}-1630.582{col 79}{space 3} 112.8341
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                     rho {c |} {res}  -1.00000
                   {txt}sigma {c |} {res} 758.87418
{txt}{hline 25}{c BT}{hline 64}

{com}. predict yhat, xb
{txt}
{com}. predict imr, mills
{txt}
{com}. 
. ************winzonrizing fertilizer market price
. foreach v of varlist  yhat  {c -(}
{txt}  2{com}.         _pctile `v' [aw=weight] , p(1 95) 
{txt}  3{com}.         gen `v'_w=`v'
{txt}  4{com}.         *replace  `v'_w = r(r1) if  `v'_w < r(r1) &  `v'_w!=.
.         replace  `v'_w = r(r2) if  `v'_w > r(r2) &  `v'_w!=.
{txt}  5{com}.         local l`v' : var lab `v'
{txt}  6{com}.         lab var  `v'_w  "`l`v'' - Winzorized top & bottom 5%"
{txt}  7{com}. {c )-}
{txt}(135 real changes made)

{com}. 
. 
. gen lyhat = log(yhat_w)
{txt}
{com}. gen ltotal_qty_w = log(total_qty_w + 1)
{txt}
{com}. local time_avg "lyhat ltotal_qty_w"
{txt}
{com}. foreach x in `time_avg' {c -(}
{txt}  2{com}.         bysort hhid : egen TAvg_`x' = mean(`x')
{txt}  3{com}. {c )-}
{txt}
{com}. 
. ** CRE-TOBIT 
. tobit ltotal_qty_w lyhat subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem annual_mean_temp annual_precipitation  TAvg_ltotal_qty_w TAvg_lyhat TAvg_subsidy_qty_w TAvg_dist_market_w  TAvg_real_maize_price_mr TAvg_real_rice_price_mr TAvg_land_holding TAvg_real_hhvalue TAvg_org_fert TAvg_hh_headage TAvg_attend_sch TAvg_femhead TAvg_num_mem  TAvg_annual_mean_temp TAvg_annual_precipitation imr i.year, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 2}Log likelihood = {res: -4583.127}

Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res: -4583.127}  
Iteration 1:{space 2}Log likelihood = {res:-3277.1764}  
Iteration 2:{space 2}Log likelihood = {res:-2796.4524}  
Iteration 3:{space 2}Log likelihood = {res:-2769.6575}  
Iteration 4:{space 2}Log likelihood = {res:-2767.7106}  
Iteration 5:{space 2}Log likelihood = {res:-2767.7054}  
Iteration 6:{space 2}Log likelihood = {res:-2767.7054}  
{res}
{txt}{col 1}Tobit regression{col 52}{lalign 17:Number of obs}{col 69} = {res}{ralign 7:2,960}
{txt}{col 52}{ralign 17:Uncensored}{col 69} = {res}{ralign 7:777}
{txt}{col 1}Limits: Lower = {ralign 4:{res:0}}{col 52}{ralign 17:Left-censored}{col 69} = {res}{ralign 7:2,183}
{txt}{col 1}        Upper = {ralign 4:{txt:+inf}}{col 52}{ralign 17:   Right-censored}{col 69} = {res}{ralign 7:0}

{txt}{col 52}{lalign 17:LR chi2({res:33})}{col 69} = {res}{ralign 7:1551.82}
{txt}{col 52}{lalign 17:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-2767.7054}{txt}{col 52}{lalign 17:Pseudo R2}{col 69} = {res}{ralign 7:0.2190}

{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}             ltotal_qty_w{col 27}{c |} Coefficient{col 39}  Std. err.{col 51}      t{col 59}   P>|t|{col 67}     [95% con{col 80}f. interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}lyhat {c |}{col 27}{res}{space 2}-7.483772{col 39}{space 2} 2.239527{col 50}{space 1}   -3.34{col 59}{space 3}0.001{col 67}{space 4}-11.87498{col 80}{space 3}-3.092564
{txt}{space 12}subsidy_qty_w {c |}{col 27}{res}{space 2}-.0260889{col 39}{space 2} .0242461{col 50}{space 1}   -1.08{col 59}{space 3}0.282{col 67}{space 4}  -.07363{col 80}{space 3} .0214521
{txt}{space 12}dist_market_w {c |}{col 27}{res}{space 2} .0160787{col 39}{space 2} .0136054{col 50}{space 1}    1.18{col 59}{space 3}0.237{col 67}{space 4}-.0105984{col 80}{space 3} .0427558
{txt}{space 6}real_maize_price_mr {c |}{col 27}{res}{space 2} .0002139{col 39}{space 2} .0013418{col 50}{space 1}    0.16{col 59}{space 3}0.873{col 67}{space 4} -.002417{col 80}{space 3} .0028449
{txt}{space 7}real_rice_price_mr {c |}{col 27}{res}{space 2}-.0006826{col 39}{space 2} .0008277{col 50}{space 1}   -0.82{col 59}{space 3}0.410{col 67}{space 4}-.0023056{col 80}{space 3} .0009405
{txt}{space 13}land_holding {c |}{col 27}{res}{space 2} -.060958{col 39}{space 2} .1289102{col 50}{space 1}   -0.47{col 59}{space 3}0.636{col 67}{space 4}-.3137218{col 80}{space 3} .1918058
{txt}{space 13}real_hhvalue {c |}{col 27}{res}{space 2}-.0013836{col 39}{space 2}   .00071{col 50}{space 1}   -1.95{col 59}{space 3}0.051{col 67}{space 4}-.0027757{col 80}{space 3} 8.47e-06
{txt}{space 17}org_fert {c |}{col 27}{res}{space 2}-1.136047{col 39}{space 2} 1.027554{col 50}{space 1}   -1.11{col 59}{space 3}0.269{col 67}{space 4}-3.150849{col 80}{space 3} .8787546
{txt}{space 15}hh_headage {c |}{col 27}{res}{space 2}-.0114457{col 39}{space 2} .0464161{col 50}{space 1}   -0.25{col 59}{space 3}0.805{col 67}{space 4}-.1024572{col 80}{space 3} .0795659
{txt}{space 15}attend_sch {c |}{col 27}{res}{space 2} .9496348{col 39}{space 2} .4527364{col 50}{space 1}    2.10{col 59}{space 3}0.036{col 67}{space 4} .0619207{col 80}{space 3} 1.837349
{txt}{space 18}femhead {c |}{col 27}{res}{space 2}-.6172946{col 39}{space 2} .9389301{col 50}{space 1}   -0.66{col 59}{space 3}0.511{col 67}{space 4}-2.458325{col 80}{space 3} 1.223736
{txt}{space 18}num_mem {c |}{col 27}{res}{space 2}-.0646521{col 39}{space 2} .1311518{col 50}{space 1}   -0.49{col 59}{space 3}0.622{col 67}{space 4}-.3218113{col 80}{space 3} .1925071
{txt}{space 9}annual_mean_temp {c |}{col 27}{res}{space 2} .0326381{col 39}{space 2} .1006723{col 50}{space 1}    0.32{col 59}{space 3}0.746{col 67}{space 4}-.1647576{col 80}{space 3} .2300338
{txt}{space 5}annual_precipitation {c |}{col 27}{res}{space 2} .0040485{col 39}{space 2} .0098796{col 50}{space 1}    0.41{col 59}{space 3}0.682{col 67}{space 4}-.0153232{col 80}{space 3} .0234202
{txt}{space 8}TAvg_ltotal_qty_w {c |}{col 27}{res}{space 2} 2.695933{col 39}{space 2} .0990301{col 50}{space 1}   27.22{col 59}{space 3}0.000{col 67}{space 4} 2.501758{col 80}{space 3} 2.890109
{txt}{space 15}TAvg_lyhat {c |}{col 27}{res}{space 2} 11.59326{col 39}{space 2} 1.840159{col 50}{space 1}    6.30{col 59}{space 3}0.000{col 67}{space 4} 7.985123{col 80}{space 3}  15.2014
{txt}{space 7}TAvg_subsidy_qty_w {c |}{col 27}{res}{space 2}-.0056267{col 39}{space 2} .0042655{col 50}{space 1}   -1.32{col 59}{space 3}0.187{col 67}{space 4}-.0139904{col 80}{space 3}  .002737
{txt}{space 7}TAvg_dist_market_w {c |}{col 27}{res}{space 2}-.0278019{col 39}{space 2} .0064117{col 50}{space 1}   -4.34{col 59}{space 3}0.000{col 67}{space 4}-.0403738{col 80}{space 3}-.0152299
{txt}{space 1}TAvg_real_maize_price_mr {c |}{col 27}{res}{space 2}-.0030604{col 39}{space 2} .0022713{col 50}{space 1}   -1.35{col 59}{space 3}0.178{col 67}{space 4}-.0075138{col 80}{space 3} .0013931
{txt}{space 2}TAvg_real_rice_price_mr {c |}{col 27}{res}{space 2} .0009814{col 39}{space 2} .0007981{col 50}{space 1}    1.23{col 59}{space 3}0.219{col 67}{space 4}-.0005834{col 80}{space 3} .0025463
{txt}{space 8}TAvg_land_holding {c |}{col 27}{res}{space 2}-.0377065{col 39}{space 2} .1368293{col 50}{space 1}   -0.28{col 59}{space 3}0.783{col 67}{space 4}-.3059979{col 80}{space 3} .2305848
{txt}{space 8}TAvg_real_hhvalue {c |}{col 27}{res}{space 2} .0019327{col 39}{space 2} .0009078{col 50}{space 1}    2.13{col 59}{space 3}0.033{col 67}{space 4} .0001527{col 80}{space 3} .0037127
{txt}{space 12}TAvg_org_fert {c |}{col 27}{res}{space 2} 2.173775{col 39}{space 2} .7473131{col 50}{space 1}    2.91{col 59}{space 3}0.004{col 67}{space 4} .7084621{col 80}{space 3} 3.639088
{txt}{space 10}TAvg_hh_headage {c |}{col 27}{res}{space 2}-.0290997{col 39}{space 2}  .028612{col 50}{space 1}   -1.02{col 59}{space 3}0.309{col 67}{space 4}-.0852014{col 80}{space 3}  .027002
{txt}{space 10}TAvg_attend_sch {c |}{col 27}{res}{space 2}-1.082596{col 39}{space 2} .6544861{col 50}{space 1}   -1.65{col 59}{space 3}0.098{col 67}{space 4}-2.365896{col 80}{space 3} .2007035
{txt}{space 13}TAvg_femhead {c |}{col 27}{res}{space 2} .2175953{col 39}{space 2} .8335751{col 50}{space 1}    0.26{col 59}{space 3}0.794{col 67}{space 4}-1.416858{col 80}{space 3} 1.852048
{txt}{space 13}TAvg_num_mem {c |}{col 27}{res}{space 2} .1585547{col 39}{space 2} .0948475{col 50}{space 1}    1.67{col 59}{space 3}0.095{col 67}{space 4}-.0274199{col 80}{space 3} .3445292
{txt}{space 4}TAvg_annual_mean_temp {c |}{col 27}{res}{space 2}-.0109219{col 39}{space 2} .1012386{col 50}{space 1}   -0.11{col 59}{space 3}0.914{col 67}{space 4} -.209428{col 80}{space 3} .1875842
{txt}TAvg_annual_precipitation {c |}{col 27}{res}{space 2}-.0042415{col 39}{space 2} .0098868{col 50}{space 1}   -0.43{col 59}{space 3}0.668{col 67}{space 4}-.0236272{col 80}{space 3} .0151443
{txt}{space 22}imr {c |}{col 27}{res}{space 2} .4936504{col 39}{space 2} 2.458791{col 50}{space 1}    0.20{col 59}{space 3}0.841{col 67}{space 4}-4.327486{col 80}{space 3} 5.314786
{txt}{space 25} {c |}
{space 21}year {c |}
{space 20}2012  {c |}{col 27}{res}{space 2} .4648303{col 39}{space 2} .3181423{col 50}{space 1}    1.46{col 59}{space 3}0.144{col 67}{space 4}-.1589751{col 80}{space 3} 1.088636
{txt}{space 20}2015  {c |}{col 27}{res}{space 2} 1.525883{col 39}{space 2} .6015135{col 50}{space 1}    2.54{col 59}{space 3}0.011{col 67}{space 4} .3464503{col 80}{space 3} 2.705315
{txt}{space 20}2018  {c |}{col 27}{res}{space 2} .5751813{col 39}{space 2} .3924249{col 50}{space 1}    1.47{col 59}{space 3}0.143{col 67}{space 4}-.1942755{col 80}{space 3} 1.344638
{txt}{space 25} {c |}
{space 20}_cons {c |}{col 27}{res}{space 2}-38.65298{col 39}{space 2} 18.12452{col 50}{space 1}   -2.13{col 59}{space 3}0.033{col 67}{space 4}-74.19109{col 80}{space 3}-3.114876
{txt}{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}var(e.ltotal_qty_w){c |}{col 27}{res}{space 2} 14.10125{col 39}{space 2} .8264949{col 67}{space 4} 12.57034{col 80}{space 3} 15.81862
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. margins, predict(ystar(0,.)) dydx(*) post
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,960}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:E(ltotal_qty_w*|ltotal_qty_w>0), predict(ystar(0,.))}{p_end}
{p2col:dy/dx wrt:}{res:lyhat subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem annual_mean_temp annual_precipitation TAvg_ltotal_qty_w TAvg_lyhat TAvg_subsidy_qty_w TAvg_dist_market_w TAvg_real_maize_price_mr TAvg_real_rice_price_mr TAvg_land_holding TAvg_real_hhvalue TAvg_org_fert TAvg_hh_headage TAvg_attend_sch TAvg_femhead TAvg_num_mem TAvg_annual_mean_temp TAvg_annual_precipitation imr 2012.year 2015.year 2018.year}{p_end}
{p2colreset}{...}

{res}{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39} Delta-method
{col 27}{c |}      dy/dx{col 39}   std. err.{col 51}      z{col 59}   P>|z|{col 67}     [95% con{col 80}f. interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}lyhat {c |}{col 27}{res}{space 2}-2.131046{col 39}{space 2} .6362739{col 50}{space 1}   -3.35{col 59}{space 3}0.001{col 67}{space 4} -3.37812{col 80}{space 3}-.8839724
{txt}{space 12}subsidy_qty_w {c |}{col 27}{res}{space 2} -.007429{col 39}{space 2} .0069058{col 50}{space 1}   -1.08{col 59}{space 3}0.282{col 67}{space 4}-.0209641{col 80}{space 3} .0061062
{txt}{space 12}dist_market_w {c |}{col 27}{res}{space 2} .0045785{col 39}{space 2} .0038727{col 50}{space 1}    1.18{col 59}{space 3}0.237{col 67}{space 4}-.0030118{col 80}{space 3} .0121688
{txt}{space 6}real_maize_price_mr {c |}{col 27}{res}{space 2} .0000609{col 39}{space 2} .0003821{col 50}{space 1}    0.16{col 59}{space 3}0.873{col 67}{space 4}-.0006879{col 80}{space 3} .0008098
{txt}{space 7}real_rice_price_mr {c |}{col 27}{res}{space 2}-.0001944{col 39}{space 2} .0002356{col 50}{space 1}   -0.82{col 59}{space 3}0.409{col 67}{space 4}-.0006562{col 80}{space 3} .0002674
{txt}{space 13}land_holding {c |}{col 27}{res}{space 2}-.0173581{col 39}{space 2} .0367024{col 50}{space 1}   -0.47{col 59}{space 3}0.636{col 67}{space 4}-.0892936{col 80}{space 3} .0545773
{txt}{space 13}real_hhvalue {c |}{col 27}{res}{space 2} -.000394{col 39}{space 2} .0002021{col 50}{space 1}   -1.95{col 59}{space 3}0.051{col 67}{space 4}-.0007902{col 80}{space 3} 2.19e-06
{txt}{space 17}org_fert {c |}{col 27}{res}{space 2}-.3234959{col 39}{space 2} .2924969{col 50}{space 1}   -1.11{col 59}{space 3}0.269{col 67}{space 4}-.8967792{col 80}{space 3} .2497875
{txt}{space 15}hh_headage {c |}{col 27}{res}{space 2}-.0032592{col 39}{space 2} .0132181{col 50}{space 1}   -0.25{col 59}{space 3}0.805{col 67}{space 4}-.0291662{col 80}{space 3} .0226477
{txt}{space 15}attend_sch {c |}{col 27}{res}{space 2} .2704139{col 39}{space 2} .1288166{col 50}{space 1}    2.10{col 59}{space 3}0.036{col 67}{space 4} .0179379{col 80}{space 3} .5228898
{txt}{space 18}femhead {c |}{col 27}{res}{space 2}-.1757781{col 39}{space 2} .2674205{col 50}{space 1}   -0.66{col 59}{space 3}0.511{col 67}{space 4}-.6999127{col 80}{space 3} .3483565
{txt}{space 18}num_mem {c |}{col 27}{res}{space 2}  -.01841{col 39}{space 2} .0373389{col 50}{space 1}   -0.49{col 59}{space 3}0.622{col 67}{space 4} -.091593{col 80}{space 3} .0547729
{txt}{space 9}annual_mean_temp {c |}{col 27}{res}{space 2} .0092939{col 39}{space 2} .0286673{col 50}{space 1}    0.32{col 59}{space 3}0.746{col 67}{space 4}-.0468929{col 80}{space 3} .0654807
{txt}{space 5}annual_precipitation {c |}{col 27}{res}{space 2} .0011528{col 39}{space 2}  .002813{col 50}{space 1}    0.41{col 59}{space 3}0.682{col 67}{space 4}-.0043606{col 80}{space 3} .0066662
{txt}{space 8}TAvg_ltotal_qty_w {c |}{col 27}{res}{space 2} .7676822{col 39}{space 2} .0263201{col 50}{space 1}   29.17{col 59}{space 3}0.000{col 67}{space 4} .7160957{col 80}{space 3} .8192687
{txt}{space 15}TAvg_lyhat {c |}{col 27}{res}{space 2} 3.301246{col 39}{space 2} .5225096{col 50}{space 1}    6.32{col 59}{space 3}0.000{col 67}{space 4} 2.277146{col 80}{space 3} 4.325346
{txt}{space 7}TAvg_subsidy_qty_w {c |}{col 27}{res}{space 2}-.0016022{col 39}{space 2} .0012142{col 50}{space 1}   -1.32{col 59}{space 3}0.187{col 67}{space 4}-.0039821{col 80}{space 3} .0007776
{txt}{space 7}TAvg_dist_market_w {c |}{col 27}{res}{space 2}-.0079167{col 39}{space 2} .0018218{col 50}{space 1}   -4.35{col 59}{space 3}0.000{col 67}{space 4}-.0114873{col 80}{space 3}-.0043462
{txt}{space 1}TAvg_real_maize_price_mr {c |}{col 27}{res}{space 2}-.0008715{col 39}{space 2} .0006469{col 50}{space 1}   -1.35{col 59}{space 3}0.178{col 67}{space 4}-.0021394{col 80}{space 3} .0003965
{txt}{space 2}TAvg_real_rice_price_mr {c |}{col 27}{res}{space 2} .0002795{col 39}{space 2} .0002272{col 50}{space 1}    1.23{col 59}{space 3}0.219{col 67}{space 4}-.0001659{col 80}{space 3} .0007249
{txt}{space 8}TAvg_land_holding {c |}{col 27}{res}{space 2}-.0107371{col 39}{space 2} .0389636{col 50}{space 1}   -0.28{col 59}{space 3}0.783{col 67}{space 4}-.0871044{col 80}{space 3} .0656301
{txt}{space 8}TAvg_real_hhvalue {c |}{col 27}{res}{space 2} .0005504{col 39}{space 2} .0002586{col 50}{space 1}    2.13{col 59}{space 3}0.033{col 67}{space 4} .0000436{col 80}{space 3} .0010571
{txt}{space 12}TAvg_org_fert {c |}{col 27}{res}{space 2} .6189946{col 39}{space 2} .2126902{col 50}{space 1}    2.91{col 59}{space 3}0.004{col 67}{space 4} .2021295{col 80}{space 3}  1.03586
{txt}{space 10}TAvg_hh_headage {c |}{col 27}{res}{space 2}-.0082863{col 39}{space 2} .0081465{col 50}{space 1}   -1.02{col 59}{space 3}0.309{col 67}{space 4}-.0242531{col 80}{space 3} .0076805
{txt}{space 10}TAvg_attend_sch {c |}{col 27}{res}{space 2}-.3082754{col 39}{space 2} .1862963{col 50}{space 1}   -1.65{col 59}{space 3}0.098{col 67}{space 4}-.6734095{col 80}{space 3} .0568587
{txt}{space 13}TAvg_femhead {c |}{col 27}{res}{space 2} .0619615{col 39}{space 2} .2373706{col 50}{space 1}    0.26{col 59}{space 3}0.794{col 67}{space 4}-.4032764{col 80}{space 3} .5271994
{txt}{space 13}TAvg_num_mem {c |}{col 27}{res}{space 2} .0451493{col 39}{space 2} .0269936{col 50}{space 1}    1.67{col 59}{space 3}0.094{col 67}{space 4}-.0077571{col 80}{space 3} .0980558
{txt}{space 4}TAvg_annual_mean_temp {c |}{col 27}{res}{space 2}-.0031101{col 39}{space 2} .0288284{col 50}{space 1}   -0.11{col 59}{space 3}0.914{col 67}{space 4}-.0596128{col 80}{space 3} .0533926
{txt}TAvg_annual_precipitation {c |}{col 27}{res}{space 2}-.0012078{col 39}{space 2} .0028151{col 50}{space 1}   -0.43{col 59}{space 3}0.668{col 67}{space 4}-.0067252{col 80}{space 3} .0043096
{txt}{space 22}imr {c |}{col 27}{res}{space 2} .1405697{col 39}{space 2} .7001693{col 50}{space 1}    0.20{col 59}{space 3}0.841{col 67}{space 4}-1.231737{col 80}{space 3} 1.512876
{txt}{space 25} {c |}
{space 21}year {c |}
{space 20}2012  {c |}{col 27}{res}{space 2} .1225087{col 39}{space 2} .0838167{col 50}{space 1}    1.46{col 59}{space 3}0.144{col 67}{space 4}-.0417691{col 80}{space 3} .2867864
{txt}{space 20}2015  {c |}{col 27}{res}{space 2} .4477553{col 39}{space 2} .1885165{col 50}{space 1}    2.38{col 59}{space 3}0.018{col 67}{space 4} .0782697{col 80}{space 3} .8172409
{txt}{space 20}2018  {c |}{col 27}{res}{space 2}  .153318{col 39}{space 2} .1057261{col 50}{space 1}    1.45{col 59}{space 3}0.147{col 67}{space 4}-.0539013{col 80}{space 3} .3605373
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 91}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. restore
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD798_000000.tmp"
{txt}
{com}.  preserve 
{txt}
{com}. heckman real_tpricefert_cens_mrk subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem i.year, select (commercial_dummy= subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem good_soil  i.year) twostep
{txt}note: two-step estimate of rho = -1.054279 is being truncated to -1
{res}
{txt}Heckman selection model -- two-step estimates   Number of obs     = {res}     2,960
{txt}(regression model with sample selection)              Selected    = {res}       777
                                                {txt}      Nonselected = {res}     2,183

                                                {txt}Wald chi2({res}14{txt})     =  {res}    26.08
                                                {txt}Prob > chi2       =     {res}0.0253

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      z{col 58}   P>|z|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}real_tpricefert_cens_mrk {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2} 5.514288{col 38}{space 2}  3.52975{col 49}{space 1}    1.56{col 58}{space 3}0.118{col 66}{space 4}-1.403896{col 79}{space 3} 12.43247
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2} 2.550006{col 38}{space 2} 1.781492{col 49}{space 1}    1.43{col 58}{space 3}0.152{col 66}{space 4}-.9416532{col 79}{space 3} 6.041665
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2} .2647049{col 38}{space 2} .2162539{col 49}{space 1}    1.22{col 58}{space 3}0.221{col 66}{space 4}-.1591449{col 79}{space 3} .6885547
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2}-.2482749{col 38}{space 2}  .091177{col 49}{space 1}   -2.72{col 58}{space 3}0.006{col 66}{space 4}-.4269784{col 79}{space 3}-.0695713
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2}-21.68282{col 38}{space 2} 16.39501{col 49}{space 1}   -1.32{col 58}{space 3}0.186{col 66}{space 4}-53.81644{col 79}{space 3}  10.4508
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0385828{col 38}{space 2}  .094371{col 49}{space 1}   -0.41{col 58}{space 3}0.683{col 66}{space 4}-.2235466{col 79}{space 3} .1463809
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2}-184.6365{col 38}{space 2}  135.634{col 49}{space 1}   -1.36{col 58}{space 3}0.173{col 66}{space 4}-450.4743{col 79}{space 3} 81.20123
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}   8.9986{col 38}{space 2} 5.323375{col 49}{space 1}    1.69{col 58}{space 3}0.091{col 66}{space 4}-1.435023{col 79}{space 3} 19.43222
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} 43.60196{col 38}{space 2} 70.60027{col 49}{space 1}    0.62{col 58}{space 3}0.537{col 66}{space 4}-94.77203{col 79}{space 3}  181.976
{txt}{space 17}femhead {c |}{col 26}{res}{space 2} 169.5959{col 38}{space 2}  98.6579{col 49}{space 1}    1.72{col 58}{space 3}0.086{col 66}{space 4}-23.77002{col 79}{space 3} 362.9618
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2}-20.10455{col 38}{space 2} 13.76457{col 49}{space 1}   -1.46{col 58}{space 3}0.144{col 66}{space 4}-47.08262{col 79}{space 3} 6.873507
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2} 12.38033{col 38}{space 2} 64.55688{col 49}{space 1}    0.19{col 58}{space 3}0.848{col 66}{space 4}-114.1488{col 79}{space 3} 138.9095
{txt}{space 19}2015  {c |}{col 26}{res}{space 2} 217.0654{col 38}{space 2} 69.91401{col 49}{space 1}    3.10{col 58}{space 3}0.002{col 66}{space 4} 80.03645{col 79}{space 3} 354.0943
{txt}{space 19}2018  {c |}{col 26}{res}{space 2}-50.43774{col 38}{space 2} 64.26783{col 49}{space 1}   -0.78{col 58}{space 3}0.433{col 66}{space 4}-176.4004{col 79}{space 3} 75.52489
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} 648.5588{col 38}{space 2} 316.6244{col 49}{space 1}    2.05{col 58}{space 3}0.041{col 66}{space 4} 27.98633{col 79}{space 3} 1269.131
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}commercial_dummy         {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2}-.0095462{col 38}{space 2} .0010141{col 49}{space 1}   -9.41{col 58}{space 3}0.000{col 66}{space 4}-.0115338{col 79}{space 3}-.0075585
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2}-.0054338{col 38}{space 2} .0006677{col 49}{space 1}   -8.14{col 58}{space 3}0.000{col 66}{space 4}-.0067425{col 79}{space 3}-.0041252
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2}-.0002683{col 38}{space 2}  .000239{col 49}{space 1}   -1.12{col 58}{space 3}0.262{col 66}{space 4}-.0007367{col 79}{space 3} .0002001
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2} .0002368{col 38}{space 2} .0000702{col 49}{space 1}    3.37{col 58}{space 3}0.001{col 66}{space 4} .0000992{col 79}{space 3} .0003745
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2} .0334944{col 38}{space 2} .0167537{col 49}{space 1}    2.00{col 58}{space 3}0.046{col 66}{space 4} .0006578{col 79}{space 3}  .066331
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-1.54e-06{col 38}{space 2} .0001204{col 49}{space 1}   -0.01{col 58}{space 3}0.990{col 66}{space 4}-.0002374{col 79}{space 3} .0002343
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2} .4097053{col 38}{space 2} .0767516{col 49}{space 1}    5.34{col 58}{space 3}0.000{col 66}{space 4} .2592749{col 79}{space 3} .5601358
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}-.0149842{col 38}{space 2} .0026918{col 49}{space 1}   -5.57{col 58}{space 3}0.000{col 66}{space 4}  -.02026{col 79}{space 3}-.0097083
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} .0296757{col 38}{space 2} .0882814{col 49}{space 1}    0.34{col 58}{space 3}0.737{col 66}{space 4}-.1433526{col 79}{space 3} .2027041
{txt}{space 17}femhead {c |}{col 26}{res}{space 2}-.2123379{col 38}{space 2} .0836533{col 49}{space 1}   -2.54{col 58}{space 3}0.011{col 66}{space 4}-.3762953{col 79}{space 3}-.0483804
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2} .0399223{col 38}{space 2} .0079571{col 49}{space 1}    5.02{col 58}{space 3}0.000{col 66}{space 4} .0243266{col 79}{space 3}  .055518
{txt}{space 15}good_soil {c |}{col 26}{res}{space 2} .1856225{col 38}{space 2} .0899945{col 49}{space 1}    2.06{col 58}{space 3}0.039{col 66}{space 4} .0092366{col 79}{space 3} .3620084
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2}   .01167{col 38}{space 2} .0804425{col 49}{space 1}    0.15{col 58}{space 3}0.885{col 66}{space 4}-.1459944{col 79}{space 3} .1693343
{txt}{space 19}2015  {c |}{col 26}{res}{space 2}-.0583315{col 38}{space 2} .0830648{col 49}{space 1}   -0.70{col 58}{space 3}0.483{col 66}{space 4}-.2211355{col 79}{space 3} .1044725
{txt}{space 19}2018  {c |}{col 26}{res}{space 2} -.001766{col 38}{space 2} .0807293{col 49}{space 1}   -0.02{col 58}{space 3}0.983{col 66}{space 4}-.1599926{col 79}{space 3} .1564605
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} .0470748{col 38}{space 2}  .218905{col 49}{space 1}    0.22{col 58}{space 3}0.830{col 66}{space 4}-.3819712{col 79}{space 3} .4761208
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/mills                   {txt}{c |}
{space 18}lambda {c |}{col 26}{res}{space 2}-758.8742{col 38}{space 2} 444.7573{col 49}{space 1}   -1.71{col 58}{space 3}0.088{col 66}{space 4}-1630.582{col 79}{space 3} 112.8341
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                     rho {c |} {res}  -1.00000
                   {txt}sigma {c |} {res} 758.87418
{txt}{hline 25}{c BT}{hline 64}

{com}. predict yhat, xb
{txt}
{com}. predict imr, mills
{txt}
{com}. 
. sum yhat, detail

                      {txt}Linear prediction
{hline 61}
      Percentiles      Smallest
 1%    {res} 539.4702       252.9596
{txt} 5%    {res} 740.2001        305.762
{txt}10%    {res}  827.842       363.5665       {txt}Obs         {res}      2,960
{txt}25%    {res} 1009.174       363.9367       {txt}Sum of wgt. {res}      2,960

{txt}50%    {res} 1210.696                      {txt}Mean          {res} 1306.029
                        {txt}Largest       Std. dev.     {res} 558.5625
{txt}75%    {res} 1439.146        5220.62
{txt}90%    {res} 1718.595       5256.932       {txt}Variance      {res}   311992
{txt}95%    {res} 2166.445       5275.127       {txt}Skewness      {res} 3.160676
{txt}99%    {res} 3761.567       5324.883       {txt}Kurtosis      {res}  17.8883
{txt}
{com}. 
. ************winzonrizing fertilizer market price
. foreach v of varlist  yhat  {c -(}
{txt}  2{com}.         _pctile `v' [aw=weight] , p(1 95) 
{txt}  3{com}.         gen `v'_w=`v'
{txt}  4{com}.         *replace  `v'_w = r(r1) if  `v'_w < r(r1) &  `v'_w!=.
.         replace  `v'_w = r(r2) if  `v'_w > r(r2) &  `v'_w!=.
{txt}  5{com}.         local l`v' : var lab `v'
{txt}  6{com}.         lab var  `v'_w  "`l`v'' - Winzorized top & bottom 5%"
{txt}  7{com}. {c )-}
{txt}(135 real changes made)

{com}. 
. 
. local time_avg "yhat_w"
{txt}
{com}. foreach x in `time_avg' {c -(}
{txt}  2{com}.         bysort hhid : egen TAvg_`x' = mean(`x')
{txt}  3{com}. {c )-}
{txt}
{com}. ** CRE-TOBIT 
. tobit total_qty_w yhat_w subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem  annual_mean_temp annual_precipitation  TAvg_total_qty_w TAvg_yhat_w TAvg_subsidy_qty_w TAvg_dist_market_w  TAvg_real_maize_price_mr TAvg_real_rice_price_mr TAvg_land_holding TAvg_real_hhvalue TAvg_org_fert TAvg_hh_headage TAvg_attend_sch TAvg_femhead TAvg_num_mem TAvg_annual_mean_temp TAvg_annual_precipitation imr i.year, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 2}Log likelihood = {res:-7510.8362}

Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-7510.8362}  
Iteration 1:{space 2}Log likelihood = {res:-6315.7136}  
Iteration 2:{space 2}Log likelihood = {res: -5891.927}  
Iteration 3:{space 2}Log likelihood = {res: -5872.577}  
Iteration 4:{space 2}Log likelihood = {res:-5871.6512}  
Iteration 5:{space 2}Log likelihood = {res:-5871.6508}  
{res}
{txt}{col 1}Tobit regression{col 52}{lalign 17:Number of obs}{col 69} = {res}{ralign 7:2,960}
{txt}{col 52}{ralign 17:Uncensored}{col 69} = {res}{ralign 7:777}
{txt}{col 1}Limits: Lower = {ralign 4:{res:0}}{col 52}{ralign 17:Left-censored}{col 69} = {res}{ralign 7:2,183}
{txt}{col 1}        Upper = {ralign 4:{txt:+inf}}{col 52}{ralign 17:   Right-censored}{col 69} = {res}{ralign 7:0}

{txt}{col 52}{lalign 17:LR chi2({res:33})}{col 69} = {res}{ralign 7:1240.78}
{txt}{col 52}{lalign 17:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-5871.6508}{txt}{col 52}{lalign 17:Pseudo R2}{col 69} = {res}{ralign 7:0.0956}

{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}              total_qty_w{col 27}{c |} Coefficient{col 39}  Std. err.{col 51}      t{col 59}   P>|t|{col 67}     [95% con{col 80}f. interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 19}yhat_w {c |}{col 27}{res}{space 2}-.3977326{col 39}{space 2} .1178573{col 50}{space 1}   -3.37{col 59}{space 3}0.001{col 67}{space 4}-.6288243{col 80}{space 3} -.166641
{txt}{space 12}subsidy_qty_w {c |}{col 27}{res}{space 2}-.1574938{col 39}{space 2}  1.15236{col 50}{space 1}   -0.14{col 59}{space 3}0.891{col 67}{space 4}-2.417011{col 80}{space 3} 2.102024
{txt}{space 12}dist_market_w {c |}{col 27}{res}{space 2} 1.101803{col 39}{space 2} .6160955{col 50}{space 1}    1.79{col 59}{space 3}0.074{col 67}{space 4}-.1062218{col 80}{space 3} 2.309827
{txt}{space 6}real_maize_price_mr {c |}{col 27}{res}{space 2} .0249914{col 39}{space 2} .0680374{col 50}{space 1}    0.37{col 59}{space 3}0.713{col 67}{space 4}-.1084147{col 80}{space 3} .1583974
{txt}{space 7}real_rice_price_mr {c |}{col 27}{res}{space 2}-.0821629{col 39}{space 2} .0428751{col 50}{space 1}   -1.92{col 59}{space 3}0.055{col 67}{space 4}-.1662313{col 80}{space 3} .0019055
{txt}{space 13}land_holding {c |}{col 27}{res}{space 2} 3.150937{col 39}{space 2} 6.026959{col 50}{space 1}    0.52{col 59}{space 3}0.601{col 67}{space 4}-8.666572{col 80}{space 3} 14.96845
{txt}{space 13}real_hhvalue {c |}{col 27}{res}{space 2}-.1070812{col 39}{space 2} .0358301{col 50}{space 1}   -2.99{col 59}{space 3}0.003{col 67}{space 4}-.1773359{col 80}{space 3}-.0368265
{txt}{space 17}org_fert {c |}{col 27}{res}{space 2} -75.6802{col 39}{space 2}  45.4263{col 50}{space 1}   -1.67{col 59}{space 3}0.096{col 67}{space 4}-164.7509{col 80}{space 3} 13.39055
{txt}{space 15}hh_headage {c |}{col 27}{res}{space 2} .9561492{col 39}{space 2} 2.196049{col 50}{space 1}    0.44{col 59}{space 3}0.663{col 67}{space 4}-3.349807{col 80}{space 3} 5.262106
{txt}{space 15}attend_sch {c |}{col 27}{res}{space 2} 29.77752{col 39}{space 2} 22.84178{col 50}{space 1}    1.30{col 59}{space 3}0.192{col 67}{space 4}-15.01008{col 80}{space 3} 74.56511
{txt}{space 18}femhead {c |}{col 27}{res}{space 2}-5.234102{col 39}{space 2} 46.68245{col 50}{space 1}   -0.11{col 59}{space 3}0.911{col 67}{space 4}-96.76787{col 80}{space 3} 86.29966
{txt}{space 18}num_mem {c |}{col 27}{res}{space 2}-.7938365{col 39}{space 2} 5.836313{col 50}{space 1}   -0.14{col 59}{space 3}0.892{col 67}{space 4}-12.23753{col 80}{space 3} 10.64986
{txt}{space 9}annual_mean_temp {c |}{col 27}{res}{space 2} 3.455318{col 39}{space 2} 5.231232{col 50}{space 1}    0.66{col 59}{space 3}0.509{col 67}{space 4}-6.801949{col 80}{space 3} 13.71259
{txt}{space 5}annual_precipitation {c |}{col 27}{res}{space 2}-.1188127{col 39}{space 2} .5006683{col 50}{space 1}   -0.24{col 59}{space 3}0.812{col 67}{space 4} -1.10051{col 80}{space 3}  .862885
{txt}{space 9}TAvg_total_qty_w {c |}{col 27}{res}{space 2} 1.966266{col 39}{space 2}  .075988{col 50}{space 1}   25.88{col 59}{space 3}0.000{col 67}{space 4} 1.817271{col 80}{space 3} 2.115261
{txt}{space 14}TAvg_yhat_w {c |}{col 27}{res}{space 2} .2983161{col 39}{space 2} .0781311{col 50}{space 1}    3.82{col 59}{space 3}0.000{col 67}{space 4} .1451186{col 80}{space 3} .4515135
{txt}{space 7}TAvg_subsidy_qty_w {c |}{col 27}{res}{space 2}-.1788772{col 39}{space 2} .2546464{col 50}{space 1}   -0.70{col 59}{space 3}0.482{col 67}{space 4}-.6781814{col 80}{space 3} .3204269
{txt}{space 7}TAvg_dist_market_w {c |}{col 27}{res}{space 2}-1.461585{col 39}{space 2} .3117587{col 50}{space 1}   -4.69{col 59}{space 3}0.000{col 67}{space 4}-2.072874{col 80}{space 3}-.8502963
{txt}{space 1}TAvg_real_maize_price_mr {c |}{col 27}{res}{space 2}-.0791774{col 39}{space 2} .1139495{col 50}{space 1}   -0.69{col 59}{space 3}0.487{col 67}{space 4}-.3026068{col 80}{space 3} .1442519
{txt}{space 2}TAvg_real_rice_price_mr {c |}{col 27}{res}{space 2} .0151511{col 39}{space 2} .0392573{col 50}{space 1}    0.39{col 59}{space 3}0.700{col 67}{space 4}-.0618236{col 80}{space 3} .0921259
{txt}{space 8}TAvg_land_holding {c |}{col 27}{res}{space 2}-11.96316{col 39}{space 2} 6.783802{col 50}{space 1}   -1.76{col 59}{space 3}0.078{col 67}{space 4}-25.26467{col 80}{space 3} 1.338346
{txt}{space 8}TAvg_real_hhvalue {c |}{col 27}{res}{space 2} .1172339{col 39}{space 2} .0455176{col 50}{space 1}    2.58{col 59}{space 3}0.010{col 67}{space 4} .0279842{col 80}{space 3} .2064836
{txt}{space 12}TAvg_org_fert {c |}{col 27}{res}{space 2} 80.01549{col 39}{space 2} 36.19115{col 50}{space 1}    2.21{col 59}{space 3}0.027{col 67}{space 4}  9.05279{col 80}{space 3} 150.9782
{txt}{space 10}TAvg_hh_headage {c |}{col 27}{res}{space 2}-.9286865{col 39}{space 2} 1.438595{col 50}{space 1}   -0.65{col 59}{space 3}0.519{col 67}{space 4}-3.749447{col 80}{space 3} 1.892074
{txt}{space 10}TAvg_attend_sch {c |}{col 27}{res}{space 2}-28.07794{col 39}{space 2} 32.75247{col 50}{space 1}   -0.86{col 59}{space 3}0.391{col 67}{space 4}-92.29816{col 80}{space 3} 36.14228
{txt}{space 13}TAvg_femhead {c |}{col 27}{res}{space 2} 28.62009{col 39}{space 2} 41.86676{col 50}{space 1}    0.68{col 59}{space 3}0.494{col 67}{space 4} -53.4712{col 80}{space 3} 110.7114
{txt}{space 13}TAvg_num_mem {c |}{col 27}{res}{space 2}-.5003376{col 39}{space 2} 4.631138{col 50}{space 1}   -0.11{col 59}{space 3}0.914{col 67}{space 4}-9.580956{col 80}{space 3} 8.580281
{txt}{space 4}TAvg_annual_mean_temp {c |}{col 27}{res}{space 2}-2.360694{col 39}{space 2} 5.254948{col 50}{space 1}   -0.45{col 59}{space 3}0.653{col 67}{space 4}-12.66446{col 80}{space 3} 7.943075
{txt}TAvg_annual_precipitation {c |}{col 27}{res}{space 2} .0906551{col 39}{space 2}  .500961{col 50}{space 1}    0.18{col 59}{space 3}0.856{col 67}{space 4}-.8916166{col 80}{space 3} 1.072927
{txt}{space 22}imr {c |}{col 27}{res}{space 2}-27.96218{col 39}{space 2} 110.6635{col 50}{space 1}   -0.25{col 59}{space 3}0.801{col 67}{space 4}-244.9483{col 80}{space 3}  189.024
{txt}{space 25} {c |}
{space 21}year {c |}
{space 20}2012  {c |}{col 27}{res}{space 2} 52.65698{col 39}{space 2}  15.9362{col 50}{space 1}    3.30{col 59}{space 3}0.001{col 67}{space 4} 21.40968{col 80}{space 3} 83.90428
{txt}{space 20}2015  {c |}{col 27}{res}{space 2} 90.55492{col 39}{space 2} 33.18384{col 50}{space 1}    2.73{col 59}{space 3}0.006{col 67}{space 4} 25.48888{col 80}{space 3}  155.621
{txt}{space 20}2018  {c |}{col 27}{res}{space 2} 20.34243{col 39}{space 2} 19.78286{col 50}{space 1}    1.03{col 59}{space 3}0.304{col 67}{space 4} -18.4473{col 80}{space 3} 59.13216
{txt}{space 25} {c |}
{space 20}_cons {c |}{col 27}{res}{space 2}-280.5484{col 39}{space 2} 237.3978{col 50}{space 1}   -1.18{col 59}{space 3}0.237{col 67}{space 4}-746.0321{col 80}{space 3} 184.9352
{txt}{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}var(e.total_qty_w){c |}{col 27}{res}{space 2} 36977.02{col 39}{space 2}   2045.6{col 67}{space 4} 33175.94{col 80}{space 3} 41213.61
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. margins, predict(ystar(0,.)) dydx(*) post
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,960}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:E(total_qty_w*|total_qty_w>0), predict(ystar(0,.))}{p_end}
{p2col:dy/dx wrt:}{res:yhat_w subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem annual_mean_temp annual_precipitation TAvg_total_qty_w TAvg_yhat_w TAvg_subsidy_qty_w TAvg_dist_market_w TAvg_real_maize_price_mr TAvg_real_rice_price_mr TAvg_land_holding TAvg_real_hhvalue TAvg_org_fert TAvg_hh_headage TAvg_attend_sch TAvg_femhead TAvg_num_mem TAvg_annual_mean_temp TAvg_annual_precipitation imr 2012.year 2015.year 2018.year}{p_end}
{p2colreset}{...}

{res}{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39} Delta-method
{col 27}{c |}      dy/dx{col 39}   std. err.{col 51}      z{col 59}   P>|z|{col 67}     [95% con{col 80}f. interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 19}yhat_w {c |}{col 27}{res}{space 2}-.1004768{col 39}{space 2} .0297882{col 50}{space 1}   -3.37{col 59}{space 3}0.001{col 67}{space 4}-.1588607{col 80}{space 3} -.042093
{txt}{space 12}subsidy_qty_w {c |}{col 27}{res}{space 2}-.0397867{col 39}{space 2} .2911125{col 50}{space 1}   -0.14{col 59}{space 3}0.891{col 67}{space 4}-.6103566{col 80}{space 3} .5307832
{txt}{space 12}dist_market_w {c |}{col 27}{res}{space 2} .2783419{col 39}{space 2} .1556842{col 50}{space 1}    1.79{col 59}{space 3}0.074{col 67}{space 4}-.0267936{col 80}{space 3} .5834774
{txt}{space 6}real_maize_price_mr {c |}{col 27}{res}{space 2} .0063134{col 39}{space 2}  .017187{col 50}{space 1}    0.37{col 59}{space 3}0.713{col 67}{space 4}-.0273726{col 80}{space 3} .0399994
{txt}{space 7}real_rice_price_mr {c |}{col 27}{res}{space 2}-.0207563{col 39}{space 2} .0108342{col 50}{space 1}   -1.92{col 59}{space 3}0.055{col 67}{space 4}-.0419909{col 80}{space 3} .0004783
{txt}{space 13}land_holding {c |}{col 27}{res}{space 2} .7960025{col 39}{space 2} 1.522985{col 50}{space 1}    0.52{col 59}{space 3}0.601{col 67}{space 4}-2.188994{col 80}{space 3} 3.780999
{txt}{space 13}real_hhvalue {c |}{col 27}{res}{space 2}-.0270513{col 39}{space 2}  .009073{col 50}{space 1}   -2.98{col 59}{space 3}0.003{col 67}{space 4} -.044834{col 80}{space 3}-.0092686
{txt}{space 17}org_fert {c |}{col 27}{res}{space 2}-19.11864{col 39}{space 2} 11.47872{col 50}{space 1}   -1.67{col 59}{space 3}0.096{col 67}{space 4}-41.61652{col 80}{space 3} 3.379246
{txt}{space 15}hh_headage {c |}{col 27}{res}{space 2} .2415463{col 39}{space 2} .5547459{col 50}{space 1}    0.44{col 59}{space 3}0.663{col 67}{space 4}-.8457357{col 80}{space 3} 1.328828
{txt}{space 15}attend_sch {c |}{col 27}{res}{space 2} 7.522517{col 39}{space 2} 5.768637{col 50}{space 1}    1.30{col 59}{space 3}0.192{col 67}{space 4}-3.783804{col 80}{space 3} 18.82884
{txt}{space 18}femhead {c |}{col 27}{res}{space 2} -1.32226{col 39}{space 2} 11.79344{col 50}{space 1}   -0.11{col 59}{space 3}0.911{col 67}{space 4}-24.43698{col 80}{space 3} 21.79246
{txt}{space 18}num_mem {c |}{col 27}{res}{space 2}-.2005422{col 39}{space 2} 1.474332{col 50}{space 1}   -0.14{col 59}{space 3}0.892{col 67}{space 4} -3.09018{col 80}{space 3} 2.689096
{txt}{space 9}annual_mean_temp {c |}{col 27}{res}{space 2} .8728964{col 39}{space 2} 1.321798{col 50}{space 1}    0.66{col 59}{space 3}0.509{col 67}{space 4}-1.717781{col 80}{space 3} 3.463573
{txt}{space 5}annual_precipitation {c |}{col 27}{res}{space 2} -.030015{col 39}{space 2} .1264909{col 50}{space 1}   -0.24{col 59}{space 3}0.812{col 67}{space 4}-.2779326{col 80}{space 3} .2179027
{txt}{space 9}TAvg_total_qty_w {c |}{col 27}{res}{space 2} .4967261{col 39}{space 2} .0197379{col 50}{space 1}   25.17{col 59}{space 3}0.000{col 67}{space 4} .4580405{col 80}{space 3} .5354116
{txt}{space 14}TAvg_yhat_w {c |}{col 27}{res}{space 2} .0753618{col 39}{space 2} .0197517{col 50}{space 1}    3.82{col 59}{space 3}0.000{col 67}{space 4} .0366492{col 80}{space 3} .1140744
{txt}{space 7}TAvg_subsidy_qty_w {c |}{col 27}{res}{space 2}-.0451887{col 39}{space 2} .0643217{col 50}{space 1}   -0.70{col 59}{space 3}0.482{col 67}{space 4}-.1712568{col 80}{space 3} .0808794
{txt}{space 7}TAvg_dist_market_w {c |}{col 27}{res}{space 2}-.3692315{col 39}{space 2} .0787643{col 50}{space 1}   -4.69{col 59}{space 3}0.000{col 67}{space 4}-.5236067{col 80}{space 3}-.2148563
{txt}{space 1}TAvg_real_maize_price_mr {c |}{col 27}{res}{space 2}-.0200021{col 39}{space 2} .0287843{col 50}{space 1}   -0.69{col 59}{space 3}0.487{col 67}{space 4}-.0764184{col 80}{space 3} .0364141
{txt}{space 2}TAvg_real_rice_price_mr {c |}{col 27}{res}{space 2} .0038275{col 39}{space 2} .0099172{col 50}{space 1}    0.39{col 59}{space 3}0.700{col 67}{space 4}-.0156099{col 80}{space 3}  .023265
{txt}{space 8}TAvg_land_holding {c |}{col 27}{res}{space 2}-3.022182{col 39}{space 2} 1.715265{col 50}{space 1}   -1.76{col 59}{space 3}0.078{col 67}{space 4} -6.38404{col 80}{space 3}  .339676
{txt}{space 8}TAvg_real_hhvalue {c |}{col 27}{res}{space 2} .0296161{col 39}{space 2} .0115178{col 50}{space 1}    2.57{col 59}{space 3}0.010{col 67}{space 4} .0070416{col 80}{space 3} .0521906
{txt}{space 12}TAvg_org_fert {c |}{col 27}{res}{space 2} 20.21384{col 39}{space 2} 9.141917{col 50}{space 1}    2.21{col 59}{space 3}0.027{col 67}{space 4} 2.296008{col 80}{space 3} 38.13166
{txt}{space 10}TAvg_hh_headage {c |}{col 27}{res}{space 2}-.2346085{col 39}{space 2} .3633905{col 50}{space 1}   -0.65{col 59}{space 3}0.519{col 67}{space 4}-.9468408{col 80}{space 3} .4776237
{txt}{space 10}TAvg_attend_sch {c |}{col 27}{res}{space 2}-7.093163{col 39}{space 2} 8.272345{col 50}{space 1}   -0.86{col 59}{space 3}0.391{col 67}{space 4}-23.30666{col 80}{space 3} 9.120335
{txt}{space 13}TAvg_femhead {c |}{col 27}{res}{space 2} 7.230122{col 39}{space 2}  10.5776{col 50}{space 1}    0.68{col 59}{space 3}0.494{col 67}{space 4}-13.50158{col 80}{space 3} 27.96183
{txt}{space 13}TAvg_num_mem {c |}{col 27}{res}{space 2}-.1263973{col 39}{space 2} 1.170004{col 50}{space 1}   -0.11{col 59}{space 3}0.914{col 67}{space 4}-2.419563{col 80}{space 3} 2.166768
{txt}{space 4}TAvg_annual_mean_temp {c |}{col 27}{res}{space 2} -.596368{col 39}{space 2} 1.327716{col 50}{space 1}   -0.45{col 59}{space 3}0.653{col 67}{space 4}-3.198644{col 80}{space 3} 2.005908
{txt}TAvg_annual_precipitation {c |}{col 27}{res}{space 2} .0229017{col 39}{space 2} .1265622{col 50}{space 1}    0.18{col 59}{space 3}0.856{col 67}{space 4}-.2251556{col 80}{space 3}  .270959
{txt}{space 22}imr {c |}{col 27}{res}{space 2}-7.063918{col 39}{space 2} 27.95708{col 50}{space 1}   -0.25{col 59}{space 3}0.801{col 67}{space 4}-61.85879{col 80}{space 3} 47.73095
{txt}{space 25} {c |}
{space 21}year {c |}
{space 20}2012  {c |}{col 27}{res}{space 2} 12.61279{col 39}{space 2} 3.832521{col 50}{space 1}    3.29{col 59}{space 3}0.001{col 67}{space 4}  5.10119{col 80}{space 3}  20.1244
{txt}{space 20}2015  {c |}{col 27}{res}{space 2} 23.77569{col 39}{space 2} 9.736236{col 50}{space 1}    2.44{col 59}{space 3}0.015{col 67}{space 4} 4.693017{col 80}{space 3} 42.85836
{txt}{space 20}2018  {c |}{col 27}{res}{space 2} 4.500499{col 39}{space 2} 4.419658{col 50}{space 1}    1.02{col 59}{space 3}0.309{col 67}{space 4}-4.161872{col 80}{space 3} 13.16287
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 91}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. restore
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD798_000000.tmp"
{txt}
{com}.  preserve 
{txt}
{com}. heckman real_tpricefert_cens_mrk subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem  i.year, select (commercial_dummy= subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr lland_holding lreal_hhvalue org_fert hh_headage attend_sch femhead num_mem good_soil  i.year) twostep
{res}
{txt}Heckman selection model -- two-step estimates   Number of obs     = {res}     2,960
{txt}(regression model with sample selection)              Selected    = {res}       777
                                                {txt}      Nonselected = {res}     2,183

                                                {txt}Wald chi2({res}14{txt})     =  {res}    63.33
                                                {txt}Prob > chi2       =     {res}0.0000

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      z{col 58}   P>|z|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}real_tpricefert_cens_mrk {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2} .2894883{col 38}{space 2} 1.651821{col 49}{space 1}    0.18{col 58}{space 3}0.861{col 66}{space 4}-2.948022{col 79}{space 3} 3.526998
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2}-.0162765{col 38}{space 2} .8339543{col 49}{space 1}   -0.02{col 58}{space 3}0.984{col 66}{space 4}-1.650797{col 79}{space 3} 1.618244
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2} .1535895{col 38}{space 2} .1324269{col 49}{space 1}    1.16{col 58}{space 3}0.246{col 66}{space 4}-.1059623{col 79}{space 3} .4131414
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2}-.1361991{col 38}{space 2}  .044176{col 49}{space 1}   -3.08{col 58}{space 3}0.002{col 66}{space 4}-.2227825{col 79}{space 3}-.0496158
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2}-7.034574{col 38}{space 2} 9.480347{col 49}{space 1}   -0.74{col 58}{space 3}0.458{col 66}{space 4}-25.61571{col 79}{space 3} 11.54656
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0418562{col 38}{space 2} .0609581{col 49}{space 1}   -0.69{col 58}{space 3}0.492{col 66}{space 4} -.161332{col 79}{space 3} .0776195
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2} 1.932073{col 38}{space 2} 64.08936{col 49}{space 1}    0.03{col 58}{space 3}0.976{col 66}{space 4}-123.6808{col 79}{space 3} 127.5449
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2} 1.501283{col 38}{space 2} 2.536721{col 49}{space 1}    0.59{col 58}{space 3}0.554{col 66}{space 4}-3.470598{col 79}{space 3} 6.473164
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} 63.28048{col 38}{space 2} 42.27903{col 49}{space 1}    1.50{col 58}{space 3}0.134{col 66}{space 4}-19.58489{col 79}{space 3} 146.1459
{txt}{space 17}femhead {c |}{col 26}{res}{space 2} 61.23385{col 38}{space 2}  52.8892{col 49}{space 1}    1.16{col 58}{space 3}0.247{col 66}{space 4}-42.42708{col 79}{space 3} 164.8948
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2}-1.359129{col 38}{space 2} 6.206063{col 49}{space 1}   -0.22{col 58}{space 3}0.827{col 66}{space 4}-13.52279{col 79}{space 3} 10.80453
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2} 21.44727{col 38}{space 2} 39.94281{col 49}{space 1}    0.54{col 58}{space 3}0.591{col 66}{space 4}-56.83919{col 79}{space 3} 99.73373
{txt}{space 19}2015  {c |}{col 26}{res}{space 2} 176.2028{col 38}{space 2} 42.34961{col 49}{space 1}    4.16{col 58}{space 3}0.000{col 66}{space 4} 93.19909{col 79}{space 3} 259.2065
{txt}{space 19}2018  {c |}{col 26}{res}{space 2}-60.88399{col 38}{space 2}  39.9195{col 49}{space 1}   -1.53{col 58}{space 3}0.127{col 66}{space 4}-139.1248{col 79}{space 3} 17.35679
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} 229.3415{col 38}{space 2} 147.6059{col 49}{space 1}    1.55{col 58}{space 3}0.120{col 66}{space 4}-59.96075{col 79}{space 3} 518.6438
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}commercial_dummy         {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2}-.0097012{col 38}{space 2} .0010168{col 49}{space 1}   -9.54{col 58}{space 3}0.000{col 66}{space 4}-.0116941{col 79}{space 3}-.0077083
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2}-.0058366{col 38}{space 2} .0006794{col 49}{space 1}   -8.59{col 58}{space 3}0.000{col 66}{space 4}-.0071682{col 79}{space 3} -.004505
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2}-.0002623{col 38}{space 2} .0002396{col 49}{space 1}   -1.09{col 58}{space 3}0.274{col 66}{space 4}-.0007319{col 79}{space 3} .0002072
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2} .0002197{col 38}{space 2} .0000706{col 49}{space 1}    3.11{col 58}{space 3}0.002{col 66}{space 4} .0000813{col 79}{space 3}  .000358
{txt}{space 11}lland_holding {c |}{col 26}{res}{space 2} .0761754{col 38}{space 2} .0200035{col 49}{space 1}    3.81{col 58}{space 3}0.000{col 66}{space 4} .0369693{col 79}{space 3} .1153815
{txt}{space 11}lreal_hhvalue {c |}{col 26}{res}{space 2}  .042931{col 38}{space 2} .0223465{col 49}{space 1}    1.92{col 58}{space 3}0.055{col 66}{space 4}-.0008674{col 79}{space 3} .0867293
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2} .4061004{col 38}{space 2}  .076754{col 49}{space 1}    5.29{col 58}{space 3}0.000{col 66}{space 4} .2556653{col 79}{space 3} .5565355
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}-.0140397{col 38}{space 2} .0027068{col 49}{space 1}   -5.19{col 58}{space 3}0.000{col 66}{space 4}-.0193449{col 79}{space 3}-.0087345
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} .0152931{col 38}{space 2} .0890329{col 49}{space 1}    0.17{col 58}{space 3}0.864{col 66}{space 4}-.1592081{col 79}{space 3} .1897944
{txt}{space 17}femhead {c |}{col 26}{res}{space 2}-.1609752{col 38}{space 2} .0849015{col 49}{space 1}   -1.90{col 58}{space 3}0.058{col 66}{space 4}-.3273791{col 79}{space 3} .0054286
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2} .0361429{col 38}{space 2} .0079346{col 49}{space 1}    4.56{col 58}{space 3}0.000{col 66}{space 4} .0205914{col 79}{space 3} .0516944
{txt}{space 15}good_soil {c |}{col 26}{res}{space 2} .1904471{col 38}{space 2} .0904581{col 49}{space 1}    2.11{col 58}{space 3}0.035{col 66}{space 4} .0131526{col 79}{space 3} .3677417
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2}-.0217705{col 38}{space 2} .0808904{col 49}{space 1}   -0.27{col 58}{space 3}0.788{col 66}{space 4}-.1803127{col 79}{space 3} .1367717
{txt}{space 19}2015  {c |}{col 26}{res}{space 2}-.0866792{col 38}{space 2} .0829902{col 49}{space 1}   -1.04{col 58}{space 3}0.296{col 66}{space 4}-.2493369{col 79}{space 3} .0759785
{txt}{space 19}2018  {c |}{col 26}{res}{space 2}-.0631094{col 38}{space 2} .0823911{col 49}{space 1}   -0.77{col 58}{space 3}0.444{col 66}{space 4}-.2245931{col 79}{space 3} .0983742
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2}-.0034545{col 38}{space 2} .2321936{col 49}{space 1}   -0.01{col 58}{space 3}0.988{col 66}{space 4}-.4585455{col 79}{space 3} .4516365
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/mills                   {txt}{c |}
{space 18}lambda {c |}{col 26}{res}{space 2}-80.23351{col 38}{space 2} 195.3572{col 49}{space 1}   -0.41{col 58}{space 3}0.681{col 66}{space 4}-463.1265{col 79}{space 3} 302.6595
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                     rho {c |} {res}  -0.23356
                   {txt}sigma {c |} {res} 343.53018
{txt}{hline 25}{c BT}{hline 64}

{com}. predict yhat, xb
{txt}
{com}. predict imr, mills
{txt}
{com}. 
. 
. local time_avg "yhat"
{txt}
{com}. foreach x in `time_avg' {c -(}
{txt}  2{com}.         bysort hhid : egen TAvg_`x' = mean(`x')
{txt}  3{com}. {c )-}
{txt}
{com}. ** CRE-TOBIT 
. tobit total_qty_w yhat subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem annual_mean_temp annual_precipitation  TAvg_total_qty_w TAvg_yhat TAvg_subsidy_qty_w TAvg_dist_market_w  TAvg_real_maize_price_mr TAvg_real_rice_price_mr TAvg_land_holding TAvg_real_hhvalue TAvg_org_fert TAvg_hh_headage TAvg_attend_sch TAvg_femhead TAvg_num_mem  TAvg_annual_mean_temp TAvg_annual_precipitation imr i.year, ll(0)
{res}{txt}note: {bf:TAvg_num_mem} omitted because of collinearity.
note: {bf:2018.year} omitted because of collinearity.

Refining starting values:

Grid node 0:{space 2}Log likelihood = {res:-7530.8962}

Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-7530.8962}  
Iteration 1:{space 2}Log likelihood = {res:-6335.8623}  
Iteration 2:{space 2}Log likelihood = {res: -5893.349}  
Iteration 3:{space 2}Log likelihood = {res:-5871.7755}  
Iteration 4:{space 2}Log likelihood = {res:-5871.0929}  
Iteration 5:{space 2}Log likelihood = {res:-5871.0926}  
{res}
{txt}{col 1}Tobit regression{col 52}{lalign 17:Number of obs}{col 69} = {res}{ralign 7:2,960}
{txt}{col 52}{ralign 17:Uncensored}{col 69} = {res}{ralign 7:777}
{txt}{col 1}Limits: Lower = {ralign 4:{res:0}}{col 52}{ralign 17:Left-censored}{col 69} = {res}{ralign 7:2,183}
{txt}{col 1}        Upper = {ralign 4:{txt:+inf}}{col 52}{ralign 17:   Right-censored}{col 69} = {res}{ralign 7:0}

{txt}{col 52}{lalign 17:LR chi2({res:31})}{col 69} = {res}{ralign 7:1241.90}
{txt}{col 52}{lalign 17:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-5871.0926}{txt}{col 52}{lalign 17:Pseudo R2}{col 69} = {res}{ralign 7:0.0956}

{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}              total_qty_w{col 27}{c |} Coefficient{col 39}  Std. err.{col 51}      t{col 59}   P>|t|{col 67}     [95% con{col 80}f. interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 21}yhat {c |}{col 27}{res}{space 2}-.8113818{col 39}{space 2} .3078644{col 50}{space 1}   -2.64{col 59}{space 3}0.008{col 67}{space 4}-1.415034{col 80}{space 3}-.2077291
{txt}{space 12}subsidy_qty_w {c |}{col 27}{res}{space 2} .2829048{col 39}{space 2} .5550374{col 50}{space 1}    0.51{col 59}{space 3}0.610{col 67}{space 4}-.8053982{col 80}{space 3} 1.371208
{txt}{space 12}dist_market_w {c |}{col 27}{res}{space 2} 1.177605{col 39}{space 2}  .322252{col 50}{space 1}    3.65{col 59}{space 3}0.000{col 67}{space 4} .5457419{col 80}{space 3} 1.809469
{txt}{space 6}real_maize_price_mr {c |}{col 27}{res}{space 2} .0951251{col 39}{space 2} .0696216{col 50}{space 1}    1.37{col 59}{space 3}0.172{col 67}{space 4}-.0413872{col 80}{space 3} .2316374
{txt}{space 7}real_rice_price_mr {c |}{col 27}{res}{space 2}-.1445007{col 39}{space 2} .0482966{col 50}{space 1}   -2.99{col 59}{space 3}0.003{col 67}{space 4}-.2391995{col 80}{space 3} -.049802
{txt}{space 13}land_holding {c |}{col 27}{res}{space 2}-.3026306{col 39}{space 2} 5.307129{col 50}{space 1}   -0.06{col 59}{space 3}0.955{col 67}{space 4}-10.70871{col 80}{space 3} 10.10345
{txt}{space 13}real_hhvalue {c |}{col 27}{res}{space 2}-.1606236{col 39}{space 2} .0396649{col 50}{space 1}   -4.05{col 59}{space 3}0.000{col 67}{space 4}-.2383976{col 80}{space 3}-.0828496
{txt}{space 17}org_fert {c |}{col 27}{res}{space 2}-83.46929{col 39}{space 2} 26.09423{col 50}{space 1}   -3.20{col 59}{space 3}0.001{col 67}{space 4}-134.6342{col 80}{space 3}-32.30439
{txt}{space 15}hh_headage {c |}{col 27}{res}{space 2} 1.431842{col 39}{space 2} 1.375321{col 50}{space 1}    1.04{col 59}{space 3}0.298{col 67}{space 4}-1.264852{col 80}{space 3} 4.128536
{txt}{space 15}attend_sch {c |}{col 27}{res}{space 2} 61.21845{col 39}{space 2} 29.75366{col 50}{space 1}    2.06{col 59}{space 3}0.040{col 67}{space 4} 2.878243{col 80}{space 3} 119.5587
{txt}{space 18}femhead {c |}{col 27}{res}{space 2} 8.482835{col 39}{space 2} 36.59388{col 50}{space 1}    0.23{col 59}{space 3}0.817{col 67}{space 4} -63.2695{col 80}{space 3} 80.23517
{txt}{space 18}num_mem {c |}{col 27}{res}{space 2}-.2606494{col 39}{space 2} 4.515386{col 50}{space 1}   -0.06{col 59}{space 3}0.954{col 67}{space 4}-9.114302{col 80}{space 3} 8.593004
{txt}{space 9}annual_mean_temp {c |}{col 27}{res}{space 2} 3.565703{col 39}{space 2} 5.181587{col 50}{space 1}    0.69{col 59}{space 3}0.491{col 67}{space 4} -6.59422{col 80}{space 3} 13.72563
{txt}{space 5}annual_precipitation {c |}{col 27}{res}{space 2}-.0537318{col 39}{space 2} .5009344{col 50}{space 1}   -0.11{col 59}{space 3}0.915{col 67}{space 4}-1.035951{col 80}{space 3} .9284875
{txt}{space 9}TAvg_total_qty_w {c |}{col 27}{res}{space 2} 1.931077{col 39}{space 2} .0753175{col 50}{space 1}   25.64{col 59}{space 3}0.000{col 67}{space 4} 1.783396{col 80}{space 3} 2.078757
{txt}{space 16}TAvg_yhat {c |}{col 27}{res}{space 2} 4.965034{col 39}{space 2} 3.229754{col 50}{space 1}    1.54{col 59}{space 3}0.124{col 67}{space 4}-1.367784{col 80}{space 3} 11.29785
{txt}{space 7}TAvg_subsidy_qty_w {c |}{col 27}{res}{space 2}-.7732156{col 39}{space 2} .9376152{col 50}{space 1}   -0.82{col 59}{space 3}0.410{col 67}{space 4}-2.611667{col 80}{space 3} 1.065236
{txt}{space 7}TAvg_dist_market_w {c |}{col 27}{res}{space 2}-.7670594{col 39}{space 2} .2611102{col 50}{space 1}   -2.94{col 59}{space 3}0.003{col 67}{space 4}-1.279038{col 80}{space 3}-.2550813
{txt}{space 1}TAvg_real_maize_price_mr {c |}{col 27}{res}{space 2}-.7784828{col 39}{space 2} .5086791{col 50}{space 1}   -1.53{col 59}{space 3}0.126{col 67}{space 4}-1.775888{col 80}{space 3} .2189222
{txt}{space 2}TAvg_real_rice_price_mr {c |}{col 27}{res}{space 2} .6374633{col 39}{space 2} .4412363{col 50}{space 1}    1.44{col 59}{space 3}0.149{col 67}{space 4}-.2277014{col 80}{space 3} 1.502628
{txt}{space 8}TAvg_land_holding {c |}{col 27}{res}{space 2} 13.94477{col 39}{space 2} 24.17659{col 50}{space 1}    0.58{col 59}{space 3}0.564{col 67}{space 4}-33.46006{col 80}{space 3} 61.34959
{txt}{space 8}TAvg_real_hhvalue {c |}{col 27}{res}{space 2} .3112908{col 39}{space 2}  .146413{col 50}{space 1}    2.13{col 59}{space 3}0.034{col 67}{space 4}  .024208{col 80}{space 3} .5983737
{txt}{space 12}TAvg_org_fert {c |}{col 27}{res}{space 2} 25.53569{col 39}{space 2} 33.40835{col 50}{space 1}    0.76{col 59}{space 3}0.445{col 67}{space 4}-39.97054{col 80}{space 3} 91.04193
{txt}{space 10}TAvg_hh_headage {c |}{col 27}{res}{space 2}-5.727703{col 39}{space 2} 4.998001{col 50}{space 1}   -1.15{col 59}{space 3}0.252{col 67}{space 4}-15.52765{col 80}{space 3} 4.072248
{txt}{space 10}TAvg_attend_sch {c |}{col 27}{res}{space 2}-332.2517{col 39}{space 2} 203.2486{col 50}{space 1}   -1.63{col 59}{space 3}0.102{col 67}{space 4}-730.7763{col 80}{space 3} 66.27279
{txt}{space 13}TAvg_femhead {c |}{col 27}{res}{space 2}-218.0069{col 39}{space 2} 205.7653{col 50}{space 1}   -1.06{col 59}{space 3}0.289{col 67}{space 4}-621.4661{col 80}{space 3} 185.4523
{txt}{space 13}TAvg_num_mem {c |}{col 27}{res}{space 2}        0{col 39}{txt}  (omitted)
{space 4}TAvg_annual_mean_temp {c |}{col 27}{res}{space 2}-2.782671{col 39}{space 2} 5.200283{col 50}{space 1}   -0.54{col 59}{space 3}0.593{col 67}{space 4}-12.97925{col 80}{space 3}  7.41391
{txt}TAvg_annual_precipitation {c |}{col 27}{res}{space 2} .0233698{col 39}{space 2} .5011378{col 50}{space 1}    0.05{col 59}{space 3}0.963{col 67}{space 4}-.9592483{col 80}{space 3} 1.005988
{txt}{space 22}imr {c |}{col 27}{res}{space 2}-294.3636{col 39}{space 2} 66.73759{col 50}{space 1}   -4.41{col 59}{space 3}0.000{col 67}{space 4}-425.2209{col 80}{space 3}-163.5062
{txt}{space 25} {c |}
{space 21}year {c |}
{space 20}2012  {c |}{col 27}{res}{space 2} 62.47012{col 39}{space 2} 19.95969{col 50}{space 1}    3.13{col 59}{space 3}0.002{col 67}{space 4} 23.33367{col 80}{space 3} 101.6066
{txt}{space 20}2015  {c |}{col 27}{res}{space 2} 164.1119{col 39}{space 2} 67.54038{col 50}{space 1}    2.43{col 59}{space 3}0.015{col 67}{space 4} 31.68044{col 80}{space 3} 296.5433
{txt}{space 20}2018  {c |}{col 27}{res}{space 2}        0{col 39}{txt}  (omitted)
{space 25} {c |}
{space 20}_cons {c |}{col 27}{res}{space 2}-1188.769{col 39}{space 2} 898.7887{col 50}{space 1}   -1.32{col 59}{space 3}0.186{col 67}{space 4}-2951.091{col 80}{space 3} 573.5522
{txt}{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}var(e.total_qty_w){c |}{col 27}{res}{space 2} 36890.05{col 39}{space 2} 2040.552{col 67}{space 4} 33098.33{col 80}{space 3} 41116.15
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. margins, predict(ystar(0,.)) dydx(*) post
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,960}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:E(total_qty_w*|total_qty_w>0), predict(ystar(0,.))}{p_end}
{p2col:dy/dx wrt:}{res:yhat subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem annual_mean_temp annual_precipitation TAvg_total_qty_w TAvg_yhat TAvg_subsidy_qty_w TAvg_dist_market_w TAvg_real_maize_price_mr TAvg_real_rice_price_mr TAvg_land_holding TAvg_real_hhvalue TAvg_org_fert TAvg_hh_headage TAvg_attend_sch TAvg_femhead TAvg_num_mem TAvg_annual_mean_temp TAvg_annual_precipitation imr 2012.year 2015.year 2018.year}{p_end}
{p2colreset}{...}

{res}{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39} Delta-method
{col 27}{c |}      dy/dx{col 39}   std. err.{col 51}      z{col 59}   P>|z|{col 67}     [95% con{col 80}f. interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 21}yhat {c |}{col 27}{res}{space 2}-.2054727{col 39}{space 2} .0780333{col 50}{space 1}   -2.63{col 59}{space 3}0.008{col 67}{space 4}-.3584151{col 80}{space 3}-.0525303
{txt}{space 12}subsidy_qty_w {c |}{col 27}{res}{space 2} .0716422{col 39}{space 2} .1406127{col 50}{space 1}    0.51{col 59}{space 3}0.610{col 67}{space 4}-.2039535{col 80}{space 3}  .347238
{txt}{space 12}dist_market_w {c |}{col 27}{res}{space 2} .2982144{col 39}{space 2} .0818611{col 50}{space 1}    3.64{col 59}{space 3}0.000{col 67}{space 4} .1377697{col 80}{space 3} .4586592
{txt}{space 6}real_maize_price_mr {c |}{col 27}{res}{space 2} .0240893{col 39}{space 2} .0176339{col 50}{space 1}    1.37{col 59}{space 3}0.172{col 67}{space 4}-.0104726{col 80}{space 3} .0586512
{txt}{space 7}real_rice_price_mr {c |}{col 27}{res}{space 2}-.0365931{col 39}{space 2} .0122517{col 50}{space 1}   -2.99{col 59}{space 3}0.003{col 67}{space 4}-.0606061{col 80}{space 3}-.0125801
{txt}{space 13}land_holding {c |}{col 27}{res}{space 2}-.0766376{col 39}{space 2} 1.343943{col 50}{space 1}   -0.06{col 59}{space 3}0.955{col 67}{space 4}-2.710717{col 80}{space 3} 2.557442
{txt}{space 13}real_hhvalue {c |}{col 27}{res}{space 2} -.040676{col 39}{space 2} .0100878{col 50}{space 1}   -4.03{col 59}{space 3}0.000{col 67}{space 4}-.0604478{col 80}{space 3}-.0209042
{txt}{space 17}org_fert {c |}{col 27}{res}{space 2}-21.13759{col 39}{space 2} 6.625982{col 50}{space 1}   -3.19{col 59}{space 3}0.001{col 67}{space 4}-34.12428{col 80}{space 3}-8.150907
{txt}{space 15}hh_headage {c |}{col 27}{res}{space 2} .3625968{col 39}{space 2} .3483587{col 50}{space 1}    1.04{col 59}{space 3}0.298{col 67}{space 4}-.3201738{col 80}{space 3} 1.045367
{txt}{space 15}attend_sch {c |}{col 27}{res}{space 2} 15.50284{col 39}{space 2} 7.534917{col 50}{space 1}    2.06{col 59}{space 3}0.040{col 67}{space 4} .7346699{col 80}{space 3}   30.271
{txt}{space 18}femhead {c |}{col 27}{res}{space 2} 2.148176{col 39}{space 2} 9.266853{col 50}{space 1}    0.23{col 59}{space 3}0.817{col 67}{space 4}-16.01452{col 80}{space 3} 20.31087
{txt}{space 18}num_mem {c |}{col 27}{res}{space 2}-.0660063{col 39}{space 2} 1.143458{col 50}{space 1}   -0.06{col 59}{space 3}0.954{col 67}{space 4}-2.307143{col 80}{space 3}  2.17513
{txt}{space 9}annual_mean_temp {c |}{col 27}{res}{space 2} .9029714{col 39}{space 2} 1.312432{col 50}{space 1}    0.69{col 59}{space 3}0.491{col 67}{space 4}-1.669349{col 80}{space 3} 3.475292
{txt}{space 5}annual_precipitation {c |}{col 27}{res}{space 2}-.0136069{col 39}{space 2} .1268599{col 50}{space 1}   -0.11{col 59}{space 3}0.915{col 67}{space 4}-.2622477{col 80}{space 3} .2350338
{txt}{space 9}TAvg_total_qty_w {c |}{col 27}{res}{space 2}  .489022{col 39}{space 2} .0195483{col 50}{space 1}   25.02{col 59}{space 3}0.000{col 67}{space 4} .4507081{col 80}{space 3} .5273359
{txt}{space 16}TAvg_yhat {c |}{col 27}{res}{space 2} 1.257335{col 39}{space 2} .8186563{col 50}{space 1}    1.54{col 59}{space 3}0.125{col 67}{space 4}-.3472018{col 80}{space 3} 2.861872
{txt}{space 7}TAvg_subsidy_qty_w {c |}{col 27}{res}{space 2}-.1958076{col 39}{space 2} .2375452{col 50}{space 1}   -0.82{col 59}{space 3}0.410{col 67}{space 4}-.6613876{col 80}{space 3} .2697724
{txt}{space 7}TAvg_dist_market_w {c |}{col 27}{res}{space 2}-.1942486{col 39}{space 2}  .066092{col 50}{space 1}   -2.94{col 59}{space 3}0.003{col 67}{space 4}-.3237865{col 80}{space 3}-.0647107
{txt}{space 1}TAvg_real_maize_price_mr {c |}{col 27}{res}{space 2}-.1971414{col 39}{space 2} .1289291{col 50}{space 1}   -1.53{col 59}{space 3}0.126{col 67}{space 4}-.4498377{col 80}{space 3} .0555549
{txt}{space 2}TAvg_real_rice_price_mr {c |}{col 27}{res}{space 2} .1614299{col 39}{space 2} .1118368{col 50}{space 1}    1.44{col 59}{space 3}0.149{col 67}{space 4}-.0577661{col 80}{space 3}  .380626
{txt}{space 8}TAvg_land_holding {c |}{col 27}{res}{space 2} 3.531345{col 39}{space 2} 6.123837{col 50}{space 1}    0.58{col 59}{space 3}0.564{col 67}{space 4}-8.471155{col 80}{space 3} 15.53384
{txt}{space 8}TAvg_real_hhvalue {c |}{col 27}{res}{space 2} .0788307{col 39}{space 2} .0371395{col 50}{space 1}    2.12{col 59}{space 3}0.034{col 67}{space 4} .0060385{col 80}{space 3} .1516228
{txt}{space 12}TAvg_org_fert {c |}{col 27}{res}{space 2} 6.466608{col 39}{space 2} 8.459563{col 50}{space 1}    0.76{col 59}{space 3}0.445{col 67}{space 4}-10.11383{col 80}{space 3} 23.04705
{txt}{space 10}TAvg_hh_headage {c |}{col 27}{res}{space 2}-1.450472{col 39}{space 2} 1.266425{col 50}{space 1}   -1.15{col 59}{space 3}0.252{col 67}{space 4}-3.932619{col 80}{space 3} 1.031675
{txt}{space 10}TAvg_attend_sch {c |}{col 27}{res}{space 2}-84.13876{col 39}{space 2} 51.51779{col 50}{space 1}   -1.63{col 59}{space 3}0.102{col 67}{space 4}-185.1118{col 80}{space 3} 16.83425
{txt}{space 13}TAvg_femhead {c |}{col 27}{res}{space 2}-55.20762{col 39}{space 2} 52.13696{col 50}{space 1}   -1.06{col 59}{space 3}0.290{col 67}{space 4}-157.3942{col 80}{space 3} 46.97894
{txt}{space 13}TAvg_num_mem {c |}{col 27}{res}{space 2}        0{col 39}{txt}  (omitted)
{space 4}TAvg_annual_mean_temp {c |}{col 27}{res}{space 2} -.704678{col 39}{space 2} 1.317129{col 50}{space 1}   -0.54{col 59}{space 3}0.593{col 67}{space 4}-3.286204{col 80}{space 3} 1.876848
{txt}TAvg_annual_precipitation {c |}{col 27}{res}{space 2} .0059181{col 39}{space 2} .1269089{col 50}{space 1}    0.05{col 59}{space 3}0.963{col 67}{space 4}-.2428187{col 80}{space 3}  .254655
{txt}{space 22}imr {c |}{col 27}{res}{space 2}-74.54403{col 39}{space 2} 16.97719{col 50}{space 1}   -4.39{col 59}{space 3}0.000{col 67}{space 4}-107.8187{col 80}{space 3}-41.26935
{txt}{space 25} {c |}
{space 21}year {c |}
{space 20}2012  {c |}{col 27}{res}{space 2}        .{col 39}{txt}  (not estimable)
{space 20}2015  {c |}{col 27}{res}{space 2}        .{col 39}{txt}  (not estimable)
{space 20}2018  {c |}{col 27}{res}{space 2}        .{col 39}{txt}  (not estimable)
{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 91}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. restore
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD798_000000.tmp"
{txt}
{com}. use  "C:\Users\obine\Music\Documents\Project\codes\without_median\complete\Nominal_heckman.dta", clear
{txt}(Nigeria GHS-Panel Wave 1 PP Ag Section 11D - Fertilizer Acquisition)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD798_000000.tmp"
{txt}
{com}. tabstat total_qty_w subsidy_qty_w mrk_dist_w real_tpricefert_cens_mrk num_mem hh_headage real_hhvalue worker real_maize_price_mr real_rice_price_mr land_holding [aweight = weight], statistics( mean median sd min max ) columns(statistics)

{txt}{ralign 12:Variable} {...}
{c |}      Mean       p50        SD       Min       Max
{hline 13}{c +}{hline 50}
{ralign 12:total_qty_w} {...}
{c |}{...}
 {res} 45.05122         0  118.0924         0      1000
{txt}{ralign 12:subsidy_qt~w} {...}
{c |}{...}
 {res}  32.5475         0  104.1844         0       750
{txt}{ralign 12:mrk_dist_w} {...}
{c |}{...}
 {res} 6.490536         3  10.42416         0        50
{txt}{ralign 12:real_tpric~k} {...}
{c |}{...}
 {res} 39.15045         0  144.0206         0      2000
{txt}{ralign 12:num_mem} {...}
{c |}{...}
 {res}  7.32168         7   3.57727         1        34
{txt}{ralign 12:hh_headage} {...}
{c |}{...}
 {res} 57.24329        55  10.63282        25       100
{txt}{ralign 12:real_hhvalue} {...}
{c |}{...}
 {res} 92.07157      43.2  168.4036         0      2488
{txt}{ralign 12:worker} {...}
{c |}{...}
 {res} 3.274765         3  1.803255         0        12
{txt}{ralign 12:real_maize~r} {...}
{c |}{...}
 {res} 119.9143       100  87.83527       .04       900
{txt}{ralign 12:real_rice_~r} {...}
{c |}{...}
 {res} 422.2063       300  361.7363         5      1500
{txt}{ralign 12:land_holding} {...}
{c |}{...}
 {res} 1.230784    .64485   1.62508     .0005    9.6602
{txt}{hline 13}{c BT}{hline 50}

{com}. egen med_zone = median (zone)
{txt}
{com}. replace zone = med_zone if zone ==.
{txt}(228 real changes made)

{com}. misstable summarize total_qty_w subsidy_qty_w mrk_dist_w real_tpricefert_cens_mrk num_mem hh_headage real_hhvalue worker real_maize_price_mr real_rice_price_mr land_holding  subsidy_dummy femhead informal_save formal_credit informal_credit ext_acess attend_sch pry_edu finish_pry finish_sec safety_net net_seller net_buyer soil_qty_rev2 zone year plot_elevation plot_slope plot_wetness dist_market_w annual_mean_temp annual_precipitation org_fert
{txt}(variables nonmissing or string)

{com}. 
. 
. *replace hh_headage = 72 if hh_headage >72
. gen lland_holding = log(land_holding)
{txt}
{com}. gen lreal_hhvalue = log(real_hhvalue + 1)
{txt}
{com}. 
. 
. sum real_tpricefert_cens_mrk, detail

      {txt}price of commercial fertilizer purchased in naira
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      2,960
{txt}25%    {res}        0              0       {txt}Sum of wgt. {res}      2,960

{txt}50%    {res}        0                      {txt}Mean          {res} 41.87363
                        {txt}Largest       Std. dev.     {res} 153.7867
{txt}75%    {res}    28.75           2000
{txt}90%    {res}      128           2000       {txt}Variance      {res} 23650.36
{txt}95%    {res}      160           2000       {txt}Skewness      {res} 10.64166
{txt}99%    {res}      300           2000       {txt}Kurtosis      {res} 133.7607
{txt}
{com}. 
. gen good_soil = (soil_qty_rev2==1)
{txt}
{com}. gen fair_soil = (soil_qty_rev2==2)
{txt}
{com}. 
. 
. local time_avg "total_qty_w subsidy_qty_w mrk_dist_w real_tpricefert_cens_mrk num_mem hh_headage real_hhvalue worker real_maize_price_mr real_rice_price_mr land_holding  subsidy_dummy femhead informal_save formal_credit informal_credit ext_acess attend_sch pry_edu finish_pry finish_sec safety_net net_seller net_buyer soil_qty_rev2 lland_holding lreal_hhvalue plot_elevation plot_slope plot_wetness annual_mean_temp annual_precipitation org_fert dist_market_w formal_bank formal_save"
{txt}
{com}. 
. foreach x in `time_avg' {c -(}
{txt}  2{com}. 
.         bysort hhid : egen TAvg_`x' = mean(`x')
{txt}  3{com}. 
. {c )-}
{txt}
{com}. 
. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD798_000000.tmp"
{txt}
{com}.  preserve 
{txt}
{com}. heckman real_tpricefert_cens_mrk subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem  i.year, select (commercial_dummy= subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem good_soil  i.year) twostep
{txt}note: two-step estimate of rho = -1.0616514 is being truncated to -1
{res}
{txt}Heckman selection model -- two-step estimates   Number of obs     = {res}     2,960
{txt}(regression model with sample selection)              Selected    = {res}       777
                                                {txt}      Nonselected = {res}     2,183

                                                {txt}Wald chi2({res}14{txt})     =  {res}    32.74
                                                {txt}Prob > chi2       =     {res}0.0031

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      z{col 58}   P>|z|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}real_tpricefert_cens_mrk {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2} 4.373436{col 38}{space 2} 2.751364{col 49}{space 1}    1.59{col 58}{space 3}0.112{col 66}{space 4}-1.019138{col 79}{space 3} 9.766011
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2} 2.063591{col 38}{space 2} 1.418061{col 49}{space 1}    1.46{col 58}{space 3}0.146{col 66}{space 4}-.7157569{col 79}{space 3} 4.842939
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2} .0488846{col 38}{space 2} .2109908{col 49}{space 1}    0.23{col 58}{space 3}0.817{col 66}{space 4}-.3646499{col 79}{space 3}  .462419
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2}-.2270021{col 38}{space 2} .0814433{col 49}{space 1}   -2.79{col 58}{space 3}0.005{col 66}{space 4} -.386628{col 79}{space 3}-.0673761
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2}-17.93558{col 38}{space 2} 12.92684{col 49}{space 1}   -1.39{col 58}{space 3}0.165{col 66}{space 4}-43.27171{col 79}{space 3} 7.400557
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0197586{col 38}{space 2}  .088129{col 49}{space 1}   -0.22{col 58}{space 3}0.823{col 66}{space 4}-.1924883{col 79}{space 3}  .152971
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2}-144.6792{col 38}{space 2} 106.7724{col 49}{space 1}   -1.36{col 58}{space 3}0.175{col 66}{space 4}-353.9493{col 79}{space 3} 64.59099
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}  6.83863{col 38}{space 2} 4.225296{col 49}{space 1}    1.62{col 58}{space 3}0.106{col 66}{space 4}-1.442797{col 79}{space 3} 15.12006
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} 33.81684{col 38}{space 2} 54.51418{col 49}{space 1}    0.62{col 58}{space 3}0.535{col 66}{space 4}-73.02899{col 79}{space 3} 140.6627
{txt}{space 17}femhead {c |}{col 26}{res}{space 2} 129.6899{col 38}{space 2} 78.02021{col 49}{space 1}    1.66{col 58}{space 3}0.096{col 66}{space 4}-23.22686{col 79}{space 3} 282.6068
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2} -15.9813{col 38}{space 2} 10.88886{col 49}{space 1}   -1.47{col 58}{space 3}0.142{col 66}{space 4}-37.32308{col 79}{space 3} 5.360476
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2} 40.50388{col 38}{space 2} 49.73305{col 49}{space 1}    0.81{col 58}{space 3}0.415{col 66}{space 4} -56.9711{col 79}{space 3} 137.9789
{txt}{space 19}2015  {c |}{col 26}{res}{space 2} 271.5209{col 38}{space 2} 58.12423{col 49}{space 1}    4.67{col 58}{space 3}0.000{col 66}{space 4} 157.5995{col 79}{space 3} 385.4423
{txt}{space 19}2018  {c |}{col 26}{res}{space 2}  145.674{col 38}{space 2} 65.43834{col 49}{space 1}    2.23{col 58}{space 3}0.026{col 66}{space 4} 17.41719{col 79}{space 3} 273.9308
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} 415.1236{col 38}{space 2} 239.2162{col 49}{space 1}    1.74{col 58}{space 3}0.083{col 66}{space 4}-53.73155{col 79}{space 3} 883.9788
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}commercial_dummy         {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2}-.0094658{col 38}{space 2} .0010109{col 49}{space 1}   -9.36{col 58}{space 3}0.000{col 66}{space 4}-.0114471{col 79}{space 3}-.0074846
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2}-.0055035{col 38}{space 2} .0006675{col 49}{space 1}   -8.24{col 58}{space 3}0.000{col 66}{space 4}-.0068119{col 79}{space 3}-.0041952
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2}-9.28e-06{col 38}{space 2} .0003372{col 49}{space 1}   -0.03{col 58}{space 3}0.978{col 66}{space 4}-.0006701{col 79}{space 3} .0006516
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2} .0002573{col 38}{space 2} .0000867{col 49}{space 1}    2.97{col 58}{space 3}0.003{col 66}{space 4} .0000873{col 79}{space 3} .0004272
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2} .0343497{col 38}{space 2} .0167375{col 49}{space 1}    2.05{col 58}{space 3}0.040{col 66}{space 4} .0015449{col 79}{space 3} .0671545
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0000263{col 38}{space 2} .0001479{col 49}{space 1}   -0.18{col 58}{space 3}0.859{col 66}{space 4}-.0003162{col 79}{space 3} .0002636
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2} .4108063{col 38}{space 2} .0769551{col 49}{space 1}    5.34{col 58}{space 3}0.000{col 66}{space 4} .2599771{col 79}{space 3} .5616355
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}-.0151757{col 38}{space 2} .0026907{col 49}{space 1}   -5.64{col 58}{space 3}0.000{col 66}{space 4}-.0204494{col 79}{space 3} -.009902
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} .0237964{col 38}{space 2} .0880822{col 49}{space 1}    0.27{col 58}{space 3}0.787{col 66}{space 4}-.1488416{col 79}{space 3} .1964344
{txt}{space 17}femhead {c |}{col 26}{res}{space 2}-.2174742{col 38}{space 2} .0835343{col 49}{space 1}   -2.60{col 58}{space 3}0.009{col 66}{space 4}-.3811984{col 79}{space 3}-.0537499
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2}  .040345{col 38}{space 2} .0079508{col 49}{space 1}    5.07{col 58}{space 3}0.000{col 66}{space 4} .0247617{col 79}{space 3} .0559283
{txt}{space 15}good_soil {c |}{col 26}{res}{space 2} .1846169{col 38}{space 2} .0899343{col 49}{space 1}    2.05{col 58}{space 3}0.040{col 66}{space 4} .0083489{col 79}{space 3} .3608848
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2}  .002548{col 38}{space 2} .0803549{col 49}{space 1}    0.03{col 58}{space 3}0.975{col 66}{space 4}-.1549448{col 79}{space 3} .1600408
{txt}{space 19}2015  {c |}{col 26}{res}{space 2}-.0770665{col 38}{space 2} .0856007{col 49}{space 1}   -0.90{col 58}{space 3}0.368{col 66}{space 4}-.2448407{col 79}{space 3} .0907077
{txt}{space 19}2018  {c |}{col 26}{res}{space 2}-.0780696{col 38}{space 2} .0965461{col 49}{space 1}   -0.81{col 58}{space 3}0.419{col 66}{space 4}-.2672965{col 79}{space 3} .1111572
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} .0792183{col 38}{space 2} .2136186{col 49}{space 1}    0.37{col 58}{space 3}0.711{col 66}{space 4}-.3394663{col 79}{space 3}  .497903
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/mills                   {txt}{c |}
{space 18}lambda {c |}{col 26}{res}{space 2}-590.0043{col 38}{space 2} 349.6287{col 49}{space 1}   -1.69{col 58}{space 3}0.092{col 66}{space 4}-1275.264{col 79}{space 3}  95.2553
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                     rho {c |} {res}  -1.00000
                   {txt}sigma {c |} {res}  590.0043
{txt}{hline 25}{c BT}{hline 64}

{com}. predict yhat, xb
{txt}
{com}. predict imr, mills
{txt}
{com}. 
. ************winzonrizing fertilizer market price
. foreach v of varlist  yhat  {c -(}
{txt}  2{com}.         _pctile `v' [aw=weight] , p(1 95) 
{txt}  3{com}.         gen `v'_w=`v'
{txt}  4{com}.         *replace  `v'_w = r(r1) if  `v'_w < r(r1) &  `v'_w!=.
.         replace  `v'_w = r(r2) if  `v'_w > r(r2) &  `v'_w!=.
{txt}  5{com}.         local l`v' : var lab `v'
{txt}  6{com}.         lab var  `v'_w  "`l`v'' - Winzorized top & bottom 5%"
{txt}  7{com}. {c )-}
{txt}(135 real changes made)

{com}. 
. 
. gen lyhat = log(yhat_w)
{txt}
{com}. gen ltotal_qty_w = log(total_qty_w + 1)
{txt}
{com}. local time_avg "lyhat ltotal_qty_w"
{txt}
{com}. foreach x in `time_avg' {c -(}
{txt}  2{com}.         bysort hhid : egen TAvg_`x' = mean(`x')
{txt}  3{com}. {c )-}
{txt}
{com}. 
. ** CRE-TOBIT 
. tobit ltotal_qty_w lyhat subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem annual_mean_temp annual_precipitation  TAvg_ltotal_qty_w TAvg_lyhat TAvg_subsidy_qty_w TAvg_dist_market_w  TAvg_real_maize_price_mr TAvg_real_rice_price_mr TAvg_land_holding TAvg_real_hhvalue TAvg_org_fert TAvg_hh_headage TAvg_attend_sch TAvg_femhead TAvg_num_mem  TAvg_annual_mean_temp TAvg_annual_precipitation imr i.year, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 2}Log likelihood = {res:-4585.3887}

Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-4585.3887}  
Iteration 1:{space 2}Log likelihood = {res:-3280.1273}  
Iteration 2:{space 2}Log likelihood = {res:-2799.3027}  
Iteration 3:{space 2}Log likelihood = {res:-2772.3957}  
Iteration 4:{space 2}Log likelihood = {res:-2770.4387}  
Iteration 5:{space 2}Log likelihood = {res:-2770.4334}  
Iteration 6:{space 2}Log likelihood = {res:-2770.4334}  
{res}
{txt}{col 1}Tobit regression{col 52}{lalign 17:Number of obs}{col 69} = {res}{ralign 7:2,960}
{txt}{col 52}{ralign 17:Uncensored}{col 69} = {res}{ralign 7:777}
{txt}{col 1}Limits: Lower = {ralign 4:{res:0}}{col 52}{ralign 17:Left-censored}{col 69} = {res}{ralign 7:2,183}
{txt}{col 1}        Upper = {ralign 4:{txt:+inf}}{col 52}{ralign 17:   Right-censored}{col 69} = {res}{ralign 7:0}

{txt}{col 52}{lalign 17:LR chi2({res:33})}{col 69} = {res}{ralign 7:1546.36}
{txt}{col 52}{lalign 17:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-2770.4334}{txt}{col 52}{lalign 17:Pseudo R2}{col 69} = {res}{ralign 7:0.2182}

{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}             ltotal_qty_w{col 27}{c |} Coefficient{col 39}  Std. err.{col 51}      t{col 59}   P>|t|{col 67}     [95% con{col 80}f. interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}lyhat {c |}{col 27}{res}{space 2}-6.126411{col 39}{space 2} 2.421526{col 50}{space 1}   -2.53{col 59}{space 3}0.011{col 67}{space 4}-10.87448{col 80}{space 3}-1.378344
{txt}{space 12}subsidy_qty_w {c |}{col 27}{res}{space 2}-.0366852{col 39}{space 2} .0248514{col 50}{space 1}   -1.48{col 59}{space 3}0.140{col 67}{space 4}-.0854132{col 80}{space 3} .0120428
{txt}{space 12}dist_market_w {c |}{col 27}{res}{space 2} .0096644{col 39}{space 2} .0141185{col 50}{space 1}    0.68{col 59}{space 3}0.494{col 67}{space 4}-.0180187{col 80}{space 3} .0373475
{txt}{space 6}real_maize_price_mr {c |}{col 27}{res}{space 2}-.0017907{col 39}{space 2} .0014453{col 50}{space 1}   -1.24{col 59}{space 3}0.215{col 67}{space 4}-.0046245{col 80}{space 3} .0010431
{txt}{space 7}real_rice_price_mr {c |}{col 27}{res}{space 2}-.0004648{col 39}{space 2} .0009893{col 50}{space 1}   -0.47{col 59}{space 3}0.638{col 67}{space 4}-.0024045{col 80}{space 3} .0014749
{txt}{space 13}land_holding {c |}{col 27}{res}{space 2}-.0152009{col 39}{space 2} .1337574{col 50}{space 1}   -0.11{col 59}{space 3}0.910{col 67}{space 4} -.277469{col 80}{space 3} .2470672
{txt}{space 13}real_hhvalue {c |}{col 27}{res}{space 2}-.0012526{col 39}{space 2}  .000786{col 50}{space 1}   -1.59{col 59}{space 3}0.111{col 67}{space 4}-.0027938{col 80}{space 3} .0002886
{txt}{space 17}org_fert {c |}{col 27}{res}{space 2}-.5832663{col 39}{space 2} 1.036563{col 50}{space 1}   -0.56{col 59}{space 3}0.574{col 67}{space 4}-2.615733{col 80}{space 3} 1.449201
{txt}{space 15}hh_headage {c |}{col 27}{res}{space 2}-.0332389{col 39}{space 2} .0473757{col 50}{space 1}   -0.70{col 59}{space 3}0.483{col 67}{space 4} -.126132{col 80}{space 3} .0596541
{txt}{space 15}attend_sch {c |}{col 27}{res}{space 2} .8807434{col 39}{space 2} .4550918{col 50}{space 1}    1.94{col 59}{space 3}0.053{col 67}{space 4}-.0115891{col 80}{space 3} 1.773076
{txt}{space 18}femhead {c |}{col 27}{res}{space 2}-1.010595{col 39}{space 2} .9503576{col 50}{space 1}   -1.06{col 59}{space 3}0.288{col 67}{space 4}-2.874033{col 80}{space 3} .8528418
{txt}{space 18}num_mem {c |}{col 27}{res}{space 2}-.0005222{col 39}{space 2} .1316278{col 50}{space 1}   -0.00{col 59}{space 3}0.997{col 67}{space 4}-.2586146{col 80}{space 3} .2575703
{txt}{space 9}annual_mean_temp {c |}{col 27}{res}{space 2} .0303924{col 39}{space 2} .1006259{col 50}{space 1}    0.30{col 59}{space 3}0.763{col 67}{space 4}-.1669123{col 80}{space 3} .2276971
{txt}{space 5}annual_precipitation {c |}{col 27}{res}{space 2} .0041664{col 39}{space 2} .0098954{col 50}{space 1}    0.42{col 59}{space 3}0.674{col 67}{space 4}-.0152362{col 80}{space 3}  .023569
{txt}{space 8}TAvg_ltotal_qty_w {c |}{col 27}{res}{space 2} 2.696955{col 39}{space 2} .0992284{col 50}{space 1}   27.18{col 59}{space 3}0.000{col 67}{space 4} 2.502391{col 80}{space 3}  2.89152
{txt}{space 15}TAvg_lyhat {c |}{col 27}{res}{space 2} 11.40878{col 39}{space 2}  1.83779{col 50}{space 1}    6.21{col 59}{space 3}0.000{col 67}{space 4}  7.80529{col 80}{space 3} 15.01228
{txt}{space 7}TAvg_subsidy_qty_w {c |}{col 27}{res}{space 2}-.0061905{col 39}{space 2} .0043907{col 50}{space 1}   -1.41{col 59}{space 3}0.159{col 67}{space 4}-.0147998{col 80}{space 3} .0024187
{txt}{space 7}TAvg_dist_market_w {c |}{col 27}{res}{space 2}-.0283587{col 39}{space 2} .0065598{col 50}{space 1}   -4.32{col 59}{space 3}0.000{col 67}{space 4} -.041221{col 80}{space 3}-.0154964
{txt}{space 1}TAvg_real_maize_price_mr {c |}{col 27}{res}{space 2}-.0002665{col 39}{space 2} .0032776{col 50}{space 1}   -0.08{col 59}{space 3}0.935{col 67}{space 4}-.0066932{col 80}{space 3} .0061601
{txt}{space 2}TAvg_real_rice_price_mr {c |}{col 27}{res}{space 2} .0012309{col 39}{space 2} .0009893{col 50}{space 1}    1.24{col 59}{space 3}0.214{col 67}{space 4} -.000709{col 80}{space 3} .0031707
{txt}{space 8}TAvg_land_holding {c |}{col 27}{res}{space 2} -.016876{col 39}{space 2} .1372864{col 50}{space 1}   -0.12{col 59}{space 3}0.902{col 67}{space 4}-.2860636{col 80}{space 3} .2523116
{txt}{space 8}TAvg_real_hhvalue {c |}{col 27}{res}{space 2} .0019888{col 39}{space 2} .0011165{col 50}{space 1}    1.78{col 59}{space 3}0.075{col 67}{space 4}-.0002005{col 80}{space 3} .0041781
{txt}{space 12}TAvg_org_fert {c |}{col 27}{res}{space 2} 2.104254{col 39}{space 2} .7508376{col 50}{space 1}    2.80{col 59}{space 3}0.005{col 67}{space 4} .6320307{col 80}{space 3} 3.576477
{txt}{space 10}TAvg_hh_headage {c |}{col 27}{res}{space 2} -.025751{col 39}{space 2} .0285879{col 50}{space 1}   -0.90{col 59}{space 3}0.368{col 67}{space 4}-.0818055{col 80}{space 3} .0303034
{txt}{space 10}TAvg_attend_sch {c |}{col 27}{res}{space 2}-1.056987{col 39}{space 2} .6560692{col 50}{space 1}   -1.61{col 59}{space 3}0.107{col 67}{space 4}-2.343391{col 80}{space 3} .2294173
{txt}{space 13}TAvg_femhead {c |}{col 27}{res}{space 2} .3232894{col 39}{space 2} .8332762{col 50}{space 1}    0.39{col 59}{space 3}0.698{col 67}{space 4}-1.310578{col 80}{space 3} 1.957156
{txt}{space 13}TAvg_num_mem {c |}{col 27}{res}{space 2} .1452076{col 39}{space 2} .0951899{col 50}{space 1}    1.53{col 59}{space 3}0.127{col 67}{space 4}-.0414385{col 80}{space 3} .3318536
{txt}{space 4}TAvg_annual_mean_temp {c |}{col 27}{res}{space 2}-.0091178{col 39}{space 2} .1011989{col 50}{space 1}   -0.09{col 59}{space 3}0.928{col 67}{space 4}-.2075461{col 80}{space 3} .1893104
{txt}TAvg_annual_precipitation {c |}{col 27}{res}{space 2} -.004365{col 39}{space 2} .0099019{col 50}{space 1}   -0.44{col 59}{space 3}0.659{col 67}{space 4}-.0237805{col 80}{space 3} .0150505
{txt}{space 22}imr {c |}{col 27}{res}{space 2} 1.314198{col 39}{space 2} 2.455098{col 50}{space 1}    0.54{col 59}{space 3}0.592{col 67}{space 4}-3.499696{col 80}{space 3} 6.128091
{txt}{space 25} {c |}
{space 21}year {c |}
{space 20}2012  {c |}{col 27}{res}{space 2} .7405571{col 39}{space 2} .3332697{col 50}{space 1}    2.22{col 59}{space 3}0.026{col 67}{space 4} .0870903{col 80}{space 3} 1.394024
{txt}{space 20}2015  {c |}{col 27}{res}{space 2} 1.989168{col 39}{space 2} .8914773{col 50}{space 1}    2.23{col 59}{space 3}0.026{col 67}{space 4} .2411817{col 80}{space 3} 3.737154
{txt}{space 20}2018  {c |}{col 27}{res}{space 2} 1.945241{col 39}{space 2} .6565057{col 50}{space 1}    2.96{col 59}{space 3}0.003{col 67}{space 4}  .657981{col 80}{space 3} 3.232501
{txt}{space 25} {c |}
{space 20}_cons {c |}{col 27}{res}{space 2}-46.10696{col 39}{space 2} 18.25697{col 50}{space 1}   -2.53{col 59}{space 3}0.012{col 67}{space 4}-81.90476{col 80}{space 3}-10.30916
{txt}{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}var(e.ltotal_qty_w){c |}{col 27}{res}{space 2} 14.15277{col 39}{space 2} .8296263{col 67}{space 4} 12.61606{col 80}{space 3} 15.87665
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. margins, predict(ystar(0,.)) dydx(*) post
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,960}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:E(ltotal_qty_w*|ltotal_qty_w>0), predict(ystar(0,.))}{p_end}
{p2col:dy/dx wrt:}{res:lyhat subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem annual_mean_temp annual_precipitation TAvg_ltotal_qty_w TAvg_lyhat TAvg_subsidy_qty_w TAvg_dist_market_w TAvg_real_maize_price_mr TAvg_real_rice_price_mr TAvg_land_holding TAvg_real_hhvalue TAvg_org_fert TAvg_hh_headage TAvg_attend_sch TAvg_femhead TAvg_num_mem TAvg_annual_mean_temp TAvg_annual_precipitation imr 2012.year 2015.year 2018.year}{p_end}
{p2colreset}{...}

{res}{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39} Delta-method
{col 27}{c |}      dy/dx{col 39}   std. err.{col 51}      z{col 59}   P>|z|{col 67}     [95% con{col 80}f. interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}lyhat {c |}{col 27}{res}{space 2}-1.745004{col 39}{space 2} .6887514{col 50}{space 1}   -2.53{col 59}{space 3}0.011{col 67}{space 4}-3.094932{col 80}{space 3}-.3950758
{txt}{space 12}subsidy_qty_w {c |}{col 27}{res}{space 2}-.0104492{col 39}{space 2} .0070802{col 50}{space 1}   -1.48{col 59}{space 3}0.140{col 67}{space 4}-.0243262{col 80}{space 3} .0034279
{txt}{space 12}dist_market_w {c |}{col 27}{res}{space 2} .0027527{col 39}{space 2} .0040206{col 50}{space 1}    0.68{col 59}{space 3}0.494{col 67}{space 4}-.0051276{col 80}{space 3}  .010633
{txt}{space 6}real_maize_price_mr {c |}{col 27}{res}{space 2}  -.00051{col 39}{space 2} .0004116{col 50}{space 1}   -1.24{col 59}{space 3}0.215{col 67}{space 4}-.0013169{col 80}{space 3} .0002968
{txt}{space 7}real_rice_price_mr {c |}{col 27}{res}{space 2}-.0001324{col 39}{space 2} .0002817{col 50}{space 1}   -0.47{col 59}{space 3}0.638{col 67}{space 4}-.0006846{col 80}{space 3} .0004198
{txt}{space 13}land_holding {c |}{col 27}{res}{space 2}-.0043297{col 39}{space 2} .0380973{col 50}{space 1}   -0.11{col 59}{space 3}0.910{col 67}{space 4}-.0789991{col 80}{space 3} .0703397
{txt}{space 13}real_hhvalue {c |}{col 27}{res}{space 2}-.0003568{col 39}{space 2} .0002239{col 50}{space 1}   -1.59{col 59}{space 3}0.111{col 67}{space 4}-.0007956{col 80}{space 3}  .000082
{txt}{space 17}org_fert {c |}{col 27}{res}{space 2}-.1661335{col 39}{space 2} .2952056{col 50}{space 1}   -0.56{col 59}{space 3}0.574{col 67}{space 4}-.7447258{col 80}{space 3} .4124589
{txt}{space 15}hh_headage {c |}{col 27}{res}{space 2}-.0094675{col 39}{space 2}  .013496{col 50}{space 1}   -0.70{col 59}{space 3}0.483{col 67}{space 4}-.0359193{col 80}{space 3} .0169842
{txt}{space 15}attend_sch {c |}{col 27}{res}{space 2} .2508647{col 39}{space 2} .1295279{col 50}{space 1}    1.94{col 59}{space 3}0.053{col 67}{space 4}-.0030054{col 80}{space 3} .5047348
{txt}{space 18}femhead {c |}{col 27}{res}{space 2}-.2878509{col 39}{space 2} .2707698{col 50}{space 1}   -1.06{col 59}{space 3}0.288{col 67}{space 4}-.8185498{col 80}{space 3} .2428481
{txt}{space 18}num_mem {c |}{col 27}{res}{space 2}-.0001487{col 39}{space 2} .0374919{col 50}{space 1}   -0.00{col 59}{space 3}0.997{col 67}{space 4}-.0736315{col 80}{space 3}  .073334
{txt}{space 9}annual_mean_temp {c |}{col 27}{res}{space 2} .0086568{col 39}{space 2} .0286619{col 50}{space 1}    0.30{col 59}{space 3}0.763{col 67}{space 4}-.0475196{col 80}{space 3} .0648332
{txt}{space 5}annual_precipitation {c |}{col 27}{res}{space 2} .0011867{col 39}{space 2} .0028182{col 50}{space 1}    0.42{col 59}{space 3}0.674{col 67}{space 4}-.0043369{col 80}{space 3} .0067104
{txt}{space 8}TAvg_ltotal_qty_w {c |}{col 27}{res}{space 2} .7681817{col 39}{space 2} .0263735{col 50}{space 1}   29.13{col 59}{space 3}0.000{col 67}{space 4} .7164906{col 80}{space 3} .8198728
{txt}{space 15}TAvg_lyhat {c |}{col 27}{res}{space 2} 3.249597{col 39}{space 2} .5221641{col 50}{space 1}    6.22{col 59}{space 3}0.000{col 67}{space 4} 2.226175{col 80}{space 3}  4.27302
{txt}{space 7}TAvg_subsidy_qty_w {c |}{col 27}{res}{space 2}-.0017633{col 39}{space 2} .0012503{col 50}{space 1}   -1.41{col 59}{space 3}0.158{col 67}{space 4}-.0042137{col 80}{space 3} .0006872
{txt}{space 7}TAvg_dist_market_w {c |}{col 27}{res}{space 2}-.0080775{col 39}{space 2} .0018648{col 50}{space 1}   -4.33{col 59}{space 3}0.000{col 67}{space 4}-.0117324{col 80}{space 3}-.0044226
{txt}{space 1}TAvg_real_maize_price_mr {c |}{col 27}{res}{space 2}-.0000759{col 39}{space 2} .0009336{col 50}{space 1}   -0.08{col 59}{space 3}0.935{col 67}{space 4}-.0019057{col 80}{space 3} .0017539
{txt}{space 2}TAvg_real_rice_price_mr {c |}{col 27}{res}{space 2} .0003506{col 39}{space 2} .0002818{col 50}{space 1}    1.24{col 59}{space 3}0.213{col 67}{space 4}-.0002017{col 80}{space 3} .0009029
{txt}{space 8}TAvg_land_holding {c |}{col 27}{res}{space 2}-.0048068{col 39}{space 2} .0391039{col 50}{space 1}   -0.12{col 59}{space 3}0.902{col 67}{space 4}-.0814491{col 80}{space 3} .0718354
{txt}{space 8}TAvg_real_hhvalue {c |}{col 27}{res}{space 2} .0005665{col 39}{space 2} .0003181{col 50}{space 1}    1.78{col 59}{space 3}0.075{col 67}{space 4} -.000057{col 80}{space 3} .0011899
{txt}{space 12}TAvg_org_fert {c |}{col 27}{res}{space 2} .5993609{col 39}{space 2} .2137748{col 50}{space 1}    2.80{col 59}{space 3}0.005{col 67}{space 4} .1803699{col 80}{space 3} 1.018352
{txt}{space 10}TAvg_hh_headage {c |}{col 27}{res}{space 2}-.0073347{col 39}{space 2} .0081421{col 50}{space 1}   -0.90{col 59}{space 3}0.368{col 67}{space 4} -.023293{col 80}{space 3} .0086235
{txt}{space 10}TAvg_attend_sch {c |}{col 27}{res}{space 2}-.3010646{col 39}{space 2} .1867943{col 50}{space 1}   -1.61{col 59}{space 3}0.107{col 67}{space 4}-.6671747{col 80}{space 3} .0650455
{txt}{space 13}TAvg_femhead {c |}{col 27}{res}{space 2} .0920835{col 39}{space 2} .2373506{col 50}{space 1}    0.39{col 59}{space 3}0.698{col 67}{space 4}-.3731152{col 80}{space 3} .5572821
{txt}{space 13}TAvg_num_mem {c |}{col 27}{res}{space 2} .0413599{col 39}{space 2} .0271014{col 50}{space 1}    1.53{col 59}{space 3}0.127{col 67}{space 4}-.0117579{col 80}{space 3} .0944777
{txt}{space 4}TAvg_annual_mean_temp {c |}{col 27}{res}{space 2}-.0025971{col 39}{space 2}  .028825{col 50}{space 1}   -0.09{col 59}{space 3}0.928{col 67}{space 4}-.0590929{col 80}{space 3} .0538988
{txt}TAvg_annual_precipitation {c |}{col 27}{res}{space 2}-.0012433{col 39}{space 2} .0028201{col 50}{space 1}   -0.44{col 59}{space 3}0.659{col 67}{space 4}-.0067706{col 80}{space 3}  .004284
{txt}{space 22}imr {c |}{col 27}{res}{space 2} .3743268{col 39}{space 2}  .699317{col 50}{space 1}    0.54{col 59}{space 3}0.592{col 67}{space 4}-.9963093{col 80}{space 3} 1.744963
{txt}{space 25} {c |}
{space 21}year {c |}
{space 20}2012  {c |}{col 27}{res}{space 2} .1797355{col 39}{space 2} .0775771{col 50}{space 1}    2.32{col 59}{space 3}0.021{col 67}{space 4} .0276871{col 80}{space 3} .3317839
{txt}{space 20}2015  {c |}{col 27}{res}{space 2}  .550767{col 39}{space 2} .2557721{col 50}{space 1}    2.15{col 59}{space 3}0.031{col 67}{space 4}  .049463{col 80}{space 3} 1.052071
{txt}{space 20}2018  {c |}{col 27}{res}{space 2} .5361599{col 39}{space 2} .1761655{col 50}{space 1}    3.04{col 59}{space 3}0.002{col 67}{space 4} .1908819{col 80}{space 3}  .881438
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 91}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. restore
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD798_000000.tmp"
{txt}
{com}.  preserve 
{txt}
{com}. heckman real_tpricefert_cens_mrk subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem  i.year, select (commercial_dummy= subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem good_soil  i.year) twostep
{txt}note: two-step estimate of rho = -1.0616514 is being truncated to -1
{res}
{txt}Heckman selection model -- two-step estimates   Number of obs     = {res}     2,960
{txt}(regression model with sample selection)              Selected    = {res}       777
                                                {txt}      Nonselected = {res}     2,183

                                                {txt}Wald chi2({res}14{txt})     =  {res}    32.74
                                                {txt}Prob > chi2       =     {res}0.0031

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      z{col 58}   P>|z|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}real_tpricefert_cens_mrk {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2} 4.373436{col 38}{space 2} 2.751364{col 49}{space 1}    1.59{col 58}{space 3}0.112{col 66}{space 4}-1.019138{col 79}{space 3} 9.766011
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2} 2.063591{col 38}{space 2} 1.418061{col 49}{space 1}    1.46{col 58}{space 3}0.146{col 66}{space 4}-.7157569{col 79}{space 3} 4.842939
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2} .0488846{col 38}{space 2} .2109908{col 49}{space 1}    0.23{col 58}{space 3}0.817{col 66}{space 4}-.3646499{col 79}{space 3}  .462419
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2}-.2270021{col 38}{space 2} .0814433{col 49}{space 1}   -2.79{col 58}{space 3}0.005{col 66}{space 4} -.386628{col 79}{space 3}-.0673761
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2}-17.93558{col 38}{space 2} 12.92684{col 49}{space 1}   -1.39{col 58}{space 3}0.165{col 66}{space 4}-43.27171{col 79}{space 3} 7.400557
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0197586{col 38}{space 2}  .088129{col 49}{space 1}   -0.22{col 58}{space 3}0.823{col 66}{space 4}-.1924883{col 79}{space 3}  .152971
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2}-144.6792{col 38}{space 2} 106.7724{col 49}{space 1}   -1.36{col 58}{space 3}0.175{col 66}{space 4}-353.9493{col 79}{space 3} 64.59099
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}  6.83863{col 38}{space 2} 4.225296{col 49}{space 1}    1.62{col 58}{space 3}0.106{col 66}{space 4}-1.442797{col 79}{space 3} 15.12006
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} 33.81684{col 38}{space 2} 54.51418{col 49}{space 1}    0.62{col 58}{space 3}0.535{col 66}{space 4}-73.02899{col 79}{space 3} 140.6627
{txt}{space 17}femhead {c |}{col 26}{res}{space 2} 129.6899{col 38}{space 2} 78.02021{col 49}{space 1}    1.66{col 58}{space 3}0.096{col 66}{space 4}-23.22686{col 79}{space 3} 282.6068
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2} -15.9813{col 38}{space 2} 10.88886{col 49}{space 1}   -1.47{col 58}{space 3}0.142{col 66}{space 4}-37.32308{col 79}{space 3} 5.360476
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2} 40.50388{col 38}{space 2} 49.73305{col 49}{space 1}    0.81{col 58}{space 3}0.415{col 66}{space 4} -56.9711{col 79}{space 3} 137.9789
{txt}{space 19}2015  {c |}{col 26}{res}{space 2} 271.5209{col 38}{space 2} 58.12423{col 49}{space 1}    4.67{col 58}{space 3}0.000{col 66}{space 4} 157.5995{col 79}{space 3} 385.4423
{txt}{space 19}2018  {c |}{col 26}{res}{space 2}  145.674{col 38}{space 2} 65.43834{col 49}{space 1}    2.23{col 58}{space 3}0.026{col 66}{space 4} 17.41719{col 79}{space 3} 273.9308
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} 415.1236{col 38}{space 2} 239.2162{col 49}{space 1}    1.74{col 58}{space 3}0.083{col 66}{space 4}-53.73155{col 79}{space 3} 883.9788
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}commercial_dummy         {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2}-.0094658{col 38}{space 2} .0010109{col 49}{space 1}   -9.36{col 58}{space 3}0.000{col 66}{space 4}-.0114471{col 79}{space 3}-.0074846
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2}-.0055035{col 38}{space 2} .0006675{col 49}{space 1}   -8.24{col 58}{space 3}0.000{col 66}{space 4}-.0068119{col 79}{space 3}-.0041952
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2}-9.28e-06{col 38}{space 2} .0003372{col 49}{space 1}   -0.03{col 58}{space 3}0.978{col 66}{space 4}-.0006701{col 79}{space 3} .0006516
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2} .0002573{col 38}{space 2} .0000867{col 49}{space 1}    2.97{col 58}{space 3}0.003{col 66}{space 4} .0000873{col 79}{space 3} .0004272
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2} .0343497{col 38}{space 2} .0167375{col 49}{space 1}    2.05{col 58}{space 3}0.040{col 66}{space 4} .0015449{col 79}{space 3} .0671545
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0000263{col 38}{space 2} .0001479{col 49}{space 1}   -0.18{col 58}{space 3}0.859{col 66}{space 4}-.0003162{col 79}{space 3} .0002636
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2} .4108063{col 38}{space 2} .0769551{col 49}{space 1}    5.34{col 58}{space 3}0.000{col 66}{space 4} .2599771{col 79}{space 3} .5616355
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}-.0151757{col 38}{space 2} .0026907{col 49}{space 1}   -5.64{col 58}{space 3}0.000{col 66}{space 4}-.0204494{col 79}{space 3} -.009902
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} .0237964{col 38}{space 2} .0880822{col 49}{space 1}    0.27{col 58}{space 3}0.787{col 66}{space 4}-.1488416{col 79}{space 3} .1964344
{txt}{space 17}femhead {c |}{col 26}{res}{space 2}-.2174742{col 38}{space 2} .0835343{col 49}{space 1}   -2.60{col 58}{space 3}0.009{col 66}{space 4}-.3811984{col 79}{space 3}-.0537499
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2}  .040345{col 38}{space 2} .0079508{col 49}{space 1}    5.07{col 58}{space 3}0.000{col 66}{space 4} .0247617{col 79}{space 3} .0559283
{txt}{space 15}good_soil {c |}{col 26}{res}{space 2} .1846169{col 38}{space 2} .0899343{col 49}{space 1}    2.05{col 58}{space 3}0.040{col 66}{space 4} .0083489{col 79}{space 3} .3608848
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2}  .002548{col 38}{space 2} .0803549{col 49}{space 1}    0.03{col 58}{space 3}0.975{col 66}{space 4}-.1549448{col 79}{space 3} .1600408
{txt}{space 19}2015  {c |}{col 26}{res}{space 2}-.0770665{col 38}{space 2} .0856007{col 49}{space 1}   -0.90{col 58}{space 3}0.368{col 66}{space 4}-.2448407{col 79}{space 3} .0907077
{txt}{space 19}2018  {c |}{col 26}{res}{space 2}-.0780696{col 38}{space 2} .0965461{col 49}{space 1}   -0.81{col 58}{space 3}0.419{col 66}{space 4}-.2672965{col 79}{space 3} .1111572
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} .0792183{col 38}{space 2} .2136186{col 49}{space 1}    0.37{col 58}{space 3}0.711{col 66}{space 4}-.3394663{col 79}{space 3}  .497903
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/mills                   {txt}{c |}
{space 18}lambda {c |}{col 26}{res}{space 2}-590.0043{col 38}{space 2} 349.6287{col 49}{space 1}   -1.69{col 58}{space 3}0.092{col 66}{space 4}-1275.264{col 79}{space 3}  95.2553
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                     rho {c |} {res}  -1.00000
                   {txt}sigma {c |} {res}  590.0043
{txt}{hline 25}{c BT}{hline 64}

{com}. predict yhat, xb
{txt}
{com}. predict imr, mills
{txt}
{com}. 
. gen lyhat = log(yhat)
{txt}
{com}. gen ltotal_qty_w = log(total_qty_w + 1)
{txt}
{com}. local time_avg "lyhat ltotal_qty_w"
{txt}
{com}. foreach x in `time_avg' {c -(}
{txt}  2{com}.         bysort hhid : egen TAvg_`x' = mean(`x')
{txt}  3{com}. {c )-}
{txt}
{com}. 
. ** CRE-TOBIT 
. tobit ltotal_qty_w lyhat subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem annual_mean_temp annual_precipitation  TAvg_ltotal_qty_w TAvg_lyhat TAvg_subsidy_qty_w TAvg_dist_market_w  TAvg_real_maize_price_mr TAvg_real_rice_price_mr TAvg_land_holding TAvg_real_hhvalue TAvg_org_fert TAvg_hh_headage TAvg_attend_sch TAvg_femhead TAvg_num_mem  TAvg_annual_mean_temp TAvg_annual_precipitation imr i.year, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 2}Log likelihood = {res:-4587.3763}

Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-4587.3763}  
Iteration 1:{space 2}Log likelihood = {res:-3282.3451}  
Iteration 2:{space 2}Log likelihood = {res: -2934.916}  
Iteration 3:{space 2}Log likelihood = {res:-2783.9222}  
Iteration 4:{space 2}Log likelihood = {res:-2770.5233}  
Iteration 5:{space 2}Log likelihood = {res:-2769.9385}  
Iteration 6:{space 2}Log likelihood = {res:-2769.9382}  
Iteration 7:{space 2}Log likelihood = {res:-2769.9382}  
{res}
{txt}{col 1}Tobit regression{col 52}{lalign 17:Number of obs}{col 69} = {res}{ralign 7:2,960}
{txt}{col 52}{ralign 17:Uncensored}{col 69} = {res}{ralign 7:777}
{txt}{col 1}Limits: Lower = {ralign 4:{res:0}}{col 52}{ralign 17:Left-censored}{col 69} = {res}{ralign 7:2,183}
{txt}{col 1}        Upper = {ralign 4:{txt:+inf}}{col 52}{ralign 17:   Right-censored}{col 69} = {res}{ralign 7:0}

{txt}{col 52}{lalign 17:LR chi2({res:33})}{col 69} = {res}{ralign 7:1547.35}
{txt}{col 52}{lalign 17:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-2769.9382}{txt}{col 52}{lalign 17:Pseudo R2}{col 69} = {res}{ralign 7:0.2183}

{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}             ltotal_qty_w{col 27}{c |} Coefficient{col 39}  Std. err.{col 51}      t{col 59}   P>|t|{col 67}     [95% con{col 80}f. interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}lyhat {c |}{col 27}{res}{space 2}-7.232562{col 39}{space 2} 2.668495{col 50}{space 1}   -2.71{col 59}{space 3}0.007{col 67}{space 4}-12.46488{col 80}{space 3}-2.000244
{txt}{space 12}subsidy_qty_w {c |}{col 27}{res}{space 2}-.0339042{col 39}{space 2} .0257526{col 50}{space 1}   -1.32{col 59}{space 3}0.188{col 67}{space 4}-.0843992{col 80}{space 3} .0165909
{txt}{space 12}dist_market_w {c |}{col 27}{res}{space 2} .0109596{col 39}{space 2} .0145495{col 50}{space 1}    0.75{col 59}{space 3}0.451{col 67}{space 4}-.0175688{col 80}{space 3} .0394879
{txt}{space 6}real_maize_price_mr {c |}{col 27}{res}{space 2}-.0017121{col 39}{space 2} .0014481{col 50}{space 1}   -1.18{col 59}{space 3}0.237{col 67}{space 4}-.0045514{col 80}{space 3} .0011272
{txt}{space 7}real_rice_price_mr {c |}{col 27}{res}{space 2}-.0006631{col 39}{space 2}  .001034{col 50}{space 1}   -0.64{col 59}{space 3}0.521{col 67}{space 4}-.0026905{col 80}{space 3} .0013642
{txt}{space 13}land_holding {c |}{col 27}{res}{space 2}-.0272225{col 39}{space 2} .1368349{col 50}{space 1}   -0.20{col 59}{space 3}0.842{col 67}{space 4}-.2955249{col 80}{space 3} .2410799
{txt}{space 13}real_hhvalue {c |}{col 27}{res}{space 2}-.0013108{col 39}{space 2} .0007876{col 50}{space 1}   -1.66{col 59}{space 3}0.096{col 67}{space 4}-.0028551{col 80}{space 3} .0002334
{txt}{space 17}org_fert {c |}{col 27}{res}{space 2}-.7057903{col 39}{space 2} 1.069928{col 50}{space 1}   -0.66{col 59}{space 3}0.510{col 67}{space 4}-2.803678{col 80}{space 3} 1.392097
{txt}{space 15}hh_headage {c |}{col 27}{res}{space 2}-.0290106{col 39}{space 2} .0486444{col 50}{space 1}   -0.60{col 59}{space 3}0.551{col 67}{space 4}-.1243913{col 80}{space 3} .0663701
{txt}{space 15}attend_sch {c |}{col 27}{res}{space 2} .9351423{col 39}{space 2} .4584224{col 50}{space 1}    2.04{col 59}{space 3}0.041{col 67}{space 4} .0362791{col 80}{space 3} 1.834005
{txt}{space 18}femhead {c |}{col 27}{res}{space 2}-.9149469{col 39}{space 2} .9681265{col 50}{space 1}   -0.95{col 59}{space 3}0.345{col 67}{space 4}-2.813225{col 80}{space 3} .9833311
{txt}{space 18}num_mem {c |}{col 27}{res}{space 2}-.0097903{col 39}{space 2} .1349745{col 50}{space 1}   -0.07{col 59}{space 3}0.942{col 67}{space 4} -.274445{col 80}{space 3} .2548644
{txt}{space 9}annual_mean_temp {c |}{col 27}{res}{space 2} .0301811{col 39}{space 2} .1005417{col 50}{space 1}    0.30{col 59}{space 3}0.764{col 67}{space 4}-.1669585{col 80}{space 3} .2273207
{txt}{space 5}annual_precipitation {c |}{col 27}{res}{space 2} .0041086{col 39}{space 2} .0099009{col 50}{space 1}    0.41{col 59}{space 3}0.678{col 67}{space 4}-.0153048{col 80}{space 3}  .023522
{txt}{space 8}TAvg_ltotal_qty_w {c |}{col 27}{res}{space 2} 2.699188{col 39}{space 2} .0992567{col 50}{space 1}   27.19{col 59}{space 3}0.000{col 67}{space 4} 2.504568{col 80}{space 3} 2.893808
{txt}{space 15}TAvg_lyhat {c |}{col 27}{res}{space 2} 16.79361{col 39}{space 2} 2.658382{col 50}{space 1}    6.32{col 59}{space 3}0.000{col 67}{space 4} 11.58112{col 80}{space 3}  22.0061
{txt}{space 7}TAvg_subsidy_qty_w {c |}{col 27}{res}{space 2}-.0316851{col 39}{space 2} .0080852{col 50}{space 1}   -3.92{col 59}{space 3}0.000{col 67}{space 4}-.0475385{col 80}{space 3}-.0158318
{txt}{space 7}TAvg_dist_market_w {c |}{col 27}{res}{space 2}-.0417902{col 39}{space 2} .0080011{col 50}{space 1}   -5.22{col 59}{space 3}0.000{col 67}{space 4}-.0574786{col 80}{space 3}-.0261019
{txt}{space 1}TAvg_real_maize_price_mr {c |}{col 27}{res}{space 2} -.000827{col 39}{space 2} .0032853{col 50}{space 1}   -0.25{col 59}{space 3}0.801{col 67}{space 4}-.0072687{col 80}{space 3} .0056147
{txt}{space 2}TAvg_real_rice_price_mr {c |}{col 27}{res}{space 2} .0026579{col 39}{space 2} .0011004{col 50}{space 1}    2.42{col 59}{space 3}0.016{col 67}{space 4} .0005004{col 80}{space 3} .0048154
{txt}{space 8}TAvg_land_holding {c |}{col 27}{res}{space 2} .1017054{col 39}{space 2} .1437045{col 50}{space 1}    0.71{col 59}{space 3}0.479{col 67}{space 4}-.1800667{col 80}{space 3} .3834775
{txt}{space 8}TAvg_real_hhvalue {c |}{col 27}{res}{space 2} .0021424{col 39}{space 2}  .001119{col 50}{space 1}    1.91{col 59}{space 3}0.056{col 67}{space 4}-.0000516{col 80}{space 3} .0043365
{txt}{space 12}TAvg_org_fert {c |}{col 27}{res}{space 2} 3.186377{col 39}{space 2} .8356669{col 50}{space 1}    3.81{col 59}{space 3}0.000{col 67}{space 4} 1.547823{col 80}{space 3} 4.824932
{txt}{space 10}TAvg_hh_headage {c |}{col 27}{res}{space 2}-.0668471{col 39}{space 2} .0319968{col 50}{space 1}   -2.09{col 59}{space 3}0.037{col 67}{space 4}-.1295857{col 80}{space 3}-.0041085
{txt}{space 10}TAvg_attend_sch {c |}{col 27}{res}{space 2}-1.315415{col 39}{space 2}  .663538{col 50}{space 1}   -1.98{col 59}{space 3}0.048{col 67}{space 4}-2.616464{col 80}{space 3}-.0143667
{txt}{space 13}TAvg_femhead {c |}{col 27}{res}{space 2}-.4065585{col 39}{space 2} .8728384{col 50}{space 1}   -0.47{col 59}{space 3}0.641{col 67}{space 4}-2.117998{col 80}{space 3} 1.304881
{txt}{space 13}TAvg_num_mem {c |}{col 27}{res}{space 2} .2516056{col 39}{space 2} .1024191{col 50}{space 1}    2.46{col 59}{space 3}0.014{col 67}{space 4} .0507848{col 80}{space 3} .4524263
{txt}{space 4}TAvg_annual_mean_temp {c |}{col 27}{res}{space 2}-.0096752{col 39}{space 2} .1011159{col 50}{space 1}   -0.10{col 59}{space 3}0.924{col 67}{space 4}-.2079407{col 80}{space 3} .1885904
{txt}TAvg_annual_precipitation {c |}{col 27}{res}{space 2} -.004322{col 39}{space 2} .0099074{col 50}{space 1}   -0.44{col 59}{space 3}0.663{col 67}{space 4}-.0237482{col 80}{space 3} .0151041
{txt}{space 22}imr {c |}{col 27}{res}{space 2} 1.685988{col 39}{space 2} 2.457555{col 50}{space 1}    0.69{col 59}{space 3}0.493{col 67}{space 4}-3.132724{col 80}{space 3} 6.504699
{txt}{space 25} {c |}
{space 21}year {c |}
{space 20}2012  {c |}{col 27}{res}{space 2} .7805294{col 39}{space 2} .3364142{col 50}{space 1}    2.32{col 59}{space 3}0.020{col 67}{space 4}  .120897{col 80}{space 3} 1.440162
{txt}{space 20}2015  {c |}{col 27}{res}{space 2} 2.289351{col 39}{space 2} .9571943{col 50}{space 1}    2.39{col 59}{space 3}0.017{col 67}{space 4} .4125089{col 80}{space 3} 4.166194
{txt}{space 20}2018  {c |}{col 27}{res}{space 2} 2.091276{col 39}{space 2} .6836002{col 50}{space 1}    3.06{col 59}{space 3}0.002{col 67}{space 4} .7508896{col 80}{space 3} 3.431662
{txt}{space 25} {c |}
{space 20}_cons {c |}{col 27}{res}{space 2}-73.45951{col 39}{space 2} 21.04215{col 50}{space 1}   -3.49{col 59}{space 3}0.000{col 67}{space 4}-114.7184{col 80}{space 3}-32.20059
{txt}{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}var(e.ltotal_qty_w){c |}{col 27}{res}{space 2} 14.15776{col 39}{space 2} .8298535{col 67}{space 4} 12.62063{col 80}{space 3} 15.88211
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. margins, predict(ystar(0,.)) dydx(*) post
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,960}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:E(ltotal_qty_w*|ltotal_qty_w>0), predict(ystar(0,.))}{p_end}
{p2col:dy/dx wrt:}{res:lyhat subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem annual_mean_temp annual_precipitation TAvg_ltotal_qty_w TAvg_lyhat TAvg_subsidy_qty_w TAvg_dist_market_w TAvg_real_maize_price_mr TAvg_real_rice_price_mr TAvg_land_holding TAvg_real_hhvalue TAvg_org_fert TAvg_hh_headage TAvg_attend_sch TAvg_femhead TAvg_num_mem TAvg_annual_mean_temp TAvg_annual_precipitation imr 2012.year 2015.year 2018.year}{p_end}
{p2colreset}{...}

{res}{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39} Delta-method
{col 27}{c |}      dy/dx{col 39}   std. err.{col 51}      z{col 59}   P>|z|{col 67}     [95% con{col 80}f. interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}lyhat {c |}{col 27}{res}{space 2}-2.059907{col 39}{space 2} .7588378{col 50}{space 1}   -2.71{col 59}{space 3}0.007{col 67}{space 4}-3.547202{col 80}{space 3}-.5726127
{txt}{space 12}subsidy_qty_w {c |}{col 27}{res}{space 2}-.0096562{col 39}{space 2} .0073364{col 50}{space 1}   -1.32{col 59}{space 3}0.188{col 67}{space 4}-.0240354{col 80}{space 3} .0047229
{txt}{space 12}dist_market_w {c |}{col 27}{res}{space 2} .0031214{col 39}{space 2} .0041429{col 50}{space 1}    0.75{col 59}{space 3}0.451{col 67}{space 4}-.0049986{col 80}{space 3} .0112414
{txt}{space 6}real_maize_price_mr {c |}{col 27}{res}{space 2}-.0004876{col 39}{space 2} .0004124{col 50}{space 1}   -1.18{col 59}{space 3}0.237{col 67}{space 4}-.0012959{col 80}{space 3} .0003207
{txt}{space 7}real_rice_price_mr {c |}{col 27}{res}{space 2}-.0001889{col 39}{space 2} .0002944{col 50}{space 1}   -0.64{col 59}{space 3}0.521{col 67}{space 4}-.0007659{col 80}{space 3} .0003882
{txt}{space 13}land_holding {c |}{col 27}{res}{space 2}-.0077532{col 39}{space 2} .0389698{col 50}{space 1}   -0.20{col 59}{space 3}0.842{col 67}{space 4}-.0841326{col 80}{space 3} .0686261
{txt}{space 13}real_hhvalue {c |}{col 27}{res}{space 2}-.0003733{col 39}{space 2} .0002243{col 50}{space 1}   -1.66{col 59}{space 3}0.096{col 67}{space 4} -.000813{col 80}{space 3} .0000663
{txt}{space 17}org_fert {c |}{col 27}{res}{space 2}-.2010163{col 39}{space 2}  .304672{col 50}{space 1}   -0.66{col 59}{space 3}0.509{col 67}{space 4}-.7981625{col 80}{space 3} .3961299
{txt}{space 15}hh_headage {c |}{col 27}{res}{space 2}-.0082625{col 39}{space 2} .0138562{col 50}{space 1}   -0.60{col 59}{space 3}0.551{col 67}{space 4}-.0354201{col 80}{space 3} .0188951
{txt}{space 15}attend_sch {c |}{col 27}{res}{space 2}  .266338{col 39}{space 2} .1304564{col 50}{space 1}    2.04{col 59}{space 3}0.041{col 67}{space 4} .0106483{col 80}{space 3} .5220278
{txt}{space 18}femhead {c |}{col 27}{res}{space 2}-.2605862{col 39}{space 2} .2758061{col 50}{space 1}   -0.94{col 59}{space 3}0.345{col 67}{space 4}-.8011562{col 80}{space 3} .2799838
{txt}{space 18}num_mem {c |}{col 27}{res}{space 2}-.0027884{col 39}{space 2} .0384411{col 50}{space 1}   -0.07{col 59}{space 3}0.942{col 67}{space 4}-.0781316{col 80}{space 3} .0725548
{txt}{space 9}annual_mean_temp {c |}{col 27}{res}{space 2} .0085959{col 39}{space 2} .0286356{col 50}{space 1}    0.30{col 59}{space 3}0.764{col 67}{space 4}-.0475289{col 80}{space 3} .0647207
{txt}{space 5}annual_precipitation {c |}{col 27}{res}{space 2} .0011702{col 39}{space 2} .0028196{col 50}{space 1}    0.42{col 59}{space 3}0.678{col 67}{space 4}-.0043561{col 80}{space 3} .0066965
{txt}{space 8}TAvg_ltotal_qty_w {c |}{col 27}{res}{space 2} .7687562{col 39}{space 2} .0263688{col 50}{space 1}   29.15{col 59}{space 3}0.000{col 67}{space 4} .7170744{col 80}{space 3} .8204381
{txt}{space 15}TAvg_lyhat {c |}{col 27}{res}{space 2} 4.782991{col 39}{space 2} .7550558{col 50}{space 1}    6.33{col 59}{space 3}0.000{col 67}{space 4} 3.303108{col 80}{space 3} 6.262873
{txt}{space 7}TAvg_subsidy_qty_w {c |}{col 27}{res}{space 2}-.0090242{col 39}{space 2} .0022997{col 50}{space 1}   -3.92{col 59}{space 3}0.000{col 67}{space 4}-.0135316{col 80}{space 3}-.0045169
{txt}{space 7}TAvg_dist_market_w {c |}{col 27}{res}{space 2}-.0119023{col 39}{space 2}  .002273{col 50}{space 1}   -5.24{col 59}{space 3}0.000{col 67}{space 4}-.0163572{col 80}{space 3}-.0074474
{txt}{space 1}TAvg_real_maize_price_mr {c |}{col 27}{res}{space 2}-.0002355{col 39}{space 2} .0009357{col 50}{space 1}   -0.25{col 59}{space 3}0.801{col 67}{space 4}-.0020695{col 80}{space 3} .0015984
{txt}{space 2}TAvg_real_rice_price_mr {c |}{col 27}{res}{space 2}  .000757{col 39}{space 2} .0003133{col 50}{space 1}    2.42{col 59}{space 3}0.016{col 67}{space 4}  .000143{col 80}{space 3}  .001371
{txt}{space 8}TAvg_land_holding {c |}{col 27}{res}{space 2} .0289667{col 39}{space 2} .0409255{col 50}{space 1}    0.71{col 59}{space 3}0.479{col 67}{space 4}-.0512458{col 80}{space 3} .1091792
{txt}{space 8}TAvg_real_hhvalue {c |}{col 27}{res}{space 2} .0006102{col 39}{space 2} .0003188{col 50}{space 1}    1.91{col 59}{space 3}0.056{col 67}{space 4}-.0000146{col 80}{space 3}  .001235
{txt}{space 12}TAvg_org_fert {c |}{col 27}{res}{space 2} .9075127{col 39}{space 2} .2378071{col 50}{space 1}    3.82{col 59}{space 3}0.000{col 67}{space 4} .4414193{col 80}{space 3} 1.373606
{txt}{space 10}TAvg_hh_headage {c |}{col 27}{res}{space 2}-.0190387{col 39}{space 2} .0091098{col 50}{space 1}   -2.09{col 59}{space 3}0.037{col 67}{space 4}-.0368937{col 80}{space 3}-.0011838
{txt}{space 10}TAvg_attend_sch {c |}{col 27}{res}{space 2}-.3746436{col 39}{space 2}  .188878{col 50}{space 1}   -1.98{col 59}{space 3}0.047{col 67}{space 4}-.7448377{col 80}{space 3}-.0044496
{txt}{space 13}TAvg_femhead {c |}{col 27}{res}{space 2} -.115792{col 39}{space 2} .2485794{col 50}{space 1}   -0.47{col 59}{space 3}0.641{col 67}{space 4}-.6029986{col 80}{space 3} .3714146
{txt}{space 13}TAvg_num_mem {c |}{col 27}{res}{space 2} .0716598{col 39}{space 2} .0291453{col 50}{space 1}    2.46{col 59}{space 3}0.014{col 67}{space 4}  .014536{col 80}{space 3} .1287836
{txt}{space 4}TAvg_annual_mean_temp {c |}{col 27}{res}{space 2}-.0027556{col 39}{space 2}  .028799{col 50}{space 1}   -0.10{col 59}{space 3}0.924{col 67}{space 4}-.0592006{col 80}{space 3} .0536895
{txt}TAvg_annual_precipitation {c |}{col 27}{res}{space 2} -.001231{col 39}{space 2} .0028214{col 50}{space 1}   -0.44{col 59}{space 3}0.663{col 67}{space 4}-.0067609{col 80}{space 3}  .004299
{txt}{space 22}imr {c |}{col 27}{res}{space 2} .4801864{col 39}{space 2} .6999661{col 50}{space 1}    0.69{col 59}{space 3}0.493{col 67}{space 4}-.8917219{col 80}{space 3} 1.852095
{txt}{space 25} {c |}
{space 21}year {c |}
{space 20}2012  {c |}{col 27}{res}{space 2} .1858122{col 39}{space 2} .0763037{col 50}{space 1}    2.44{col 59}{space 3}0.015{col 67}{space 4} .0362598{col 80}{space 3} .3353646
{txt}{space 20}2015  {c |}{col 27}{res}{space 2} .6393936{col 39}{space 2} .2798214{col 50}{space 1}    2.29{col 59}{space 3}0.022{col 67}{space 4} .0909537{col 80}{space 3} 1.187834
{txt}{space 20}2018  {c |}{col 27}{res}{space 2} .5722053{col 39}{space 2} .1815157{col 50}{space 1}    3.15{col 59}{space 3}0.002{col 67}{space 4} .2164411{col 80}{space 3} .9279696
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 91}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. restore
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD798_000000.tmp"
{txt}
{com}.  preserve 
{txt}
{com}. heckman real_tpricefert_cens_mrk subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem annual_mean_temp annual_precipitation  i.year, select (commercial_dummy= subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem good_soil annual_mean_temp annual_precipitation  i.year) twostep
{txt}note: two-step estimate of rho = -1.0568175 is being truncated to -1
{res}
{txt}Heckman selection model -- two-step estimates   Number of obs     = {res}     2,960
{txt}(regression model with sample selection)              Selected    = {res}       777
                                                {txt}      Nonselected = {res}     2,183

                                                {txt}Wald chi2({res}16{txt})     =  {res}    35.18
                                                {txt}Prob > chi2       =     {res}0.0038

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      z{col 58}   P>|z|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}real_tpricefert_cens_mrk {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2} 4.383372{col 38}{space 2} 2.577179{col 49}{space 1}    1.70{col 58}{space 3}0.089{col 66}{space 4}-.6678066{col 79}{space 3} 9.434551
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2} 2.043118{col 38}{space 2} 1.313412{col 49}{space 1}    1.56{col 58}{space 3}0.120{col 66}{space 4}-.5311226{col 79}{space 3} 4.617358
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2} .0668259{col 38}{space 2} .2064399{col 49}{space 1}    0.32{col 58}{space 3}0.746{col 66}{space 4}-.3377888{col 79}{space 3} .4714406
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2}-.1503629{col 38}{space 2} .0579815{col 49}{space 1}   -2.59{col 58}{space 3}0.010{col 66}{space 4}-.2640046{col 79}{space 3}-.0367212
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2}-12.18674{col 38}{space 2} 11.00894{col 49}{space 1}   -1.11{col 58}{space 3}0.268{col 66}{space 4}-33.76388{col 79}{space 3} 9.390393
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0744861{col 38}{space 2} .0910245{col 49}{space 1}   -0.82{col 58}{space 3}0.413{col 66}{space 4}-.2528909{col 79}{space 3} .1039187
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2}-103.1924{col 38}{space 2}  81.6148{col 49}{space 1}   -1.26{col 58}{space 3}0.206{col 66}{space 4}-263.1545{col 79}{space 3} 56.76966
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2} 4.965553{col 38}{space 2} 3.162456{col 49}{space 1}    1.57{col 58}{space 3}0.116{col 66}{space 4}-1.232747{col 79}{space 3} 11.16385
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2}-3.845145{col 38}{space 2} 59.81195{col 49}{space 1}   -0.06{col 58}{space 3}0.949{col 66}{space 4}-121.0744{col 79}{space 3} 113.3841
{txt}{space 17}femhead {c |}{col 26}{res}{space 2} 75.35376{col 38}{space 2} 59.59061{col 49}{space 1}    1.26{col 58}{space 3}0.206{col 66}{space 4}-41.44168{col 79}{space 3} 192.1492
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2}-13.93238{col 38}{space 2} 9.269407{col 49}{space 1}   -1.50{col 58}{space 3}0.133{col 66}{space 4}-32.10008{col 79}{space 3} 4.235327
{txt}{space 8}annual_mean_temp {c |}{col 26}{res}{space 2}-1.092112{col 38}{space 2} 1.970986{col 49}{space 1}   -0.55{col 58}{space 3}0.580{col 66}{space 4}-4.955173{col 79}{space 3}  2.77095
{txt}{space 4}annual_precipitation {c |}{col 26}{res}{space 2} .1364843{col 38}{space 2}  .079681{col 49}{space 1}    1.71{col 58}{space 3}0.087{col 66}{space 4}-.0196875{col 79}{space 3} .2926561
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2} 35.36285{col 38}{space 2} 48.69977{col 49}{space 1}    0.73{col 58}{space 3}0.468{col 66}{space 4}-60.08694{col 79}{space 3} 130.8126
{txt}{space 19}2015  {c |}{col 26}{res}{space 2} 245.9871{col 38}{space 2} 52.45308{col 49}{space 1}    4.69{col 58}{space 3}0.000{col 66}{space 4}  143.181{col 79}{space 3} 348.7933
{txt}{space 19}2018  {c |}{col 26}{res}{space 2} 118.5209{col 38}{space 2} 60.09477{col 49}{space 1}    1.97{col 58}{space 3}0.049{col 66}{space 4} .7372896{col 79}{space 3} 236.3045
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} 606.5594{col 38}{space 2} 593.7617{col 49}{space 1}    1.02{col 58}{space 3}0.307{col 66}{space 4}-557.1921{col 79}{space 3} 1770.311
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}commercial_dummy         {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2}-.0098216{col 38}{space 2}  .001025{col 49}{space 1}   -9.58{col 58}{space 3}0.000{col 66}{space 4}-.0118305{col 79}{space 3}-.0078127
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2}-.0056932{col 38}{space 2} .0006696{col 49}{space 1}   -8.50{col 58}{space 3}0.000{col 66}{space 4}-.0070056{col 79}{space 3}-.0043807
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2}-.0000414{col 38}{space 2} .0003411{col 49}{space 1}   -0.12{col 58}{space 3}0.903{col 66}{space 4}-.0007099{col 79}{space 3} .0006271
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2}  .000089{col 38}{space 2} .0000941{col 49}{space 1}    0.95{col 58}{space 3}0.344{col 66}{space 4}-.0000954{col 79}{space 3} .0002734
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2} .0210019{col 38}{space 2} .0171303{col 49}{space 1}    1.23{col 58}{space 3}0.220{col 66}{space 4}-.0125729{col 79}{space 3} .0545767
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2} .0001042{col 38}{space 2} .0001506{col 49}{space 1}    0.69{col 58}{space 3}0.489{col 66}{space 4} -.000191{col 79}{space 3} .0003994
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2} .3219102{col 38}{space 2} .0788821{col 49}{space 1}    4.08{col 58}{space 3}0.000{col 66}{space 4} .1673042{col 79}{space 3} .4765162
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}-.0114316{col 38}{space 2} .0027819{col 49}{space 1}   -4.11{col 58}{space 3}0.000{col 66}{space 4}-.0168841{col 79}{space 3}-.0059791
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} .1153383{col 38}{space 2} .0903089{col 49}{space 1}    1.28{col 58}{space 3}0.202{col 66}{space 4}-.0616639{col 79}{space 3} .2923405
{txt}{space 17}femhead {c |}{col 26}{res}{space 2}-.1031959{col 38}{space 2} .0867285{col 49}{space 1}   -1.19{col 58}{space 3}0.234{col 66}{space 4}-.2731807{col 79}{space 3} .0667889
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2} .0366045{col 38}{space 2} .0079959{col 49}{space 1}    4.58{col 58}{space 3}0.000{col 66}{space 4} .0209329{col 79}{space 3} .0522761
{txt}{space 15}good_soil {c |}{col 26}{res}{space 2}  .206388{col 38}{space 2}  .090482{col 49}{space 1}    2.28{col 58}{space 3}0.023{col 66}{space 4} .0290466{col 79}{space 3} .3837294
{txt}{space 8}annual_mean_temp {c |}{col 26}{res}{space 2} .0018139{col 38}{space 2} .0033793{col 49}{space 1}    0.54{col 58}{space 3}0.591{col 66}{space 4}-.0048093{col 79}{space 3} .0084371
{txt}{space 4}annual_precipitation {c |}{col 26}{res}{space 2}-.0003172{col 38}{space 2} .0000638{col 49}{space 1}   -4.97{col 58}{space 3}0.000{col 66}{space 4}-.0004422{col 79}{space 3}-.0001922
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2}  .014725{col 38}{space 2} .0810456{col 49}{space 1}    0.18{col 58}{space 3}0.856{col 66}{space 4}-.1441213{col 79}{space 3} .1735714
{txt}{space 19}2015  {c |}{col 26}{res}{space 2}-.0199766{col 38}{space 2} .0867464{col 49}{space 1}   -0.23{col 58}{space 3}0.818{col 66}{space 4}-.1899965{col 79}{space 3} .1500432
{txt}{space 19}2018  {c |}{col 26}{res}{space 2}-.0207935{col 38}{space 2} .0981483{col 49}{space 1}   -0.21{col 58}{space 3}0.832{col 66}{space 4}-.2131606{col 79}{space 3} .1715736
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2}-.2049224{col 38}{space 2} .9264598{col 49}{space 1}   -0.22{col 58}{space 3}0.825{col 66}{space 4} -2.02075{col 79}{space 3} 1.610905
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/mills                   {txt}{c |}
{space 18}lambda {c |}{col 26}{res}{space 2}-571.5065{col 38}{space 2} 315.9719{col 49}{space 1}   -1.81{col 58}{space 3}0.070{col 66}{space 4}  -1190.8{col 79}{space 3} 47.78712
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                     rho {c |} {res}  -1.00000
                   {txt}sigma {c |} {res} 571.50649
{txt}{hline 25}{c BT}{hline 64}

{com}. predict yhat, xb
{txt}
{com}. predict imr, mills
{txt}
{com}. 
. gen lyhat = log(yhat)
{txt}
{com}. gen ltotal_qty_w = log(total_qty_w + 1)
{txt}
{com}. local time_avg "lyhat ltotal_qty_w"
{txt}
{com}. foreach x in `time_avg' {c -(}
{txt}  2{com}.         bysort hhid : egen TAvg_`x' = mean(`x')
{txt}  3{com}. {c )-}
{txt}
{com}. 
. ** CRE-TOBIT 
. tobit ltotal_qty_w lyhat subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem annual_mean_temp annual_precipitation  TAvg_ltotal_qty_w TAvg_lyhat TAvg_subsidy_qty_w TAvg_dist_market_w  TAvg_real_maize_price_mr TAvg_real_rice_price_mr TAvg_land_holding TAvg_real_hhvalue TAvg_org_fert TAvg_hh_headage TAvg_attend_sch TAvg_femhead TAvg_num_mem  TAvg_annual_mean_temp TAvg_annual_precipitation imr i.year, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 2}Log likelihood = {res:-4585.0041}

Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-4585.0041}  
Iteration 1:{space 2}Log likelihood = {res:-3280.0954}  
Iteration 2:{space 2}Log likelihood = {res:-2933.6696}  
Iteration 3:{space 2}Log likelihood = {res:-2781.8769}  
Iteration 4:{space 2}Log likelihood = {res:-2768.5847}  
Iteration 5:{space 2}Log likelihood = {res:-2768.0023}  
Iteration 6:{space 2}Log likelihood = {res: -2768.002}  
Iteration 7:{space 2}Log likelihood = {res: -2768.002}  
{res}
{txt}{col 1}Tobit regression{col 52}{lalign 17:Number of obs}{col 69} = {res}{ralign 7:2,960}
{txt}{col 52}{ralign 17:Uncensored}{col 69} = {res}{ralign 7:777}
{txt}{col 1}Limits: Lower = {ralign 4:{res:0}}{col 52}{ralign 17:Left-censored}{col 69} = {res}{ralign 7:2,183}
{txt}{col 1}        Upper = {ralign 4:{txt:+inf}}{col 52}{ralign 17:   Right-censored}{col 69} = {res}{ralign 7:0}

{txt}{col 52}{lalign 17:LR chi2({res:33})}{col 69} = {res}{ralign 7:1551.23}
{txt}{col 52}{lalign 17:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 9:-2768.002}{txt}{col 52}{lalign 17:Pseudo R2}{col 69} = {res}{ralign 7:0.2189}

{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}             ltotal_qty_w{col 27}{c |} Coefficient{col 39}  Std. err.{col 51}      t{col 59}   P>|t|{col 67}     [95% con{col 80}f. interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}lyhat {c |}{col 27}{res}{space 2}-8.111039{col 39}{space 2} 2.676668{col 50}{space 1}   -3.03{col 59}{space 3}0.002{col 67}{space 4}-13.35938{col 80}{space 3}-2.862696
{txt}{space 12}subsidy_qty_w {c |}{col 27}{res}{space 2}-.0244295{col 39}{space 2} .0246448{col 50}{space 1}   -0.99{col 59}{space 3}0.322{col 67}{space 4}-.0727525{col 80}{space 3} .0238935
{txt}{space 12}dist_market_w {c |}{col 27}{res}{space 2} .0162661{col 39}{space 2} .0139493{col 50}{space 1}    1.17{col 59}{space 3}0.244{col 67}{space 4}-.0110854{col 80}{space 3} .0436176
{txt}{space 6}real_maize_price_mr {c |}{col 27}{res}{space 2}-.0015537{col 39}{space 2} .0014555{col 50}{space 1}   -1.07{col 59}{space 3}0.286{col 67}{space 4}-.0044077{col 80}{space 3} .0013002
{txt}{space 7}real_rice_price_mr {c |}{col 27}{res}{space 2}-.0003485{col 39}{space 2} .0006208{col 50}{space 1}   -0.56{col 59}{space 3}0.575{col 67}{space 4}-.0015657{col 80}{space 3} .0008688
{txt}{space 13}land_holding {c |}{col 27}{res}{space 2}-.0212076{col 39}{space 2} .1103502{col 50}{space 1}   -0.19{col 59}{space 3}0.848{col 67}{space 4}-.2375796{col 80}{space 3} .1951643
{txt}{space 13}real_hhvalue {c |}{col 27}{res}{space 2}-.0018832{col 39}{space 2} .0008857{col 50}{space 1}   -2.13{col 59}{space 3}0.034{col 67}{space 4}-.0036199{col 80}{space 3}-.0001465
{txt}{space 17}org_fert {c |}{col 27}{res}{space 2}-.7339617{col 39}{space 2} .7932197{col 50}{space 1}   -0.93{col 59}{space 3}0.355{col 67}{space 4}-2.289287{col 80}{space 3} .8213634
{txt}{space 15}hh_headage {c |}{col 27}{res}{space 2}-.0271643{col 39}{space 2} .0380909{col 50}{space 1}   -0.71{col 59}{space 3}0.476{col 67}{space 4} -.101852{col 80}{space 3} .0475234
{txt}{space 15}attend_sch {c |}{col 27}{res}{space 2} .6217799{col 39}{space 2} .4790281{col 50}{space 1}    1.30{col 59}{space 3}0.194{col 67}{space 4}-.3174864{col 80}{space 3} 1.561046
{txt}{space 18}femhead {c |}{col 27}{res}{space 2}-1.090469{col 39}{space 2} .7755306{col 50}{space 1}   -1.41{col 59}{space 3}0.160{col 67}{space 4} -2.61111{col 80}{space 3} .4301714
{txt}{space 18}num_mem {c |}{col 27}{res}{space 2}-.0322122{col 39}{space 2} .1212537{col 50}{space 1}   -0.27{col 59}{space 3}0.791{col 67}{space 4}-.2699635{col 80}{space 3}  .205539
{txt}{space 9}annual_mean_temp {c |}{col 27}{res}{space 2} .0330961{col 39}{space 2} .1013449{col 50}{space 1}    0.33{col 59}{space 3}0.744{col 67}{space 4}-.1656184{col 80}{space 3} .2318107
{txt}{space 5}annual_precipitation {c |}{col 27}{res}{space 2}  .004688{col 39}{space 2}  .009941{col 50}{space 1}    0.47{col 59}{space 3}0.637{col 67}{space 4} -.014804{col 80}{space 3}   .02418
{txt}{space 8}TAvg_ltotal_qty_w {c |}{col 27}{res}{space 2} 2.699771{col 39}{space 2} .0992106{col 50}{space 1}   27.21{col 59}{space 3}0.000{col 67}{space 4} 2.505241{col 80}{space 3} 2.894301
{txt}{space 15}TAvg_lyhat {c |}{col 27}{res}{space 2} 16.69364{col 39}{space 2} 2.525013{col 50}{space 1}    6.61{col 59}{space 3}0.000{col 67}{space 4} 11.74266{col 80}{space 3} 21.64462
{txt}{space 7}TAvg_subsidy_qty_w {c |}{col 27}{res}{space 2}-.0327334{col 39}{space 2} .0079061{col 50}{space 1}   -4.14{col 59}{space 3}0.000{col 67}{space 4}-.0482355{col 80}{space 3}-.0172313
{txt}{space 7}TAvg_dist_market_w {c |}{col 27}{res}{space 2}-.0430571{col 39}{space 2} .0079636{col 50}{space 1}   -5.41{col 59}{space 3}0.000{col 67}{space 4} -.058672{col 80}{space 3}-.0274422
{txt}{space 1}TAvg_real_maize_price_mr {c |}{col 27}{res}{space 2}-.0008168{col 39}{space 2} .0032784{col 50}{space 1}   -0.25{col 59}{space 3}0.803{col 67}{space 4}-.0072451{col 80}{space 3} .0056114
{txt}{space 2}TAvg_real_rice_price_mr {c |}{col 27}{res}{space 2} .0012261{col 39}{space 2} .0009842{col 50}{space 1}    1.25{col 59}{space 3}0.213{col 67}{space 4}-.0007036{col 80}{space 3} .0031558
{txt}{space 8}TAvg_land_holding {c |}{col 27}{res}{space 2}-.0071261{col 39}{space 2} .1369665{col 50}{space 1}   -0.05{col 59}{space 3}0.959{col 67}{space 4}-.2756865{col 80}{space 3} .2614343
{txt}{space 8}TAvg_real_hhvalue {c |}{col 27}{res}{space 2}  .003352{col 39}{space 2} .0011482{col 50}{space 1}    2.92{col 59}{space 3}0.004{col 67}{space 4} .0011007{col 80}{space 3} .0056033
{txt}{space 12}TAvg_org_fert {c |}{col 27}{res}{space 2} 2.469262{col 39}{space 2} .7684423{col 50}{space 1}    3.21{col 59}{space 3}0.001{col 67}{space 4} .9625197{col 80}{space 3} 3.976004
{txt}{space 10}TAvg_hh_headage {c |}{col 27}{res}{space 2}-.0359975{col 39}{space 2} .0289813{col 50}{space 1}   -1.24{col 59}{space 3}0.214{col 67}{space 4}-.0928234{col 80}{space 3} .0208283
{txt}{space 10}TAvg_attend_sch {c |}{col 27}{res}{space 2}-.5256252{col 39}{space 2} .6494411{col 50}{space 1}   -0.81{col 59}{space 3}0.418{col 67}{space 4}-1.799033{col 80}{space 3} .7477824
{txt}{space 13}TAvg_femhead {c |}{col 27}{res}{space 2} .5761562{col 39}{space 2} .8202632{col 50}{space 1}    0.70{col 59}{space 3}0.482{col 67}{space 4}-1.032195{col 80}{space 3} 2.184508
{txt}{space 13}TAvg_num_mem {c |}{col 27}{res}{space 2} .2158877{col 39}{space 2}  .098787{col 50}{space 1}    2.19{col 59}{space 3}0.029{col 67}{space 4} .0221887{col 80}{space 3} .4095867
{txt}{space 4}TAvg_annual_mean_temp {c |}{col 27}{res}{space 2} .0015816{col 39}{space 2} .1020503{col 50}{space 1}    0.02{col 59}{space 3}0.988{col 67}{space 4} -.198516{col 80}{space 3} .2016792
{txt}TAvg_annual_precipitation {c |}{col 27}{res}{space 2}-.0064419{col 39}{space 2} .0099008{col 50}{space 1}   -0.65{col 59}{space 3}0.515{col 67}{space 4}-.0258551{col 80}{space 3} .0129712
{txt}{space 22}imr {c |}{col 27}{res}{space 2} 1.019574{col 39}{space 2} 2.211619{col 50}{space 1}    0.46{col 59}{space 3}0.645{col 67}{space 4}-3.316912{col 80}{space 3}  5.35606
{txt}{space 25} {c |}
{space 21}year {c |}
{space 20}2012  {c |}{col 27}{res}{space 2} .7669984{col 39}{space 2}  .329601{col 50}{space 1}    2.33{col 59}{space 3}0.020{col 67}{space 4} .1207252{col 80}{space 3} 1.413272
{txt}{space 20}2015  {c |}{col 27}{res}{space 2} 2.457427{col 39}{space 2}  .849106{col 50}{space 1}    2.89{col 59}{space 3}0.004{col 67}{space 4} .7925214{col 80}{space 3} 4.122333
{txt}{space 20}2018  {c |}{col 27}{res}{space 2} 2.090811{col 39}{space 2} .5840279{col 50}{space 1}    3.58{col 59}{space 3}0.000{col 67}{space 4} .9456634{col 80}{space 3} 3.235958
{txt}{space 25} {c |}
{space 20}_cons {c |}{col 27}{res}{space 2}-69.21175{col 39}{space 2} 21.40516{col 50}{space 1}   -3.23{col 59}{space 3}0.001{col 67}{space 4}-111.1824{col 80}{space 3}-27.24106
{txt}{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}var(e.ltotal_qty_w){c |}{col 27}{res}{space 2} 14.12615{col 39}{space 2} .8278826{col 67}{space 4} 12.59265{col 80}{space 3} 15.84639
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. margins, predict(ystar(0,.)) dydx(*) post
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,960}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:E(ltotal_qty_w*|ltotal_qty_w>0), predict(ystar(0,.))}{p_end}
{p2col:dy/dx wrt:}{res:lyhat subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem annual_mean_temp annual_precipitation TAvg_ltotal_qty_w TAvg_lyhat TAvg_subsidy_qty_w TAvg_dist_market_w TAvg_real_maize_price_mr TAvg_real_rice_price_mr TAvg_land_holding TAvg_real_hhvalue TAvg_org_fert TAvg_hh_headage TAvg_attend_sch TAvg_femhead TAvg_num_mem TAvg_annual_mean_temp TAvg_annual_precipitation imr 2012.year 2015.year 2018.year}{p_end}
{p2colreset}{...}

{res}{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39} Delta-method
{col 27}{c |}      dy/dx{col 39}   std. err.{col 51}      z{col 59}   P>|z|{col 67}     [95% con{col 80}f. interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}lyhat {c |}{col 27}{res}{space 2}-2.310339{col 39}{space 2} .7609878{col 50}{space 1}   -3.04{col 59}{space 3}0.002{col 67}{space 4}-3.801848{col 80}{space 3}-.8188304
{txt}{space 12}subsidy_qty_w {c |}{col 27}{res}{space 2}-.0069585{col 39}{space 2} .0070214{col 50}{space 1}   -0.99{col 59}{space 3}0.322{col 67}{space 4}-.0207203{col 80}{space 3} .0068033
{txt}{space 12}dist_market_w {c |}{col 27}{res}{space 2} .0046332{col 39}{space 2} .0039717{col 50}{space 1}    1.17{col 59}{space 3}0.243{col 67}{space 4}-.0031512{col 80}{space 3} .0124177
{txt}{space 6}real_maize_price_mr {c |}{col 27}{res}{space 2}-.0004426{col 39}{space 2} .0004146{col 50}{space 1}   -1.07{col 59}{space 3}0.286{col 67}{space 4}-.0012551{col 80}{space 3}   .00037
{txt}{space 7}real_rice_price_mr {c |}{col 27}{res}{space 2}-.0000993{col 39}{space 2} .0001768{col 50}{space 1}   -0.56{col 59}{space 3}0.574{col 67}{space 4}-.0004458{col 80}{space 3} .0002472
{txt}{space 13}land_holding {c |}{col 27}{res}{space 2}-.0060408{col 39}{space 2} .0314304{col 50}{space 1}   -0.19{col 59}{space 3}0.848{col 67}{space 4}-.0676432{col 80}{space 3} .0555617
{txt}{space 13}real_hhvalue {c |}{col 27}{res}{space 2}-.0005364{col 39}{space 2} .0002522{col 50}{space 1}   -2.13{col 59}{space 3}0.033{col 67}{space 4}-.0010307{col 80}{space 3}-.0000421
{txt}{space 17}org_fert {c |}{col 27}{res}{space 2}-.2090608{col 39}{space 2} .2258804{col 50}{space 1}   -0.93{col 59}{space 3}0.355{col 67}{space 4}-.6517783{col 80}{space 3} .2336567
{txt}{space 15}hh_headage {c |}{col 27}{res}{space 2}-.0077375{col 39}{space 2} .0108513{col 50}{space 1}   -0.71{col 59}{space 3}0.476{col 67}{space 4}-.0290057{col 80}{space 3} .0135307
{txt}{space 15}attend_sch {c |}{col 27}{res}{space 2} .1771071{col 39}{space 2} .1364075{col 50}{space 1}    1.30{col 59}{space 3}0.194{col 67}{space 4}-.0902467{col 80}{space 3} .4444608
{txt}{space 18}femhead {c |}{col 27}{res}{space 2} -.310608{col 39}{space 2}  .220975{col 50}{space 1}   -1.41{col 59}{space 3}0.160{col 67}{space 4}-.7437111{col 80}{space 3} .1224951
{txt}{space 18}num_mem {c |}{col 27}{res}{space 2}-.0091753{col 39}{space 2} .0345344{col 50}{space 1}   -0.27{col 59}{space 3}0.790{col 67}{space 4}-.0768614{col 80}{space 3} .0585108
{txt}{space 9}annual_mean_temp {c |}{col 27}{res}{space 2} .0094271{col 39}{space 2} .0288674{col 50}{space 1}    0.33{col 59}{space 3}0.744{col 67}{space 4} -.047152{col 80}{space 3} .0660061
{txt}{space 5}annual_precipitation {c |}{col 27}{res}{space 2} .0013353{col 39}{space 2} .0028312{col 50}{space 1}    0.47{col 59}{space 3}0.637{col 67}{space 4}-.0042138{col 80}{space 3} .0068845
{txt}{space 8}TAvg_ltotal_qty_w {c |}{col 27}{res}{space 2} .7689996{col 39}{space 2} .0263455{col 50}{space 1}   29.19{col 59}{space 3}0.000{col 67}{space 4} .7173634{col 80}{space 3} .8206359
{txt}{space 15}TAvg_lyhat {c |}{col 27}{res}{space 2} 4.754998{col 39}{space 2} .7169393{col 50}{space 1}    6.63{col 59}{space 3}0.000{col 67}{space 4} 3.349822{col 80}{space 3} 6.160173
{txt}{space 7}TAvg_subsidy_qty_w {c |}{col 27}{res}{space 2}-.0093237{col 39}{space 2} .0022484{col 50}{space 1}   -4.15{col 59}{space 3}0.000{col 67}{space 4}-.0137306{col 80}{space 3}-.0049169
{txt}{space 7}TAvg_dist_market_w {c |}{col 27}{res}{space 2}-.0122643{col 39}{space 2} .0022621{col 50}{space 1}   -5.42{col 59}{space 3}0.000{col 67}{space 4} -.016698{col 80}{space 3}-.0078307
{txt}{space 1}TAvg_real_maize_price_mr {c |}{col 27}{res}{space 2}-.0002327{col 39}{space 2} .0009338{col 50}{space 1}   -0.25{col 59}{space 3}0.803{col 67}{space 4} -.002063{col 80}{space 3} .0015976
{txt}{space 2}TAvg_real_rice_price_mr {c |}{col 27}{res}{space 2} .0003492{col 39}{space 2} .0002803{col 50}{space 1}    1.25{col 59}{space 3}0.213{col 67}{space 4}-.0002002{col 80}{space 3} .0008986
{txt}{space 8}TAvg_land_holding {c |}{col 27}{res}{space 2}-.0020298{col 39}{space 2} .0390135{col 50}{space 1}   -0.05{col 59}{space 3}0.959{col 67}{space 4}-.0784948{col 80}{space 3} .0744353
{txt}{space 8}TAvg_real_hhvalue {c |}{col 27}{res}{space 2} .0009548{col 39}{space 2} .0003271{col 50}{space 1}    2.92{col 59}{space 3}0.004{col 67}{space 4} .0003137{col 80}{space 3} .0015959
{txt}{space 12}TAvg_org_fert {c |}{col 27}{res}{space 2} .7033417{col 39}{space 2} .2187667{col 50}{space 1}    3.22{col 59}{space 3}0.001{col 67}{space 4} .2745669{col 80}{space 3} 1.132117
{txt}{space 10}TAvg_hh_headage {c |}{col 27}{res}{space 2}-.0102535{col 39}{space 2} .0082538{col 50}{space 1}   -1.24{col 59}{space 3}0.214{col 67}{space 4}-.0264307{col 80}{space 3} .0059237
{txt}{space 10}TAvg_attend_sch {c |}{col 27}{res}{space 2}-.1497185{col 39}{space 2} .1849522{col 50}{space 1}   -0.81{col 59}{space 3}0.418{col 67}{space 4}-.5122181{col 80}{space 3} .2127811
{txt}{space 13}TAvg_femhead {c |}{col 27}{res}{space 2} .1641117{col 39}{space 2} .2336521{col 50}{space 1}    0.70{col 59}{space 3}0.482{col 67}{space 4} -.293838{col 80}{space 3} .6220614
{txt}{space 13}TAvg_num_mem {c |}{col 27}{res}{space 2} .0614932{col 39}{space 2} .0281186{col 50}{space 1}    2.19{col 59}{space 3}0.029{col 67}{space 4} .0063818{col 80}{space 3} .1166046
{txt}{space 4}TAvg_annual_mean_temp {c |}{col 27}{res}{space 2} .0004505{col 39}{space 2} .0290679{col 50}{space 1}    0.02{col 59}{space 3}0.988{col 67}{space 4}-.0565214{col 80}{space 3} .0574224
{txt}TAvg_annual_precipitation {c |}{col 27}{res}{space 2}-.0018349{col 39}{space 2} .0028197{col 50}{space 1}   -0.65{col 59}{space 3}0.515{col 67}{space 4}-.0073614{col 80}{space 3} .0036916
{txt}{space 22}imr {c |}{col 27}{res}{space 2} .2904144{col 39}{space 2} .6299756{col 50}{space 1}    0.46{col 59}{space 3}0.645{col 67}{space 4}-.9443151{col 80}{space 3} 1.525144
{txt}{space 25} {c |}
{space 21}year {c |}
{space 20}2012  {c |}{col 27}{res}{space 2} .1811446{col 39}{space 2} .0751808{col 50}{space 1}    2.41{col 59}{space 3}0.016{col 67}{space 4} .0337929{col 80}{space 3} .3284963
{txt}{space 20}2015  {c |}{col 27}{res}{space 2} .6938231{col 39}{space 2}   .25366{col 50}{space 1}    2.74{col 59}{space 3}0.006{col 67}{space 4} .1966587{col 80}{space 3} 1.190988
{txt}{space 20}2018  {c |}{col 27}{res}{space 2} .5683631{col 39}{space 2} .1541227{col 50}{space 1}    3.69{col 59}{space 3}0.000{col 67}{space 4} .2662882{col 80}{space 3}  .870438
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 91}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. restore
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD798_000000.tmp"
{txt}
{com}. heckman real_tpricefert_cens_mrk subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem annual_mean_temp annual_precipitation  i.year, select (commercial_dummy= subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem good_soil annual_mean_temp annual_precipitation  i.year) twostep
{txt}note: two-step estimate of rho = -1.0568175 is being truncated to -1
{res}
{txt}Heckman selection model -- two-step estimates   Number of obs     = {res}     2,960
{txt}(regression model with sample selection)              Selected    = {res}       777
                                                {txt}      Nonselected = {res}     2,183

                                                {txt}Wald chi2({res}16{txt})     =  {res}    35.18
                                                {txt}Prob > chi2       =     {res}0.0038

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      z{col 58}   P>|z|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}real_tpricefert_cens_mrk {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2} 4.383372{col 38}{space 2} 2.577179{col 49}{space 1}    1.70{col 58}{space 3}0.089{col 66}{space 4}-.6678066{col 79}{space 3} 9.434551
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2} 2.043118{col 38}{space 2} 1.313412{col 49}{space 1}    1.56{col 58}{space 3}0.120{col 66}{space 4}-.5311226{col 79}{space 3} 4.617358
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2} .0668259{col 38}{space 2} .2064399{col 49}{space 1}    0.32{col 58}{space 3}0.746{col 66}{space 4}-.3377888{col 79}{space 3} .4714406
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2}-.1503629{col 38}{space 2} .0579815{col 49}{space 1}   -2.59{col 58}{space 3}0.010{col 66}{space 4}-.2640046{col 79}{space 3}-.0367212
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2}-12.18674{col 38}{space 2} 11.00894{col 49}{space 1}   -1.11{col 58}{space 3}0.268{col 66}{space 4}-33.76388{col 79}{space 3} 9.390393
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0744861{col 38}{space 2} .0910245{col 49}{space 1}   -0.82{col 58}{space 3}0.413{col 66}{space 4}-.2528909{col 79}{space 3} .1039187
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2}-103.1924{col 38}{space 2}  81.6148{col 49}{space 1}   -1.26{col 58}{space 3}0.206{col 66}{space 4}-263.1545{col 79}{space 3} 56.76966
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2} 4.965553{col 38}{space 2} 3.162456{col 49}{space 1}    1.57{col 58}{space 3}0.116{col 66}{space 4}-1.232747{col 79}{space 3} 11.16385
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2}-3.845145{col 38}{space 2} 59.81195{col 49}{space 1}   -0.06{col 58}{space 3}0.949{col 66}{space 4}-121.0744{col 79}{space 3} 113.3841
{txt}{space 17}femhead {c |}{col 26}{res}{space 2} 75.35376{col 38}{space 2} 59.59061{col 49}{space 1}    1.26{col 58}{space 3}0.206{col 66}{space 4}-41.44168{col 79}{space 3} 192.1492
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2}-13.93238{col 38}{space 2} 9.269407{col 49}{space 1}   -1.50{col 58}{space 3}0.133{col 66}{space 4}-32.10008{col 79}{space 3} 4.235327
{txt}{space 8}annual_mean_temp {c |}{col 26}{res}{space 2}-1.092112{col 38}{space 2} 1.970986{col 49}{space 1}   -0.55{col 58}{space 3}0.580{col 66}{space 4}-4.955173{col 79}{space 3}  2.77095
{txt}{space 4}annual_precipitation {c |}{col 26}{res}{space 2} .1364843{col 38}{space 2}  .079681{col 49}{space 1}    1.71{col 58}{space 3}0.087{col 66}{space 4}-.0196875{col 79}{space 3} .2926561
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2} 35.36285{col 38}{space 2} 48.69977{col 49}{space 1}    0.73{col 58}{space 3}0.468{col 66}{space 4}-60.08694{col 79}{space 3} 130.8126
{txt}{space 19}2015  {c |}{col 26}{res}{space 2} 245.9871{col 38}{space 2} 52.45308{col 49}{space 1}    4.69{col 58}{space 3}0.000{col 66}{space 4}  143.181{col 79}{space 3} 348.7933
{txt}{space 19}2018  {c |}{col 26}{res}{space 2} 118.5209{col 38}{space 2} 60.09477{col 49}{space 1}    1.97{col 58}{space 3}0.049{col 66}{space 4} .7372896{col 79}{space 3} 236.3045
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} 606.5594{col 38}{space 2} 593.7617{col 49}{space 1}    1.02{col 58}{space 3}0.307{col 66}{space 4}-557.1921{col 79}{space 3} 1770.311
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}commercial_dummy         {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2}-.0098216{col 38}{space 2}  .001025{col 49}{space 1}   -9.58{col 58}{space 3}0.000{col 66}{space 4}-.0118305{col 79}{space 3}-.0078127
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2}-.0056932{col 38}{space 2} .0006696{col 49}{space 1}   -8.50{col 58}{space 3}0.000{col 66}{space 4}-.0070056{col 79}{space 3}-.0043807
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2}-.0000414{col 38}{space 2} .0003411{col 49}{space 1}   -0.12{col 58}{space 3}0.903{col 66}{space 4}-.0007099{col 79}{space 3} .0006271
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2}  .000089{col 38}{space 2} .0000941{col 49}{space 1}    0.95{col 58}{space 3}0.344{col 66}{space 4}-.0000954{col 79}{space 3} .0002734
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2} .0210019{col 38}{space 2} .0171303{col 49}{space 1}    1.23{col 58}{space 3}0.220{col 66}{space 4}-.0125729{col 79}{space 3} .0545767
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2} .0001042{col 38}{space 2} .0001506{col 49}{space 1}    0.69{col 58}{space 3}0.489{col 66}{space 4} -.000191{col 79}{space 3} .0003994
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2} .3219102{col 38}{space 2} .0788821{col 49}{space 1}    4.08{col 58}{space 3}0.000{col 66}{space 4} .1673042{col 79}{space 3} .4765162
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}-.0114316{col 38}{space 2} .0027819{col 49}{space 1}   -4.11{col 58}{space 3}0.000{col 66}{space 4}-.0168841{col 79}{space 3}-.0059791
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} .1153383{col 38}{space 2} .0903089{col 49}{space 1}    1.28{col 58}{space 3}0.202{col 66}{space 4}-.0616639{col 79}{space 3} .2923405
{txt}{space 17}femhead {c |}{col 26}{res}{space 2}-.1031959{col 38}{space 2} .0867285{col 49}{space 1}   -1.19{col 58}{space 3}0.234{col 66}{space 4}-.2731807{col 79}{space 3} .0667889
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2} .0366045{col 38}{space 2} .0079959{col 49}{space 1}    4.58{col 58}{space 3}0.000{col 66}{space 4} .0209329{col 79}{space 3} .0522761
{txt}{space 15}good_soil {c |}{col 26}{res}{space 2}  .206388{col 38}{space 2}  .090482{col 49}{space 1}    2.28{col 58}{space 3}0.023{col 66}{space 4} .0290466{col 79}{space 3} .3837294
{txt}{space 8}annual_mean_temp {c |}{col 26}{res}{space 2} .0018139{col 38}{space 2} .0033793{col 49}{space 1}    0.54{col 58}{space 3}0.591{col 66}{space 4}-.0048093{col 79}{space 3} .0084371
{txt}{space 4}annual_precipitation {c |}{col 26}{res}{space 2}-.0003172{col 38}{space 2} .0000638{col 49}{space 1}   -4.97{col 58}{space 3}0.000{col 66}{space 4}-.0004422{col 79}{space 3}-.0001922
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2}  .014725{col 38}{space 2} .0810456{col 49}{space 1}    0.18{col 58}{space 3}0.856{col 66}{space 4}-.1441213{col 79}{space 3} .1735714
{txt}{space 19}2015  {c |}{col 26}{res}{space 2}-.0199766{col 38}{space 2} .0867464{col 49}{space 1}   -0.23{col 58}{space 3}0.818{col 66}{space 4}-.1899965{col 79}{space 3} .1500432
{txt}{space 19}2018  {c |}{col 26}{res}{space 2}-.0207935{col 38}{space 2} .0981483{col 49}{space 1}   -0.21{col 58}{space 3}0.832{col 66}{space 4}-.2131606{col 79}{space 3} .1715736
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2}-.2049224{col 38}{space 2} .9264598{col 49}{space 1}   -0.22{col 58}{space 3}0.825{col 66}{space 4} -2.02075{col 79}{space 3} 1.610905
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/mills                   {txt}{c |}
{space 18}lambda {c |}{col 26}{res}{space 2}-571.5065{col 38}{space 2} 315.9719{col 49}{space 1}   -1.81{col 58}{space 3}0.070{col 66}{space 4}  -1190.8{col 79}{space 3} 47.78712
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                     rho {c |} {res}  -1.00000
                   {txt}sigma {c |} {res} 571.50649
{txt}{hline 25}{c BT}{hline 64}

{com}. predict yhat, xb
{txt}
{com}. predict imr, mills
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD798_000000.tmp"
{txt}
{com}. tabstat total_qty_w yhat [aweight = weight], statistics( mean median sd min max ) columns(statistics)

{txt}{ralign 12:Variable} {...}
{c |}      Mean       p50        SD       Min       Max
{hline 13}{c +}{hline 50}
{ralign 12:total_qty_w} {...}
{c |}{...}
 {res} 45.05122         0  118.0924         0      1000
{txt}{ralign 12:yhat} {...}
{c |}{...}
 {res} 978.4212  908.4522  462.8011  243.2095  4112.348
{txt}{hline 13}{c BT}{hline 50}

{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD798_000000.tmp"
{txt}
{com}.  preserve 
{txt}
{com}. heckman real_tpricefert_cens_mrk subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem  i.year, select (commercial_dummy= subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem good_soil  i.year) twostep
{txt}note: two-step estimate of rho = -1.0616514 is being truncated to -1
{res}
{txt}Heckman selection model -- two-step estimates   Number of obs     = {res}     2,960
{txt}(regression model with sample selection)              Selected    = {res}       777
                                                {txt}      Nonselected = {res}     2,183

                                                {txt}Wald chi2({res}14{txt})     =  {res}    32.74
                                                {txt}Prob > chi2       =     {res}0.0031

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      z{col 58}   P>|z|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}real_tpricefert_cens_mrk {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2} 4.373436{col 38}{space 2} 2.751364{col 49}{space 1}    1.59{col 58}{space 3}0.112{col 66}{space 4}-1.019138{col 79}{space 3} 9.766011
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2} 2.063591{col 38}{space 2} 1.418061{col 49}{space 1}    1.46{col 58}{space 3}0.146{col 66}{space 4}-.7157569{col 79}{space 3} 4.842939
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2} .0488846{col 38}{space 2} .2109908{col 49}{space 1}    0.23{col 58}{space 3}0.817{col 66}{space 4}-.3646499{col 79}{space 3}  .462419
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2}-.2270021{col 38}{space 2} .0814433{col 49}{space 1}   -2.79{col 58}{space 3}0.005{col 66}{space 4} -.386628{col 79}{space 3}-.0673761
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2}-17.93558{col 38}{space 2} 12.92684{col 49}{space 1}   -1.39{col 58}{space 3}0.165{col 66}{space 4}-43.27171{col 79}{space 3} 7.400557
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0197586{col 38}{space 2}  .088129{col 49}{space 1}   -0.22{col 58}{space 3}0.823{col 66}{space 4}-.1924883{col 79}{space 3}  .152971
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2}-144.6792{col 38}{space 2} 106.7724{col 49}{space 1}   -1.36{col 58}{space 3}0.175{col 66}{space 4}-353.9493{col 79}{space 3} 64.59099
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}  6.83863{col 38}{space 2} 4.225296{col 49}{space 1}    1.62{col 58}{space 3}0.106{col 66}{space 4}-1.442797{col 79}{space 3} 15.12006
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} 33.81684{col 38}{space 2} 54.51418{col 49}{space 1}    0.62{col 58}{space 3}0.535{col 66}{space 4}-73.02899{col 79}{space 3} 140.6627
{txt}{space 17}femhead {c |}{col 26}{res}{space 2} 129.6899{col 38}{space 2} 78.02021{col 49}{space 1}    1.66{col 58}{space 3}0.096{col 66}{space 4}-23.22686{col 79}{space 3} 282.6068
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2} -15.9813{col 38}{space 2} 10.88886{col 49}{space 1}   -1.47{col 58}{space 3}0.142{col 66}{space 4}-37.32308{col 79}{space 3} 5.360476
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2} 40.50388{col 38}{space 2} 49.73305{col 49}{space 1}    0.81{col 58}{space 3}0.415{col 66}{space 4} -56.9711{col 79}{space 3} 137.9789
{txt}{space 19}2015  {c |}{col 26}{res}{space 2} 271.5209{col 38}{space 2} 58.12423{col 49}{space 1}    4.67{col 58}{space 3}0.000{col 66}{space 4} 157.5995{col 79}{space 3} 385.4423
{txt}{space 19}2018  {c |}{col 26}{res}{space 2}  145.674{col 38}{space 2} 65.43834{col 49}{space 1}    2.23{col 58}{space 3}0.026{col 66}{space 4} 17.41719{col 79}{space 3} 273.9308
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} 415.1236{col 38}{space 2} 239.2162{col 49}{space 1}    1.74{col 58}{space 3}0.083{col 66}{space 4}-53.73155{col 79}{space 3} 883.9788
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}commercial_dummy         {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2}-.0094658{col 38}{space 2} .0010109{col 49}{space 1}   -9.36{col 58}{space 3}0.000{col 66}{space 4}-.0114471{col 79}{space 3}-.0074846
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2}-.0055035{col 38}{space 2} .0006675{col 49}{space 1}   -8.24{col 58}{space 3}0.000{col 66}{space 4}-.0068119{col 79}{space 3}-.0041952
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2}-9.28e-06{col 38}{space 2} .0003372{col 49}{space 1}   -0.03{col 58}{space 3}0.978{col 66}{space 4}-.0006701{col 79}{space 3} .0006516
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2} .0002573{col 38}{space 2} .0000867{col 49}{space 1}    2.97{col 58}{space 3}0.003{col 66}{space 4} .0000873{col 79}{space 3} .0004272
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2} .0343497{col 38}{space 2} .0167375{col 49}{space 1}    2.05{col 58}{space 3}0.040{col 66}{space 4} .0015449{col 79}{space 3} .0671545
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0000263{col 38}{space 2} .0001479{col 49}{space 1}   -0.18{col 58}{space 3}0.859{col 66}{space 4}-.0003162{col 79}{space 3} .0002636
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2} .4108063{col 38}{space 2} .0769551{col 49}{space 1}    5.34{col 58}{space 3}0.000{col 66}{space 4} .2599771{col 79}{space 3} .5616355
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}-.0151757{col 38}{space 2} .0026907{col 49}{space 1}   -5.64{col 58}{space 3}0.000{col 66}{space 4}-.0204494{col 79}{space 3} -.009902
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} .0237964{col 38}{space 2} .0880822{col 49}{space 1}    0.27{col 58}{space 3}0.787{col 66}{space 4}-.1488416{col 79}{space 3} .1964344
{txt}{space 17}femhead {c |}{col 26}{res}{space 2}-.2174742{col 38}{space 2} .0835343{col 49}{space 1}   -2.60{col 58}{space 3}0.009{col 66}{space 4}-.3811984{col 79}{space 3}-.0537499
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2}  .040345{col 38}{space 2} .0079508{col 49}{space 1}    5.07{col 58}{space 3}0.000{col 66}{space 4} .0247617{col 79}{space 3} .0559283
{txt}{space 15}good_soil {c |}{col 26}{res}{space 2} .1846169{col 38}{space 2} .0899343{col 49}{space 1}    2.05{col 58}{space 3}0.040{col 66}{space 4} .0083489{col 79}{space 3} .3608848
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2}  .002548{col 38}{space 2} .0803549{col 49}{space 1}    0.03{col 58}{space 3}0.975{col 66}{space 4}-.1549448{col 79}{space 3} .1600408
{txt}{space 19}2015  {c |}{col 26}{res}{space 2}-.0770665{col 38}{space 2} .0856007{col 49}{space 1}   -0.90{col 58}{space 3}0.368{col 66}{space 4}-.2448407{col 79}{space 3} .0907077
{txt}{space 19}2018  {c |}{col 26}{res}{space 2}-.0780696{col 38}{space 2} .0965461{col 49}{space 1}   -0.81{col 58}{space 3}0.419{col 66}{space 4}-.2672965{col 79}{space 3} .1111572
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} .0792183{col 38}{space 2} .2136186{col 49}{space 1}    0.37{col 58}{space 3}0.711{col 66}{space 4}-.3394663{col 79}{space 3}  .497903
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/mills                   {txt}{c |}
{space 18}lambda {c |}{col 26}{res}{space 2}-590.0043{col 38}{space 2} 349.6287{col 49}{space 1}   -1.69{col 58}{space 3}0.092{col 66}{space 4}-1275.264{col 79}{space 3}  95.2553
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                     rho {c |} {res}  -1.00000
                   {txt}sigma {c |} {res}  590.0043
{txt}{hline 25}{c BT}{hline 64}

{com}. predict yhat, xb
{err}variable {bf}yhat{sf} already defined
{txt}{search r(110), local:r(110);}

end of do-file

{search r(110), local:r(110);}

{com}. do "C:\Users\obine\AppData\Local\Temp\STD798_000000.tmp"
{txt}
{com}. use  "C:\Users\obine\Music\Documents\Project\codes\without_median\complete\Nominal_heckman.dta", clear
{txt}(Nigeria GHS-Panel Wave 1 PP Ag Section 11D - Fertilizer Acquisition)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD798_000000.tmp"
{txt}
{com}. tabstat total_qty_w subsidy_qty_w mrk_dist_w real_tpricefert_cens_mrk num_mem hh_headage real_hhvalue worker real_maize_price_mr real_rice_price_mr land_holding [aweight = weight], statistics( mean median sd min max ) columns(statistics)

{txt}{ralign 12:Variable} {...}
{c |}      Mean       p50        SD       Min       Max
{hline 13}{c +}{hline 50}
{ralign 12:total_qty_w} {...}
{c |}{...}
 {res} 45.05122         0  118.0924         0      1000
{txt}{ralign 12:subsidy_qt~w} {...}
{c |}{...}
 {res}  32.5475         0  104.1844         0       750
{txt}{ralign 12:mrk_dist_w} {...}
{c |}{...}
 {res} 6.490536         3  10.42416         0        50
{txt}{ralign 12:real_tpric~k} {...}
{c |}{...}
 {res} 39.15045         0  144.0206         0      2000
{txt}{ralign 12:num_mem} {...}
{c |}{...}
 {res}  7.32168         7   3.57727         1        34
{txt}{ralign 12:hh_headage} {...}
{c |}{...}
 {res} 57.24329        55  10.63282        25       100
{txt}{ralign 12:real_hhvalue} {...}
{c |}{...}
 {res} 92.07157      43.2  168.4036         0      2488
{txt}{ralign 12:worker} {...}
{c |}{...}
 {res} 3.274765         3  1.803255         0        12
{txt}{ralign 12:real_maize~r} {...}
{c |}{...}
 {res} 119.9143       100  87.83527       .04       900
{txt}{ralign 12:real_rice_~r} {...}
{c |}{...}
 {res} 422.2063       300  361.7363         5      1500
{txt}{ralign 12:land_holding} {...}
{c |}{...}
 {res} 1.230784    .64485   1.62508     .0005    9.6602
{txt}{hline 13}{c BT}{hline 50}

{com}. egen med_zone = median (zone)
{txt}
{com}. replace zone = med_zone if zone ==.
{txt}(228 real changes made)

{com}. misstable summarize total_qty_w subsidy_qty_w mrk_dist_w real_tpricefert_cens_mrk num_mem hh_headage real_hhvalue worker real_maize_price_mr real_rice_price_mr land_holding  subsidy_dummy femhead informal_save formal_credit informal_credit ext_acess attend_sch pry_edu finish_pry finish_sec safety_net net_seller net_buyer soil_qty_rev2 zone year plot_elevation plot_slope plot_wetness dist_market_w annual_mean_temp annual_precipitation org_fert
{txt}(variables nonmissing or string)

{com}. 
. 
. *replace hh_headage = 72 if hh_headage >72
. gen lland_holding = log(land_holding)
{txt}
{com}. gen lreal_hhvalue = log(real_hhvalue + 1)
{txt}
{com}. 
. 
. sum real_tpricefert_cens_mrk, detail

      {txt}price of commercial fertilizer purchased in naira
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      2,960
{txt}25%    {res}        0              0       {txt}Sum of wgt. {res}      2,960

{txt}50%    {res}        0                      {txt}Mean          {res} 41.87363
                        {txt}Largest       Std. dev.     {res} 153.7867
{txt}75%    {res}    28.75           2000
{txt}90%    {res}      128           2000       {txt}Variance      {res} 23650.36
{txt}95%    {res}      160           2000       {txt}Skewness      {res} 10.64166
{txt}99%    {res}      300           2000       {txt}Kurtosis      {res} 133.7607
{txt}
{com}. 
. gen good_soil = (soil_qty_rev2==1)
{txt}
{com}. gen fair_soil = (soil_qty_rev2==2)
{txt}
{com}. 
. 
. local time_avg "total_qty_w subsidy_qty_w mrk_dist_w real_tpricefert_cens_mrk num_mem hh_headage real_hhvalue worker real_maize_price_mr real_rice_price_mr land_holding  subsidy_dummy femhead informal_save formal_credit informal_credit ext_acess attend_sch pry_edu finish_pry finish_sec safety_net net_seller net_buyer soil_qty_rev2 lland_holding lreal_hhvalue plot_elevation plot_slope plot_wetness annual_mean_temp annual_precipitation org_fert dist_market_w formal_bank formal_save"
{txt}
{com}. 
. foreach x in `time_avg' {c -(}
{txt}  2{com}. 
.         bysort hhid : egen TAvg_`x' = mean(`x')
{txt}  3{com}. 
. {c )-}
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD798_000000.tmp"
{txt}
{com}.  preserve 
{txt}
{com}. heckman real_tpricefert_cens_mrk subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem  i.year, select (commercial_dummy= subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem good_soil  i.year) twostep
{txt}note: two-step estimate of rho = -1.0616514 is being truncated to -1
{res}
{txt}Heckman selection model -- two-step estimates   Number of obs     = {res}     2,960
{txt}(regression model with sample selection)              Selected    = {res}       777
                                                {txt}      Nonselected = {res}     2,183

                                                {txt}Wald chi2({res}14{txt})     =  {res}    32.74
                                                {txt}Prob > chi2       =     {res}0.0031

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      z{col 58}   P>|z|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}real_tpricefert_cens_mrk {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2} 4.373436{col 38}{space 2} 2.751364{col 49}{space 1}    1.59{col 58}{space 3}0.112{col 66}{space 4}-1.019138{col 79}{space 3} 9.766011
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2} 2.063591{col 38}{space 2} 1.418061{col 49}{space 1}    1.46{col 58}{space 3}0.146{col 66}{space 4}-.7157569{col 79}{space 3} 4.842939
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2} .0488846{col 38}{space 2} .2109908{col 49}{space 1}    0.23{col 58}{space 3}0.817{col 66}{space 4}-.3646499{col 79}{space 3}  .462419
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2}-.2270021{col 38}{space 2} .0814433{col 49}{space 1}   -2.79{col 58}{space 3}0.005{col 66}{space 4} -.386628{col 79}{space 3}-.0673761
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2}-17.93558{col 38}{space 2} 12.92684{col 49}{space 1}   -1.39{col 58}{space 3}0.165{col 66}{space 4}-43.27171{col 79}{space 3} 7.400557
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0197586{col 38}{space 2}  .088129{col 49}{space 1}   -0.22{col 58}{space 3}0.823{col 66}{space 4}-.1924883{col 79}{space 3}  .152971
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2}-144.6792{col 38}{space 2} 106.7724{col 49}{space 1}   -1.36{col 58}{space 3}0.175{col 66}{space 4}-353.9493{col 79}{space 3} 64.59099
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}  6.83863{col 38}{space 2} 4.225296{col 49}{space 1}    1.62{col 58}{space 3}0.106{col 66}{space 4}-1.442797{col 79}{space 3} 15.12006
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} 33.81684{col 38}{space 2} 54.51418{col 49}{space 1}    0.62{col 58}{space 3}0.535{col 66}{space 4}-73.02899{col 79}{space 3} 140.6627
{txt}{space 17}femhead {c |}{col 26}{res}{space 2} 129.6899{col 38}{space 2} 78.02021{col 49}{space 1}    1.66{col 58}{space 3}0.096{col 66}{space 4}-23.22686{col 79}{space 3} 282.6068
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2} -15.9813{col 38}{space 2} 10.88886{col 49}{space 1}   -1.47{col 58}{space 3}0.142{col 66}{space 4}-37.32308{col 79}{space 3} 5.360476
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2} 40.50388{col 38}{space 2} 49.73305{col 49}{space 1}    0.81{col 58}{space 3}0.415{col 66}{space 4} -56.9711{col 79}{space 3} 137.9789
{txt}{space 19}2015  {c |}{col 26}{res}{space 2} 271.5209{col 38}{space 2} 58.12423{col 49}{space 1}    4.67{col 58}{space 3}0.000{col 66}{space 4} 157.5995{col 79}{space 3} 385.4423
{txt}{space 19}2018  {c |}{col 26}{res}{space 2}  145.674{col 38}{space 2} 65.43834{col 49}{space 1}    2.23{col 58}{space 3}0.026{col 66}{space 4} 17.41719{col 79}{space 3} 273.9308
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} 415.1236{col 38}{space 2} 239.2162{col 49}{space 1}    1.74{col 58}{space 3}0.083{col 66}{space 4}-53.73155{col 79}{space 3} 883.9788
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}commercial_dummy         {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2}-.0094658{col 38}{space 2} .0010109{col 49}{space 1}   -9.36{col 58}{space 3}0.000{col 66}{space 4}-.0114471{col 79}{space 3}-.0074846
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2}-.0055035{col 38}{space 2} .0006675{col 49}{space 1}   -8.24{col 58}{space 3}0.000{col 66}{space 4}-.0068119{col 79}{space 3}-.0041952
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2}-9.28e-06{col 38}{space 2} .0003372{col 49}{space 1}   -0.03{col 58}{space 3}0.978{col 66}{space 4}-.0006701{col 79}{space 3} .0006516
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2} .0002573{col 38}{space 2} .0000867{col 49}{space 1}    2.97{col 58}{space 3}0.003{col 66}{space 4} .0000873{col 79}{space 3} .0004272
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2} .0343497{col 38}{space 2} .0167375{col 49}{space 1}    2.05{col 58}{space 3}0.040{col 66}{space 4} .0015449{col 79}{space 3} .0671545
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0000263{col 38}{space 2} .0001479{col 49}{space 1}   -0.18{col 58}{space 3}0.859{col 66}{space 4}-.0003162{col 79}{space 3} .0002636
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2} .4108063{col 38}{space 2} .0769551{col 49}{space 1}    5.34{col 58}{space 3}0.000{col 66}{space 4} .2599771{col 79}{space 3} .5616355
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}-.0151757{col 38}{space 2} .0026907{col 49}{space 1}   -5.64{col 58}{space 3}0.000{col 66}{space 4}-.0204494{col 79}{space 3} -.009902
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} .0237964{col 38}{space 2} .0880822{col 49}{space 1}    0.27{col 58}{space 3}0.787{col 66}{space 4}-.1488416{col 79}{space 3} .1964344
{txt}{space 17}femhead {c |}{col 26}{res}{space 2}-.2174742{col 38}{space 2} .0835343{col 49}{space 1}   -2.60{col 58}{space 3}0.009{col 66}{space 4}-.3811984{col 79}{space 3}-.0537499
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2}  .040345{col 38}{space 2} .0079508{col 49}{space 1}    5.07{col 58}{space 3}0.000{col 66}{space 4} .0247617{col 79}{space 3} .0559283
{txt}{space 15}good_soil {c |}{col 26}{res}{space 2} .1846169{col 38}{space 2} .0899343{col 49}{space 1}    2.05{col 58}{space 3}0.040{col 66}{space 4} .0083489{col 79}{space 3} .3608848
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2}  .002548{col 38}{space 2} .0803549{col 49}{space 1}    0.03{col 58}{space 3}0.975{col 66}{space 4}-.1549448{col 79}{space 3} .1600408
{txt}{space 19}2015  {c |}{col 26}{res}{space 2}-.0770665{col 38}{space 2} .0856007{col 49}{space 1}   -0.90{col 58}{space 3}0.368{col 66}{space 4}-.2448407{col 79}{space 3} .0907077
{txt}{space 19}2018  {c |}{col 26}{res}{space 2}-.0780696{col 38}{space 2} .0965461{col 49}{space 1}   -0.81{col 58}{space 3}0.419{col 66}{space 4}-.2672965{col 79}{space 3} .1111572
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} .0792183{col 38}{space 2} .2136186{col 49}{space 1}    0.37{col 58}{space 3}0.711{col 66}{space 4}-.3394663{col 79}{space 3}  .497903
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/mills                   {txt}{c |}
{space 18}lambda {c |}{col 26}{res}{space 2}-590.0043{col 38}{space 2} 349.6287{col 49}{space 1}   -1.69{col 58}{space 3}0.092{col 66}{space 4}-1275.264{col 79}{space 3}  95.2553
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                     rho {c |} {res}  -1.00000
                   {txt}sigma {c |} {res}  590.0043
{txt}{hline 25}{c BT}{hline 64}

{com}. predict yhat, xb
{txt}
{com}. predict imr, mills
{txt}
{com}. 
. gen lyhat = log(yhat)
{txt}
{com}. gen ltotal_qty_w = log(total_qty_w + 1)
{txt}
{com}. local time_avg "lyhat ltotal_qty_w"
{txt}
{com}. foreach x in `time_avg' {c -(}
{txt}  2{com}.         bysort hhid : egen TAvg_`x' = mean(`x')
{txt}  3{com}. {c )-}
{txt}
{com}. 
. ** CRE-TOBIT 
. tobit ltotal_qty_w lyhat subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem annual_mean_temp annual_precipitation  TAvg_ltotal_qty_w TAvg_lyhat TAvg_subsidy_qty_w TAvg_dist_market_w  TAvg_real_maize_price_mr TAvg_real_rice_price_mr TAvg_land_holding TAvg_real_hhvalue TAvg_org_fert TAvg_hh_headage TAvg_attend_sch TAvg_femhead TAvg_num_mem  TAvg_annual_mean_temp TAvg_annual_precipitation imr i.year, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 2}Log likelihood = {res:-4587.3763}

Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-4587.3763}  
Iteration 1:{space 2}Log likelihood = {res:-3282.3451}  
Iteration 2:{space 2}Log likelihood = {res: -2934.916}  
Iteration 3:{space 2}Log likelihood = {res:-2783.9222}  
Iteration 4:{space 2}Log likelihood = {res:-2770.5233}  
Iteration 5:{space 2}Log likelihood = {res:-2769.9385}  
Iteration 6:{space 2}Log likelihood = {res:-2769.9382}  
Iteration 7:{space 2}Log likelihood = {res:-2769.9382}  
{res}
{txt}{col 1}Tobit regression{col 52}{lalign 17:Number of obs}{col 69} = {res}{ralign 7:2,960}
{txt}{col 52}{ralign 17:Uncensored}{col 69} = {res}{ralign 7:777}
{txt}{col 1}Limits: Lower = {ralign 4:{res:0}}{col 52}{ralign 17:Left-censored}{col 69} = {res}{ralign 7:2,183}
{txt}{col 1}        Upper = {ralign 4:{txt:+inf}}{col 52}{ralign 17:   Right-censored}{col 69} = {res}{ralign 7:0}

{txt}{col 52}{lalign 17:LR chi2({res:33})}{col 69} = {res}{ralign 7:1547.35}
{txt}{col 52}{lalign 17:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-2769.9382}{txt}{col 52}{lalign 17:Pseudo R2}{col 69} = {res}{ralign 7:0.2183}

{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}             ltotal_qty_w{col 27}{c |} Coefficient{col 39}  Std. err.{col 51}      t{col 59}   P>|t|{col 67}     [95% con{col 80}f. interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}lyhat {c |}{col 27}{res}{space 2}-7.232562{col 39}{space 2} 2.668495{col 50}{space 1}   -2.71{col 59}{space 3}0.007{col 67}{space 4}-12.46488{col 80}{space 3}-2.000244
{txt}{space 12}subsidy_qty_w {c |}{col 27}{res}{space 2}-.0339042{col 39}{space 2} .0257526{col 50}{space 1}   -1.32{col 59}{space 3}0.188{col 67}{space 4}-.0843992{col 80}{space 3} .0165909
{txt}{space 12}dist_market_w {c |}{col 27}{res}{space 2} .0109596{col 39}{space 2} .0145495{col 50}{space 1}    0.75{col 59}{space 3}0.451{col 67}{space 4}-.0175688{col 80}{space 3} .0394879
{txt}{space 6}real_maize_price_mr {c |}{col 27}{res}{space 2}-.0017121{col 39}{space 2} .0014481{col 50}{space 1}   -1.18{col 59}{space 3}0.237{col 67}{space 4}-.0045514{col 80}{space 3} .0011272
{txt}{space 7}real_rice_price_mr {c |}{col 27}{res}{space 2}-.0006631{col 39}{space 2}  .001034{col 50}{space 1}   -0.64{col 59}{space 3}0.521{col 67}{space 4}-.0026905{col 80}{space 3} .0013642
{txt}{space 13}land_holding {c |}{col 27}{res}{space 2}-.0272225{col 39}{space 2} .1368349{col 50}{space 1}   -0.20{col 59}{space 3}0.842{col 67}{space 4}-.2955249{col 80}{space 3} .2410799
{txt}{space 13}real_hhvalue {c |}{col 27}{res}{space 2}-.0013108{col 39}{space 2} .0007876{col 50}{space 1}   -1.66{col 59}{space 3}0.096{col 67}{space 4}-.0028551{col 80}{space 3} .0002334
{txt}{space 17}org_fert {c |}{col 27}{res}{space 2}-.7057903{col 39}{space 2} 1.069928{col 50}{space 1}   -0.66{col 59}{space 3}0.510{col 67}{space 4}-2.803678{col 80}{space 3} 1.392097
{txt}{space 15}hh_headage {c |}{col 27}{res}{space 2}-.0290106{col 39}{space 2} .0486444{col 50}{space 1}   -0.60{col 59}{space 3}0.551{col 67}{space 4}-.1243913{col 80}{space 3} .0663701
{txt}{space 15}attend_sch {c |}{col 27}{res}{space 2} .9351423{col 39}{space 2} .4584224{col 50}{space 1}    2.04{col 59}{space 3}0.041{col 67}{space 4} .0362791{col 80}{space 3} 1.834005
{txt}{space 18}femhead {c |}{col 27}{res}{space 2}-.9149469{col 39}{space 2} .9681265{col 50}{space 1}   -0.95{col 59}{space 3}0.345{col 67}{space 4}-2.813225{col 80}{space 3} .9833311
{txt}{space 18}num_mem {c |}{col 27}{res}{space 2}-.0097903{col 39}{space 2} .1349745{col 50}{space 1}   -0.07{col 59}{space 3}0.942{col 67}{space 4} -.274445{col 80}{space 3} .2548644
{txt}{space 9}annual_mean_temp {c |}{col 27}{res}{space 2} .0301811{col 39}{space 2} .1005417{col 50}{space 1}    0.30{col 59}{space 3}0.764{col 67}{space 4}-.1669585{col 80}{space 3} .2273207
{txt}{space 5}annual_precipitation {c |}{col 27}{res}{space 2} .0041086{col 39}{space 2} .0099009{col 50}{space 1}    0.41{col 59}{space 3}0.678{col 67}{space 4}-.0153048{col 80}{space 3}  .023522
{txt}{space 8}TAvg_ltotal_qty_w {c |}{col 27}{res}{space 2} 2.699188{col 39}{space 2} .0992567{col 50}{space 1}   27.19{col 59}{space 3}0.000{col 67}{space 4} 2.504568{col 80}{space 3} 2.893808
{txt}{space 15}TAvg_lyhat {c |}{col 27}{res}{space 2} 16.79361{col 39}{space 2} 2.658382{col 50}{space 1}    6.32{col 59}{space 3}0.000{col 67}{space 4} 11.58112{col 80}{space 3}  22.0061
{txt}{space 7}TAvg_subsidy_qty_w {c |}{col 27}{res}{space 2}-.0316851{col 39}{space 2} .0080852{col 50}{space 1}   -3.92{col 59}{space 3}0.000{col 67}{space 4}-.0475385{col 80}{space 3}-.0158318
{txt}{space 7}TAvg_dist_market_w {c |}{col 27}{res}{space 2}-.0417902{col 39}{space 2} .0080011{col 50}{space 1}   -5.22{col 59}{space 3}0.000{col 67}{space 4}-.0574786{col 80}{space 3}-.0261019
{txt}{space 1}TAvg_real_maize_price_mr {c |}{col 27}{res}{space 2} -.000827{col 39}{space 2} .0032853{col 50}{space 1}   -0.25{col 59}{space 3}0.801{col 67}{space 4}-.0072687{col 80}{space 3} .0056147
{txt}{space 2}TAvg_real_rice_price_mr {c |}{col 27}{res}{space 2} .0026579{col 39}{space 2} .0011004{col 50}{space 1}    2.42{col 59}{space 3}0.016{col 67}{space 4} .0005004{col 80}{space 3} .0048154
{txt}{space 8}TAvg_land_holding {c |}{col 27}{res}{space 2} .1017054{col 39}{space 2} .1437045{col 50}{space 1}    0.71{col 59}{space 3}0.479{col 67}{space 4}-.1800667{col 80}{space 3} .3834775
{txt}{space 8}TAvg_real_hhvalue {c |}{col 27}{res}{space 2} .0021424{col 39}{space 2}  .001119{col 50}{space 1}    1.91{col 59}{space 3}0.056{col 67}{space 4}-.0000516{col 80}{space 3} .0043365
{txt}{space 12}TAvg_org_fert {c |}{col 27}{res}{space 2} 3.186377{col 39}{space 2} .8356669{col 50}{space 1}    3.81{col 59}{space 3}0.000{col 67}{space 4} 1.547823{col 80}{space 3} 4.824932
{txt}{space 10}TAvg_hh_headage {c |}{col 27}{res}{space 2}-.0668471{col 39}{space 2} .0319968{col 50}{space 1}   -2.09{col 59}{space 3}0.037{col 67}{space 4}-.1295857{col 80}{space 3}-.0041085
{txt}{space 10}TAvg_attend_sch {c |}{col 27}{res}{space 2}-1.315415{col 39}{space 2}  .663538{col 50}{space 1}   -1.98{col 59}{space 3}0.048{col 67}{space 4}-2.616464{col 80}{space 3}-.0143667
{txt}{space 13}TAvg_femhead {c |}{col 27}{res}{space 2}-.4065585{col 39}{space 2} .8728384{col 50}{space 1}   -0.47{col 59}{space 3}0.641{col 67}{space 4}-2.117998{col 80}{space 3} 1.304881
{txt}{space 13}TAvg_num_mem {c |}{col 27}{res}{space 2} .2516056{col 39}{space 2} .1024191{col 50}{space 1}    2.46{col 59}{space 3}0.014{col 67}{space 4} .0507848{col 80}{space 3} .4524263
{txt}{space 4}TAvg_annual_mean_temp {c |}{col 27}{res}{space 2}-.0096752{col 39}{space 2} .1011159{col 50}{space 1}   -0.10{col 59}{space 3}0.924{col 67}{space 4}-.2079407{col 80}{space 3} .1885904
{txt}TAvg_annual_precipitation {c |}{col 27}{res}{space 2} -.004322{col 39}{space 2} .0099074{col 50}{space 1}   -0.44{col 59}{space 3}0.663{col 67}{space 4}-.0237482{col 80}{space 3} .0151041
{txt}{space 22}imr {c |}{col 27}{res}{space 2} 1.685988{col 39}{space 2} 2.457555{col 50}{space 1}    0.69{col 59}{space 3}0.493{col 67}{space 4}-3.132724{col 80}{space 3} 6.504699
{txt}{space 25} {c |}
{space 21}year {c |}
{space 20}2012  {c |}{col 27}{res}{space 2} .7805294{col 39}{space 2} .3364142{col 50}{space 1}    2.32{col 59}{space 3}0.020{col 67}{space 4}  .120897{col 80}{space 3} 1.440162
{txt}{space 20}2015  {c |}{col 27}{res}{space 2} 2.289351{col 39}{space 2} .9571943{col 50}{space 1}    2.39{col 59}{space 3}0.017{col 67}{space 4} .4125089{col 80}{space 3} 4.166194
{txt}{space 20}2018  {c |}{col 27}{res}{space 2} 2.091276{col 39}{space 2} .6836002{col 50}{space 1}    3.06{col 59}{space 3}0.002{col 67}{space 4} .7508896{col 80}{space 3} 3.431662
{txt}{space 25} {c |}
{space 20}_cons {c |}{col 27}{res}{space 2}-73.45951{col 39}{space 2} 21.04215{col 50}{space 1}   -3.49{col 59}{space 3}0.000{col 67}{space 4}-114.7184{col 80}{space 3}-32.20059
{txt}{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}var(e.ltotal_qty_w){c |}{col 27}{res}{space 2} 14.15776{col 39}{space 2} .8298535{col 67}{space 4} 12.62063{col 80}{space 3} 15.88211
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. margins, predict(ystar(0,.)) dydx(*) post
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,960}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:E(ltotal_qty_w*|ltotal_qty_w>0), predict(ystar(0,.))}{p_end}
{p2col:dy/dx wrt:}{res:lyhat subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem annual_mean_temp annual_precipitation TAvg_ltotal_qty_w TAvg_lyhat TAvg_subsidy_qty_w TAvg_dist_market_w TAvg_real_maize_price_mr TAvg_real_rice_price_mr TAvg_land_holding TAvg_real_hhvalue TAvg_org_fert TAvg_hh_headage TAvg_attend_sch TAvg_femhead TAvg_num_mem TAvg_annual_mean_temp TAvg_annual_precipitation imr 2012.year 2015.year 2018.year}{p_end}
{p2colreset}{...}

{res}{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39} Delta-method
{col 27}{c |}      dy/dx{col 39}   std. err.{col 51}      z{col 59}   P>|z|{col 67}     [95% con{col 80}f. interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}lyhat {c |}{col 27}{res}{space 2}-2.059907{col 39}{space 2} .7588378{col 50}{space 1}   -2.71{col 59}{space 3}0.007{col 67}{space 4}-3.547202{col 80}{space 3}-.5726127
{txt}{space 12}subsidy_qty_w {c |}{col 27}{res}{space 2}-.0096562{col 39}{space 2} .0073364{col 50}{space 1}   -1.32{col 59}{space 3}0.188{col 67}{space 4}-.0240354{col 80}{space 3} .0047229
{txt}{space 12}dist_market_w {c |}{col 27}{res}{space 2} .0031214{col 39}{space 2} .0041429{col 50}{space 1}    0.75{col 59}{space 3}0.451{col 67}{space 4}-.0049986{col 80}{space 3} .0112414
{txt}{space 6}real_maize_price_mr {c |}{col 27}{res}{space 2}-.0004876{col 39}{space 2} .0004124{col 50}{space 1}   -1.18{col 59}{space 3}0.237{col 67}{space 4}-.0012959{col 80}{space 3} .0003207
{txt}{space 7}real_rice_price_mr {c |}{col 27}{res}{space 2}-.0001889{col 39}{space 2} .0002944{col 50}{space 1}   -0.64{col 59}{space 3}0.521{col 67}{space 4}-.0007659{col 80}{space 3} .0003882
{txt}{space 13}land_holding {c |}{col 27}{res}{space 2}-.0077532{col 39}{space 2} .0389698{col 50}{space 1}   -0.20{col 59}{space 3}0.842{col 67}{space 4}-.0841326{col 80}{space 3} .0686261
{txt}{space 13}real_hhvalue {c |}{col 27}{res}{space 2}-.0003733{col 39}{space 2} .0002243{col 50}{space 1}   -1.66{col 59}{space 3}0.096{col 67}{space 4} -.000813{col 80}{space 3} .0000663
{txt}{space 17}org_fert {c |}{col 27}{res}{space 2}-.2010163{col 39}{space 2}  .304672{col 50}{space 1}   -0.66{col 59}{space 3}0.509{col 67}{space 4}-.7981625{col 80}{space 3} .3961299
{txt}{space 15}hh_headage {c |}{col 27}{res}{space 2}-.0082625{col 39}{space 2} .0138562{col 50}{space 1}   -0.60{col 59}{space 3}0.551{col 67}{space 4}-.0354201{col 80}{space 3} .0188951
{txt}{space 15}attend_sch {c |}{col 27}{res}{space 2}  .266338{col 39}{space 2} .1304564{col 50}{space 1}    2.04{col 59}{space 3}0.041{col 67}{space 4} .0106483{col 80}{space 3} .5220278
{txt}{space 18}femhead {c |}{col 27}{res}{space 2}-.2605862{col 39}{space 2} .2758061{col 50}{space 1}   -0.94{col 59}{space 3}0.345{col 67}{space 4}-.8011562{col 80}{space 3} .2799838
{txt}{space 18}num_mem {c |}{col 27}{res}{space 2}-.0027884{col 39}{space 2} .0384411{col 50}{space 1}   -0.07{col 59}{space 3}0.942{col 67}{space 4}-.0781316{col 80}{space 3} .0725548
{txt}{space 9}annual_mean_temp {c |}{col 27}{res}{space 2} .0085959{col 39}{space 2} .0286356{col 50}{space 1}    0.30{col 59}{space 3}0.764{col 67}{space 4}-.0475289{col 80}{space 3} .0647207
{txt}{space 5}annual_precipitation {c |}{col 27}{res}{space 2} .0011702{col 39}{space 2} .0028196{col 50}{space 1}    0.42{col 59}{space 3}0.678{col 67}{space 4}-.0043561{col 80}{space 3} .0066965
{txt}{space 8}TAvg_ltotal_qty_w {c |}{col 27}{res}{space 2} .7687562{col 39}{space 2} .0263688{col 50}{space 1}   29.15{col 59}{space 3}0.000{col 67}{space 4} .7170744{col 80}{space 3} .8204381
{txt}{space 15}TAvg_lyhat {c |}{col 27}{res}{space 2} 4.782991{col 39}{space 2} .7550558{col 50}{space 1}    6.33{col 59}{space 3}0.000{col 67}{space 4} 3.303108{col 80}{space 3} 6.262873
{txt}{space 7}TAvg_subsidy_qty_w {c |}{col 27}{res}{space 2}-.0090242{col 39}{space 2} .0022997{col 50}{space 1}   -3.92{col 59}{space 3}0.000{col 67}{space 4}-.0135316{col 80}{space 3}-.0045169
{txt}{space 7}TAvg_dist_market_w {c |}{col 27}{res}{space 2}-.0119023{col 39}{space 2}  .002273{col 50}{space 1}   -5.24{col 59}{space 3}0.000{col 67}{space 4}-.0163572{col 80}{space 3}-.0074474
{txt}{space 1}TAvg_real_maize_price_mr {c |}{col 27}{res}{space 2}-.0002355{col 39}{space 2} .0009357{col 50}{space 1}   -0.25{col 59}{space 3}0.801{col 67}{space 4}-.0020695{col 80}{space 3} .0015984
{txt}{space 2}TAvg_real_rice_price_mr {c |}{col 27}{res}{space 2}  .000757{col 39}{space 2} .0003133{col 50}{space 1}    2.42{col 59}{space 3}0.016{col 67}{space 4}  .000143{col 80}{space 3}  .001371
{txt}{space 8}TAvg_land_holding {c |}{col 27}{res}{space 2} .0289667{col 39}{space 2} .0409255{col 50}{space 1}    0.71{col 59}{space 3}0.479{col 67}{space 4}-.0512458{col 80}{space 3} .1091792
{txt}{space 8}TAvg_real_hhvalue {c |}{col 27}{res}{space 2} .0006102{col 39}{space 2} .0003188{col 50}{space 1}    1.91{col 59}{space 3}0.056{col 67}{space 4}-.0000146{col 80}{space 3}  .001235
{txt}{space 12}TAvg_org_fert {c |}{col 27}{res}{space 2} .9075127{col 39}{space 2} .2378071{col 50}{space 1}    3.82{col 59}{space 3}0.000{col 67}{space 4} .4414193{col 80}{space 3} 1.373606
{txt}{space 10}TAvg_hh_headage {c |}{col 27}{res}{space 2}-.0190387{col 39}{space 2} .0091098{col 50}{space 1}   -2.09{col 59}{space 3}0.037{col 67}{space 4}-.0368937{col 80}{space 3}-.0011838
{txt}{space 10}TAvg_attend_sch {c |}{col 27}{res}{space 2}-.3746436{col 39}{space 2}  .188878{col 50}{space 1}   -1.98{col 59}{space 3}0.047{col 67}{space 4}-.7448377{col 80}{space 3}-.0044496
{txt}{space 13}TAvg_femhead {c |}{col 27}{res}{space 2} -.115792{col 39}{space 2} .2485794{col 50}{space 1}   -0.47{col 59}{space 3}0.641{col 67}{space 4}-.6029986{col 80}{space 3} .3714146
{txt}{space 13}TAvg_num_mem {c |}{col 27}{res}{space 2} .0716598{col 39}{space 2} .0291453{col 50}{space 1}    2.46{col 59}{space 3}0.014{col 67}{space 4}  .014536{col 80}{space 3} .1287836
{txt}{space 4}TAvg_annual_mean_temp {c |}{col 27}{res}{space 2}-.0027556{col 39}{space 2}  .028799{col 50}{space 1}   -0.10{col 59}{space 3}0.924{col 67}{space 4}-.0592006{col 80}{space 3} .0536895
{txt}TAvg_annual_precipitation {c |}{col 27}{res}{space 2} -.001231{col 39}{space 2} .0028214{col 50}{space 1}   -0.44{col 59}{space 3}0.663{col 67}{space 4}-.0067609{col 80}{space 3}  .004299
{txt}{space 22}imr {c |}{col 27}{res}{space 2} .4801864{col 39}{space 2} .6999661{col 50}{space 1}    0.69{col 59}{space 3}0.493{col 67}{space 4}-.8917219{col 80}{space 3} 1.852095
{txt}{space 25} {c |}
{space 21}year {c |}
{space 20}2012  {c |}{col 27}{res}{space 2} .1858122{col 39}{space 2} .0763037{col 50}{space 1}    2.44{col 59}{space 3}0.015{col 67}{space 4} .0362598{col 80}{space 3} .3353646
{txt}{space 20}2015  {c |}{col 27}{res}{space 2} .6393936{col 39}{space 2} .2798214{col 50}{space 1}    2.29{col 59}{space 3}0.022{col 67}{space 4} .0909537{col 80}{space 3} 1.187834
{txt}{space 20}2018  {c |}{col 27}{res}{space 2} .5722053{col 39}{space 2} .1815157{col 50}{space 1}    3.15{col 59}{space 3}0.002{col 67}{space 4} .2164411{col 80}{space 3} .9279696
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 91}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. restore
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD798_000000.tmp"
{txt}
{com}. heckman real_tpricefert_cens_mrk subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem  i.year, select (commercial_dummy= subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem good_soil  i.year) twostep
{txt}note: two-step estimate of rho = -1.0616514 is being truncated to -1
{res}
{txt}Heckman selection model -- two-step estimates   Number of obs     = {res}     2,960
{txt}(regression model with sample selection)              Selected    = {res}       777
                                                {txt}      Nonselected = {res}     2,183

                                                {txt}Wald chi2({res}14{txt})     =  {res}    32.74
                                                {txt}Prob > chi2       =     {res}0.0031

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      z{col 58}   P>|z|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}real_tpricefert_cens_mrk {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2} 4.373436{col 38}{space 2} 2.751364{col 49}{space 1}    1.59{col 58}{space 3}0.112{col 66}{space 4}-1.019138{col 79}{space 3} 9.766011
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2} 2.063591{col 38}{space 2} 1.418061{col 49}{space 1}    1.46{col 58}{space 3}0.146{col 66}{space 4}-.7157569{col 79}{space 3} 4.842939
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2} .0488846{col 38}{space 2} .2109908{col 49}{space 1}    0.23{col 58}{space 3}0.817{col 66}{space 4}-.3646499{col 79}{space 3}  .462419
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2}-.2270021{col 38}{space 2} .0814433{col 49}{space 1}   -2.79{col 58}{space 3}0.005{col 66}{space 4} -.386628{col 79}{space 3}-.0673761
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2}-17.93558{col 38}{space 2} 12.92684{col 49}{space 1}   -1.39{col 58}{space 3}0.165{col 66}{space 4}-43.27171{col 79}{space 3} 7.400557
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0197586{col 38}{space 2}  .088129{col 49}{space 1}   -0.22{col 58}{space 3}0.823{col 66}{space 4}-.1924883{col 79}{space 3}  .152971
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2}-144.6792{col 38}{space 2} 106.7724{col 49}{space 1}   -1.36{col 58}{space 3}0.175{col 66}{space 4}-353.9493{col 79}{space 3} 64.59099
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}  6.83863{col 38}{space 2} 4.225296{col 49}{space 1}    1.62{col 58}{space 3}0.106{col 66}{space 4}-1.442797{col 79}{space 3} 15.12006
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} 33.81684{col 38}{space 2} 54.51418{col 49}{space 1}    0.62{col 58}{space 3}0.535{col 66}{space 4}-73.02899{col 79}{space 3} 140.6627
{txt}{space 17}femhead {c |}{col 26}{res}{space 2} 129.6899{col 38}{space 2} 78.02021{col 49}{space 1}    1.66{col 58}{space 3}0.096{col 66}{space 4}-23.22686{col 79}{space 3} 282.6068
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2} -15.9813{col 38}{space 2} 10.88886{col 49}{space 1}   -1.47{col 58}{space 3}0.142{col 66}{space 4}-37.32308{col 79}{space 3} 5.360476
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2} 40.50388{col 38}{space 2} 49.73305{col 49}{space 1}    0.81{col 58}{space 3}0.415{col 66}{space 4} -56.9711{col 79}{space 3} 137.9789
{txt}{space 19}2015  {c |}{col 26}{res}{space 2} 271.5209{col 38}{space 2} 58.12423{col 49}{space 1}    4.67{col 58}{space 3}0.000{col 66}{space 4} 157.5995{col 79}{space 3} 385.4423
{txt}{space 19}2018  {c |}{col 26}{res}{space 2}  145.674{col 38}{space 2} 65.43834{col 49}{space 1}    2.23{col 58}{space 3}0.026{col 66}{space 4} 17.41719{col 79}{space 3} 273.9308
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} 415.1236{col 38}{space 2} 239.2162{col 49}{space 1}    1.74{col 58}{space 3}0.083{col 66}{space 4}-53.73155{col 79}{space 3} 883.9788
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}commercial_dummy         {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2}-.0094658{col 38}{space 2} .0010109{col 49}{space 1}   -9.36{col 58}{space 3}0.000{col 66}{space 4}-.0114471{col 79}{space 3}-.0074846
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2}-.0055035{col 38}{space 2} .0006675{col 49}{space 1}   -8.24{col 58}{space 3}0.000{col 66}{space 4}-.0068119{col 79}{space 3}-.0041952
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2}-9.28e-06{col 38}{space 2} .0003372{col 49}{space 1}   -0.03{col 58}{space 3}0.978{col 66}{space 4}-.0006701{col 79}{space 3} .0006516
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2} .0002573{col 38}{space 2} .0000867{col 49}{space 1}    2.97{col 58}{space 3}0.003{col 66}{space 4} .0000873{col 79}{space 3} .0004272
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2} .0343497{col 38}{space 2} .0167375{col 49}{space 1}    2.05{col 58}{space 3}0.040{col 66}{space 4} .0015449{col 79}{space 3} .0671545
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0000263{col 38}{space 2} .0001479{col 49}{space 1}   -0.18{col 58}{space 3}0.859{col 66}{space 4}-.0003162{col 79}{space 3} .0002636
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2} .4108063{col 38}{space 2} .0769551{col 49}{space 1}    5.34{col 58}{space 3}0.000{col 66}{space 4} .2599771{col 79}{space 3} .5616355
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}-.0151757{col 38}{space 2} .0026907{col 49}{space 1}   -5.64{col 58}{space 3}0.000{col 66}{space 4}-.0204494{col 79}{space 3} -.009902
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} .0237964{col 38}{space 2} .0880822{col 49}{space 1}    0.27{col 58}{space 3}0.787{col 66}{space 4}-.1488416{col 79}{space 3} .1964344
{txt}{space 17}femhead {c |}{col 26}{res}{space 2}-.2174742{col 38}{space 2} .0835343{col 49}{space 1}   -2.60{col 58}{space 3}0.009{col 66}{space 4}-.3811984{col 79}{space 3}-.0537499
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2}  .040345{col 38}{space 2} .0079508{col 49}{space 1}    5.07{col 58}{space 3}0.000{col 66}{space 4} .0247617{col 79}{space 3} .0559283
{txt}{space 15}good_soil {c |}{col 26}{res}{space 2} .1846169{col 38}{space 2} .0899343{col 49}{space 1}    2.05{col 58}{space 3}0.040{col 66}{space 4} .0083489{col 79}{space 3} .3608848
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2}  .002548{col 38}{space 2} .0803549{col 49}{space 1}    0.03{col 58}{space 3}0.975{col 66}{space 4}-.1549448{col 79}{space 3} .1600408
{txt}{space 19}2015  {c |}{col 26}{res}{space 2}-.0770665{col 38}{space 2} .0856007{col 49}{space 1}   -0.90{col 58}{space 3}0.368{col 66}{space 4}-.2448407{col 79}{space 3} .0907077
{txt}{space 19}2018  {c |}{col 26}{res}{space 2}-.0780696{col 38}{space 2} .0965461{col 49}{space 1}   -0.81{col 58}{space 3}0.419{col 66}{space 4}-.2672965{col 79}{space 3} .1111572
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} .0792183{col 38}{space 2} .2136186{col 49}{space 1}    0.37{col 58}{space 3}0.711{col 66}{space 4}-.3394663{col 79}{space 3}  .497903
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/mills                   {txt}{c |}
{space 18}lambda {c |}{col 26}{res}{space 2}-590.0043{col 38}{space 2} 349.6287{col 49}{space 1}   -1.69{col 58}{space 3}0.092{col 66}{space 4}-1275.264{col 79}{space 3}  95.2553
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                     rho {c |} {res}  -1.00000
                   {txt}sigma {c |} {res}  590.0043
{txt}{hline 25}{c BT}{hline 64}

{com}. predict yhat, xb
{txt}
{com}. predict imr, mills
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD798_000000.tmp"
{txt}
{com}. tabstat total_qty_w yhat [aweight = weight], statistics( mean median sd min max ) columns(statistics)

{txt}{ralign 12:Variable} {...}
{c |}      Mean       p50        SD       Min       Max
{hline 13}{c +}{hline 50}
{ralign 12:total_qty_w} {...}
{c |}{...}
 {res} 45.05122         0  118.0924         0      1000
{txt}{ralign 12:yhat} {...}
{c |}{...}
 {res} 999.9946  912.9205  463.9528  218.7105  4142.951
{txt}{hline 13}{c BT}{hline 50}

{com}. 
{txt}end of do-file

{com}. exit, clear
{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\obine\Music\Documents\Project\codes\Nigeria_log_file.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}11 Apr 2025, 19:48:09
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD1718_000000.tmp"
{txt}
{com}. use  "C:\Users\obine\Music\Documents\Project\codes\without_median\complete\Nominal_heckman.dta", clear
{txt}(Nigeria GHS-Panel Wave 1 PP Ag Section 11D - Fertilizer Acquisition)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD1718_000000.tmp"
{txt}
{com}. 
. tabstat total_qty_w subsidy_qty_w mrk_dist_w real_tpricefert_cens_mrk num_mem hh_headage real_hhvalue worker real_maize_price_mr real_rice_price_mr land_holding [aweight = weight], statistics( mean median sd min max ) columns(statistics)

{txt}{ralign 12:Variable} {...}
{c |}      Mean       p50        SD       Min       Max
{hline 13}{c +}{hline 50}
{ralign 12:total_qty_w} {...}
{c |}{...}
 {res} 45.05122         0  118.0924         0      1000
{txt}{ralign 12:subsidy_qt~w} {...}
{c |}{...}
 {res}  32.5475         0  104.1844         0       750
{txt}{ralign 12:mrk_dist_w} {...}
{c |}{...}
 {res} 6.490536         3  10.42416         0        50
{txt}{ralign 12:real_tpric~k} {...}
{c |}{...}
 {res} 39.15045         0  144.0206         0      2000
{txt}{ralign 12:num_mem} {...}
{c |}{...}
 {res}  7.32168         7   3.57727         1        34
{txt}{ralign 12:hh_headage} {...}
{c |}{...}
 {res} 57.24329        55  10.63282        25       100
{txt}{ralign 12:real_hhvalue} {...}
{c |}{...}
 {res} 92.07157      43.2  168.4036         0      2488
{txt}{ralign 12:worker} {...}
{c |}{...}
 {res} 3.274765         3  1.803255         0        12
{txt}{ralign 12:real_maize~r} {...}
{c |}{...}
 {res} 119.9143       100  87.83527       .04       900
{txt}{ralign 12:real_rice_~r} {...}
{c |}{...}
 {res} 422.2063       300  361.7363         5      1500
{txt}{ralign 12:land_holding} {...}
{c |}{...}
 {res} 1.230784    .64485   1.62508     .0005    9.6602
{txt}{hline 13}{c BT}{hline 50}

{com}. egen med_zone = median (zone)
{txt}
{com}. replace zone = med_zone if zone ==.
{txt}(228 real changes made)

{com}. misstable summarize total_qty_w subsidy_qty_w mrk_dist_w real_tpricefert_cens_mrk num_mem hh_headage real_hhvalue worker real_maize_price_mr real_rice_price_mr land_holding  subsidy_dummy femhead informal_save formal_credit informal_credit ext_acess attend_sch pry_edu finish_pry finish_sec safety_net net_seller net_buyer soil_qty_rev2 zone year plot_elevation plot_slope plot_wetness dist_market_w annual_mean_temp annual_precipitation org_fert
{txt}(variables nonmissing or string)

{com}. 
. 
. *replace hh_headage = 72 if hh_headage >72
. gen lland_holding = log(land_holding)
{txt}
{com}. gen lreal_hhvalue = log(real_hhvalue + 1)
{txt}
{com}. 
. 
. sum real_tpricefert_cens_mrk, detail

      {txt}price of commercial fertilizer purchased in naira
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      2,960
{txt}25%    {res}        0              0       {txt}Sum of wgt. {res}      2,960

{txt}50%    {res}        0                      {txt}Mean          {res} 41.87363
                        {txt}Largest       Std. dev.     {res} 153.7867
{txt}75%    {res}    28.75           2000
{txt}90%    {res}      128           2000       {txt}Variance      {res} 23650.36
{txt}95%    {res}      160           2000       {txt}Skewness      {res} 10.64166
{txt}99%    {res}      300           2000       {txt}Kurtosis      {res} 133.7607
{txt}
{com}. 
. gen good_soil = (soil_qty_rev2==1)
{txt}
{com}. gen fair_soil = (soil_qty_rev2==2)
{txt}
{com}. 
. 
. local time_avg "total_qty_w subsidy_qty_w mrk_dist_w real_tpricefert_cens_mrk num_mem hh_headage real_hhvalue worker real_maize_price_mr real_rice_price_mr land_holding  subsidy_dummy femhead informal_save formal_credit informal_credit ext_acess attend_sch pry_edu finish_pry finish_sec safety_net net_seller net_buyer soil_qty_rev2 lland_holding lreal_hhvalue plot_elevation plot_slope plot_wetness annual_mean_temp annual_precipitation org_fert dist_market_w formal_bank formal_save"
{txt}
{com}. 
. foreach x in `time_avg' {c -(}
{txt}  2{com}. 
.         bysort hhid : egen TAvg_`x' = mean(`x')
{txt}  3{com}. 
. {c )-}
{txt}
{com}. 
. 
. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD1718_000000.tmp"
{txt}
{com}.  preserve 
{txt}
{com}. heckman real_tpricefert_cens_mrk subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem  i.year, select (commercial_dummy= subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem good_soil  i.year) twostep
{txt}note: two-step estimate of rho = -1.0616514 is being truncated to -1
{res}
{txt}Heckman selection model -- two-step estimates   Number of obs     = {res}     2,960
{txt}(regression model with sample selection)              Selected    = {res}       777
                                                {txt}      Nonselected = {res}     2,183

                                                {txt}Wald chi2({res}14{txt})     =  {res}    32.74
                                                {txt}Prob > chi2       =     {res}0.0031

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      z{col 58}   P>|z|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}real_tpricefert_cens_mrk {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2} 4.373436{col 38}{space 2} 2.751364{col 49}{space 1}    1.59{col 58}{space 3}0.112{col 66}{space 4}-1.019138{col 79}{space 3} 9.766011
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2} 2.063591{col 38}{space 2} 1.418061{col 49}{space 1}    1.46{col 58}{space 3}0.146{col 66}{space 4}-.7157569{col 79}{space 3} 4.842939
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2} .0488846{col 38}{space 2} .2109908{col 49}{space 1}    0.23{col 58}{space 3}0.817{col 66}{space 4}-.3646499{col 79}{space 3}  .462419
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2}-.2270021{col 38}{space 2} .0814433{col 49}{space 1}   -2.79{col 58}{space 3}0.005{col 66}{space 4} -.386628{col 79}{space 3}-.0673761
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2}-17.93558{col 38}{space 2} 12.92684{col 49}{space 1}   -1.39{col 58}{space 3}0.165{col 66}{space 4}-43.27171{col 79}{space 3} 7.400557
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0197586{col 38}{space 2}  .088129{col 49}{space 1}   -0.22{col 58}{space 3}0.823{col 66}{space 4}-.1924883{col 79}{space 3}  .152971
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2}-144.6792{col 38}{space 2} 106.7724{col 49}{space 1}   -1.36{col 58}{space 3}0.175{col 66}{space 4}-353.9493{col 79}{space 3} 64.59099
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}  6.83863{col 38}{space 2} 4.225296{col 49}{space 1}    1.62{col 58}{space 3}0.106{col 66}{space 4}-1.442797{col 79}{space 3} 15.12006
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} 33.81684{col 38}{space 2} 54.51418{col 49}{space 1}    0.62{col 58}{space 3}0.535{col 66}{space 4}-73.02899{col 79}{space 3} 140.6627
{txt}{space 17}femhead {c |}{col 26}{res}{space 2} 129.6899{col 38}{space 2} 78.02021{col 49}{space 1}    1.66{col 58}{space 3}0.096{col 66}{space 4}-23.22686{col 79}{space 3} 282.6068
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2} -15.9813{col 38}{space 2} 10.88886{col 49}{space 1}   -1.47{col 58}{space 3}0.142{col 66}{space 4}-37.32308{col 79}{space 3} 5.360476
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2} 40.50388{col 38}{space 2} 49.73305{col 49}{space 1}    0.81{col 58}{space 3}0.415{col 66}{space 4} -56.9711{col 79}{space 3} 137.9789
{txt}{space 19}2015  {c |}{col 26}{res}{space 2} 271.5209{col 38}{space 2} 58.12423{col 49}{space 1}    4.67{col 58}{space 3}0.000{col 66}{space 4} 157.5995{col 79}{space 3} 385.4423
{txt}{space 19}2018  {c |}{col 26}{res}{space 2}  145.674{col 38}{space 2} 65.43834{col 49}{space 1}    2.23{col 58}{space 3}0.026{col 66}{space 4} 17.41719{col 79}{space 3} 273.9308
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} 415.1236{col 38}{space 2} 239.2162{col 49}{space 1}    1.74{col 58}{space 3}0.083{col 66}{space 4}-53.73155{col 79}{space 3} 883.9788
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}commercial_dummy         {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2}-.0094658{col 38}{space 2} .0010109{col 49}{space 1}   -9.36{col 58}{space 3}0.000{col 66}{space 4}-.0114471{col 79}{space 3}-.0074846
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2}-.0055035{col 38}{space 2} .0006675{col 49}{space 1}   -8.24{col 58}{space 3}0.000{col 66}{space 4}-.0068119{col 79}{space 3}-.0041952
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2}-9.28e-06{col 38}{space 2} .0003372{col 49}{space 1}   -0.03{col 58}{space 3}0.978{col 66}{space 4}-.0006701{col 79}{space 3} .0006516
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2} .0002573{col 38}{space 2} .0000867{col 49}{space 1}    2.97{col 58}{space 3}0.003{col 66}{space 4} .0000873{col 79}{space 3} .0004272
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2} .0343497{col 38}{space 2} .0167375{col 49}{space 1}    2.05{col 58}{space 3}0.040{col 66}{space 4} .0015449{col 79}{space 3} .0671545
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0000263{col 38}{space 2} .0001479{col 49}{space 1}   -0.18{col 58}{space 3}0.859{col 66}{space 4}-.0003162{col 79}{space 3} .0002636
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2} .4108063{col 38}{space 2} .0769551{col 49}{space 1}    5.34{col 58}{space 3}0.000{col 66}{space 4} .2599771{col 79}{space 3} .5616355
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}-.0151757{col 38}{space 2} .0026907{col 49}{space 1}   -5.64{col 58}{space 3}0.000{col 66}{space 4}-.0204494{col 79}{space 3} -.009902
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} .0237964{col 38}{space 2} .0880822{col 49}{space 1}    0.27{col 58}{space 3}0.787{col 66}{space 4}-.1488416{col 79}{space 3} .1964344
{txt}{space 17}femhead {c |}{col 26}{res}{space 2}-.2174742{col 38}{space 2} .0835343{col 49}{space 1}   -2.60{col 58}{space 3}0.009{col 66}{space 4}-.3811984{col 79}{space 3}-.0537499
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2}  .040345{col 38}{space 2} .0079508{col 49}{space 1}    5.07{col 58}{space 3}0.000{col 66}{space 4} .0247617{col 79}{space 3} .0559283
{txt}{space 15}good_soil {c |}{col 26}{res}{space 2} .1846169{col 38}{space 2} .0899343{col 49}{space 1}    2.05{col 58}{space 3}0.040{col 66}{space 4} .0083489{col 79}{space 3} .3608848
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2}  .002548{col 38}{space 2} .0803549{col 49}{space 1}    0.03{col 58}{space 3}0.975{col 66}{space 4}-.1549448{col 79}{space 3} .1600408
{txt}{space 19}2015  {c |}{col 26}{res}{space 2}-.0770665{col 38}{space 2} .0856007{col 49}{space 1}   -0.90{col 58}{space 3}0.368{col 66}{space 4}-.2448407{col 79}{space 3} .0907077
{txt}{space 19}2018  {c |}{col 26}{res}{space 2}-.0780696{col 38}{space 2} .0965461{col 49}{space 1}   -0.81{col 58}{space 3}0.419{col 66}{space 4}-.2672965{col 79}{space 3} .1111572
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} .0792183{col 38}{space 2} .2136186{col 49}{space 1}    0.37{col 58}{space 3}0.711{col 66}{space 4}-.3394663{col 79}{space 3}  .497903
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/mills                   {txt}{c |}
{space 18}lambda {c |}{col 26}{res}{space 2}-590.0043{col 38}{space 2} 349.6287{col 49}{space 1}   -1.69{col 58}{space 3}0.092{col 66}{space 4}-1275.264{col 79}{space 3}  95.2553
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                     rho {c |} {res}  -1.00000
                   {txt}sigma {c |} {res}  590.0043
{txt}{hline 25}{c BT}{hline 64}

{com}. predict yhat, xb
{txt}
{com}. predict imr, mills
{txt}
{com}. 
. ************winzonrizing fertilizer market price
. foreach v of varlist  yhat  {c -(}
{txt}  2{com}.         _pctile `v' [aw=weight] , p(1 95) 
{txt}  3{com}.         gen `v'_w=`v'
{txt}  4{com}.         *replace  `v'_w = r(r1) if  `v'_w < r(r1) &  `v'_w!=.
.         replace  `v'_w = r(r2) if  `v'_w > r(r2) &  `v'_w!=.
{txt}  5{com}.         local l`v' : var lab `v'
{txt}  6{com}.         lab var  `v'_w  "`l`v'' - Winzorized top & bottom 5%"
{txt}  7{com}. {c )-}
{txt}(135 real changes made)

{com}. 
. 
. gen lyhat = log(yhat_w)
{txt}
{com}. gen ltotal_qty_w = log(total_qty_w + 1)
{txt}
{com}. local time_avg "lyhat ltotal_qty_w"
{txt}
{com}. foreach x in `time_avg' {c -(}
{txt}  2{com}.         bysort hhid : egen TAvg_`x' = mean(`x')
{txt}  3{com}. {c )-}
{txt}
{com}. 
. ** CRE-TOBIT 
. tobit ltotal_qty_w lyhat subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem TAvg_ltotal_qty_w TAvg_lyhat TAvg_subsidy_qty_w TAvg_dist_market_w  TAvg_real_maize_price_mr TAvg_real_rice_price_mr TAvg_land_holding TAvg_real_hhvalue TAvg_org_fert TAvg_hh_headage TAvg_attend_sch TAvg_femhead TAvg_num_mem imr i.year, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 2}Log likelihood = {res:-4585.6797}

Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-4585.6797}  
Iteration 1:{space 2}Log likelihood = {res:-3282.1527}  
Iteration 2:{space 2}Log likelihood = {res:-2800.8782}  
Iteration 3:{space 2}Log likelihood = {res:  -2774.26}  
Iteration 4:{space 2}Log likelihood = {res:-2772.3864}  
Iteration 5:{space 2}Log likelihood = {res:-2772.3815}  
Iteration 6:{space 2}Log likelihood = {res:-2772.3815}  
{res}
{txt}{col 1}Tobit regression{col 52}{lalign 17:Number of obs}{col 69} = {res}{ralign 7:2,960}
{txt}{col 52}{ralign 17:Uncensored}{col 69} = {res}{ralign 7:777}
{txt}{col 1}Limits: Lower = {ralign 4:{res:0}}{col 52}{ralign 17:Left-censored}{col 69} = {res}{ralign 7:2,183}
{txt}{col 1}        Upper = {ralign 4:{txt:+inf}}{col 52}{ralign 17:   Right-censored}{col 69} = {res}{ralign 7:0}

{txt}{col 52}{lalign 17:LR chi2({res:29})}{col 69} = {res}{ralign 7:1542.47}
{txt}{col 52}{lalign 17:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-2772.3815}{txt}{col 52}{lalign 17:Pseudo R2}{col 69} = {res}{ralign 7:0.2176}

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            ltotal_qty_w{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 19}lyhat {c |}{col 26}{res}{space 2}-5.995979{col 38}{space 2} 2.426801{col 49}{space 1}   -2.47{col 58}{space 3}0.014{col 66}{space 4}-10.75439{col 79}{space 3}-1.237572
{txt}{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2}-.0364837{col 38}{space 2} .0246709{col 49}{space 1}   -1.48{col 58}{space 3}0.139{col 66}{space 4}-.0848577{col 79}{space 3} .0118903
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2} .0096637{col 38}{space 2} .0140122{col 49}{space 1}    0.69{col 58}{space 3}0.490{col 66}{space 4}-.0178111{col 79}{space 3} .0371384
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2}-.0017497{col 38}{space 2} .0014362{col 49}{space 1}   -1.22{col 58}{space 3}0.223{col 66}{space 4}-.0045658{col 79}{space 3} .0010664
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2}-.0004773{col 38}{space 2} .0009867{col 49}{space 1}   -0.48{col 58}{space 3}0.629{col 66}{space 4}-.0024119{col 79}{space 3} .0014574
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2}-.0103977{col 38}{space 2}  .133226{col 49}{space 1}   -0.08{col 58}{space 3}0.938{col 66}{space 4}-.2716237{col 79}{space 3} .2508283
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0012577{col 38}{space 2} .0007874{col 49}{space 1}   -1.60{col 58}{space 3}0.110{col 66}{space 4}-.0028015{col 79}{space 3} .0002862
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2}-.6060513{col 38}{space 2} 1.029087{col 49}{space 1}   -0.59{col 58}{space 3}0.556{col 66}{space 4}-2.623858{col 79}{space 3} 1.411755
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}-.0333751{col 38}{space 2} .0470532{col 49}{space 1}   -0.71{col 58}{space 3}0.478{col 66}{space 4}-.1256357{col 79}{space 3} .0588855
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} .8697866{col 38}{space 2} .4553865{col 49}{space 1}    1.91{col 58}{space 3}0.056{col 66}{space 4}-.0231232{col 79}{space 3} 1.762696
{txt}{space 17}femhead {c |}{col 26}{res}{space 2}-1.012588{col 38}{space 2} .9475578{col 49}{space 1}   -1.07{col 58}{space 3}0.285{col 66}{space 4}-2.870535{col 79}{space 3} .8453582
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2}  .000798{col 38}{space 2}  .131189{col 49}{space 1}    0.01{col 58}{space 3}0.995{col 66}{space 4}-.2564339{col 79}{space 3} .2580299
{txt}{space 7}TAvg_ltotal_qty_w {c |}{col 26}{res}{space 2} 2.702999{col 38}{space 2} .0986366{col 49}{space 1}   27.40{col 58}{space 3}0.000{col 66}{space 4} 2.509595{col 79}{space 3} 2.896403
{txt}{space 14}TAvg_lyhat {c |}{col 26}{res}{space 2}  11.3259{col 38}{space 2} 1.830725{col 49}{space 1}    6.19{col 58}{space 3}0.000{col 66}{space 4} 7.736267{col 79}{space 3} 14.91554
{txt}{space 6}TAvg_subsidy_qty_w {c |}{col 26}{res}{space 2}-.0064883{col 38}{space 2} .0043925{col 49}{space 1}   -1.48{col 58}{space 3}0.140{col 66}{space 4}-.0151011{col 79}{space 3} .0021244
{txt}{space 6}TAvg_dist_market_w {c |}{col 26}{res}{space 2}-.0274653{col 38}{space 2} .0065096{col 49}{space 1}   -4.22{col 58}{space 3}0.000{col 66}{space 4}-.0402292{col 79}{space 3}-.0147015
{txt}TAvg_real_maize_price_mr {c |}{col 26}{res}{space 2}-.0002916{col 38}{space 2} .0032349{col 49}{space 1}   -0.09{col 58}{space 3}0.928{col 66}{space 4}-.0066346{col 79}{space 3} .0060514
{txt}{space 1}TAvg_real_rice_price_mr {c |}{col 26}{res}{space 2} .0014925{col 38}{space 2}  .000839{col 49}{space 1}    1.78{col 58}{space 3}0.075{col 66}{space 4}-.0001526{col 79}{space 3} .0031375
{txt}{space 7}TAvg_land_holding {c |}{col 26}{res}{space 2}-.0186173{col 38}{space 2} .1341667{col 49}{space 1}   -0.14{col 58}{space 3}0.890{col 66}{space 4}-.2816878{col 79}{space 3} .2444533
{txt}{space 7}TAvg_real_hhvalue {c |}{col 26}{res}{space 2} .0017485{col 38}{space 2}  .001102{col 49}{space 1}    1.59{col 58}{space 3}0.113{col 66}{space 4}-.0004122{col 79}{space 3} .0039092
{txt}{space 11}TAvg_org_fert {c |}{col 26}{res}{space 2} 2.223853{col 38}{space 2} .7204188{col 49}{space 1}    3.09{col 58}{space 3}0.002{col 66}{space 4} .8112752{col 79}{space 3} 3.636432
{txt}{space 9}TAvg_hh_headage {c |}{col 26}{res}{space 2}-.0275526{col 38}{space 2} .0283793{col 49}{space 1}   -0.97{col 58}{space 3}0.332{col 66}{space 4}-.0831981{col 79}{space 3} .0280928
{txt}{space 9}TAvg_attend_sch {c |}{col 26}{res}{space 2} -1.14374{col 38}{space 2} .6493991{col 49}{space 1}   -1.76{col 58}{space 3}0.078{col 66}{space 4}-2.417064{col 79}{space 3} .1295851
{txt}{space 12}TAvg_femhead {c |}{col 26}{res}{space 2} .2695338{col 38}{space 2} .8266914{col 49}{space 1}    0.33{col 58}{space 3}0.744{col 66}{space 4}-1.351421{col 79}{space 3} 1.890489
{txt}{space 12}TAvg_num_mem {c |}{col 26}{res}{space 2} .1445987{col 38}{space 2} .0950059{col 49}{space 1}    1.52{col 58}{space 3}0.128{col 66}{space 4}-.0416864{col 79}{space 3} .3308837
{txt}{space 21}imr {c |}{col 26}{res}{space 2}  1.21226{col 38}{space 2} 2.423648{col 49}{space 1}    0.50{col 58}{space 3}0.617{col 66}{space 4}-3.539965{col 79}{space 3} 5.964484
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2} .7451872{col 38}{space 2} .3331626{col 49}{space 1}    2.24{col 58}{space 3}0.025{col 66}{space 4} .0919307{col 79}{space 3} 1.398444
{txt}{space 19}2015  {c |}{col 26}{res}{space 2} 1.987848{col 38}{space 2} .8920535{col 49}{space 1}    2.23{col 58}{space 3}0.026{col 66}{space 4}  .238733{col 79}{space 3} 3.736963
{txt}{space 19}2018  {c |}{col 26}{res}{space 2} 1.947489{col 38}{space 2} .6558736{col 49}{space 1}    2.97{col 58}{space 3}0.003{col 66}{space 4} .6614693{col 79}{space 3} 3.233509
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2}-40.89392{col 38}{space 2} 17.69151{col 49}{space 1}   -2.31{col 58}{space 3}0.021{col 66}{space 4}-75.58297{col 79}{space 3}-6.204865
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}var(e.ltotal_qty_w){c |}{col 26}{res}{space 2}  14.1669{col 38}{space 2} .8305535{col 66}{space 4} 12.62849{col 79}{space 3} 15.89272
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. margins, predict(ystar(0,.)) dydx(*) post
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,960}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:E(ltotal_qty_w*|ltotal_qty_w>0), predict(ystar(0,.))}{p_end}
{p2col:dy/dx wrt:}{res:lyhat subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem TAvg_ltotal_qty_w TAvg_lyhat TAvg_subsidy_qty_w TAvg_dist_market_w TAvg_real_maize_price_mr TAvg_real_rice_price_mr TAvg_land_holding TAvg_real_hhvalue TAvg_org_fert TAvg_hh_headage TAvg_attend_sch TAvg_femhead TAvg_num_mem imr 2012.year 2015.year 2018.year}{p_end}
{p2colreset}{...}

{res}{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38} Delta-method
{col 26}{c |}      dy/dx{col 38}   std. err.{col 50}      z{col 58}   P>|z|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 19}lyhat {c |}{col 26}{res}{space 2}-1.707781{col 38}{space 2} .6902438{col 49}{space 1}   -2.47{col 58}{space 3}0.013{col 66}{space 4}-3.060634{col 79}{space 3}-.3549283
{txt}{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2}-.0103913{col 38}{space 2} .0070286{col 49}{space 1}   -1.48{col 58}{space 3}0.139{col 66}{space 4}-.0241671{col 79}{space 3} .0033845
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2} .0027524{col 38}{space 2} .0039902{col 49}{space 1}    0.69{col 58}{space 3}0.490{col 66}{space 4}-.0050682{col 79}{space 3} .0105731
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2}-.0004983{col 38}{space 2} .0004091{col 49}{space 1}   -1.22{col 58}{space 3}0.223{col 66}{space 4}-.0013001{col 79}{space 3} .0003034
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2}-.0001359{col 38}{space 2}  .000281{col 49}{space 1}   -0.48{col 58}{space 3}0.629{col 66}{space 4}-.0006866{col 79}{space 3} .0004148
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2}-.0029615{col 38}{space 2} .0379448{col 49}{space 1}   -0.08{col 58}{space 3}0.938{col 66}{space 4}-.0773318{col 79}{space 3} .0714089
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0003582{col 38}{space 2} .0002243{col 49}{space 1}   -1.60{col 58}{space 3}0.110{col 66}{space 4}-.0007978{col 79}{space 3} .0000813
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2}-.1726162{col 38}{space 2}  .293059{col 49}{space 1}   -0.59{col 58}{space 3}0.556{col 66}{space 4}-.7470013{col 79}{space 3} .4017689
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}-.0095059{col 38}{space 2} .0134037{col 49}{space 1}   -0.71{col 58}{space 3}0.478{col 66}{space 4}-.0357766{col 79}{space 3} .0167648
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} .2477336{col 38}{space 2} .1296116{col 49}{space 1}    1.91{col 58}{space 3}0.056{col 66}{space 4}-.0063004{col 79}{space 3} .5017676
{txt}{space 17}femhead {c |}{col 26}{res}{space 2}-.2884065{col 38}{space 2} .2699646{col 49}{space 1}   -1.07{col 58}{space 3}0.285{col 66}{space 4}-.8175273{col 79}{space 3} .2407144
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2} .0002273{col 38}{space 2} .0373655{col 49}{space 1}    0.01{col 58}{space 3}0.995{col 66}{space 4}-.0730077{col 79}{space 3} .0734622
{txt}{space 7}TAvg_ltotal_qty_w {c |}{col 26}{res}{space 2} .7698712{col 38}{space 2} .0262162{col 49}{space 1}   29.37{col 58}{space 3}0.000{col 66}{space 4} .7184883{col 79}{space 3} .8212541
{txt}{space 14}TAvg_lyhat {c |}{col 26}{res}{space 2} 3.225857{col 38}{space 2} .5202141{col 49}{space 1}    6.20{col 58}{space 3}0.000{col 66}{space 4} 2.206256{col 79}{space 3} 4.245457
{txt}{space 6}TAvg_subsidy_qty_w {c |}{col 26}{res}{space 2} -.001848{col 38}{space 2} .0012507{col 49}{space 1}   -1.48{col 58}{space 3}0.140{col 66}{space 4}-.0042993{col 79}{space 3} .0006033
{txt}{space 6}TAvg_dist_market_w {c |}{col 26}{res}{space 2}-.0078227{col 38}{space 2} .0018504{col 49}{space 1}   -4.23{col 58}{space 3}0.000{col 66}{space 4}-.0114495{col 79}{space 3} -.004196
{txt}TAvg_real_maize_price_mr {c |}{col 26}{res}{space 2}-.0000831{col 38}{space 2} .0009214{col 49}{space 1}   -0.09{col 58}{space 3}0.928{col 66}{space 4}-.0018889{col 79}{space 3} .0017228
{txt}{space 1}TAvg_real_rice_price_mr {c |}{col 26}{res}{space 2} .0004251{col 38}{space 2}  .000239{col 49}{space 1}    1.78{col 58}{space 3}0.075{col 66}{space 4}-.0000433{col 79}{space 3} .0008935
{txt}{space 7}TAvg_land_holding {c |}{col 26}{res}{space 2}-.0053026{col 38}{space 2} .0382136{col 49}{space 1}   -0.14{col 58}{space 3}0.890{col 66}{space 4}-.0801998{col 79}{space 3} .0695946
{txt}{space 7}TAvg_real_hhvalue {c |}{col 26}{res}{space 2}  .000498{col 38}{space 2} .0003139{col 49}{space 1}    1.59{col 58}{space 3}0.113{col 66}{space 4}-.0001173{col 79}{space 3} .0011133
{txt}{space 11}TAvg_org_fert {c |}{col 26}{res}{space 2} .6334004{col 38}{space 2} .2051166{col 49}{space 1}    3.09{col 58}{space 3}0.002{col 66}{space 4} .2313792{col 79}{space 3} 1.035422
{txt}{space 9}TAvg_hh_headage {c |}{col 26}{res}{space 2}-.0078476{col 38}{space 2} .0080825{col 49}{space 1}   -0.97{col 58}{space 3}0.332{col 66}{space 4}-.0236889{col 79}{space 3} .0079938
{txt}{space 9}TAvg_attend_sch {c |}{col 26}{res}{space 2}-.3257611{col 38}{space 2} .1848888{col 49}{space 1}   -1.76{col 58}{space 3}0.078{col 66}{space 4}-.6881366{col 79}{space 3} .0366143
{txt}{space 12}TAvg_femhead {c |}{col 26}{res}{space 2} .0767689{col 38}{space 2} .2354633{col 49}{space 1}    0.33{col 58}{space 3}0.744{col 66}{space 4}-.3847307{col 79}{space 3} .5382685
{txt}{space 12}TAvg_num_mem {c |}{col 26}{res}{space 2} .0411847{col 38}{space 2} .0270482{col 49}{space 1}    1.52{col 58}{space 3}0.128{col 66}{space 4}-.0118288{col 79}{space 3} .0941983
{txt}{space 21}imr {c |}{col 26}{res}{space 2} .3452771{col 38}{space 2} .6903317{col 49}{space 1}    0.50{col 58}{space 3}0.617{col 66}{space 4}-1.007748{col 79}{space 3} 1.698302
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2}  .180821{col 38}{space 2}  .077494{col 49}{space 1}    2.33{col 58}{space 3}0.020{col 66}{space 4} .0289355{col 79}{space 3} .3327064
{txt}{space 19}2015  {c |}{col 26}{res}{space 2} .5500584{col 38}{space 2} .2558033{col 49}{space 1}    2.15{col 58}{space 3}0.032{col 66}{space 4} .0486932{col 79}{space 3} 1.051424
{txt}{space 19}2018  {c |}{col 26}{res}{space 2} .5366388{col 38}{space 2} .1758849{col 49}{space 1}    3.05{col 58}{space 3}0.002{col 66}{space 4} .1919107{col 79}{space 3}  .881367
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 90}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. restore
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD1718_000000.tmp"
{txt}
{com}. 
. capture program drop myboot     
{txt}
{com}. program define myboot, rclass
{txt}  1{com}. ** CRE-TOBIT
.  preserve 
{txt}  2{com}. heckman real_tpricefert_cens_mrk subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem  i.year, select (commercial_dummy= subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem good_soil  i.year) twostep
{txt}  3{com}. predict yhat, xb
{txt}  4{com}. predict imr, mills
{txt}  5{com}. 
. ************winzonrizing fertilizer market price
. foreach v of varlist  yhat  {c -(}
{txt}  6{com}.         _pctile `v' [aw=weight] , p(1 95) 
{txt}  7{com}.         gen `v'_w=`v'
{txt}  8{com}.         *replace  `v'_w = r(r1) if  `v'_w < r(r1) &  `v'_w!=.
.         replace  `v'_w = r(r2) if  `v'_w > r(r2) &  `v'_w!=.
{txt}  9{com}.         local l`v' : var lab `v'
{txt} 10{com}.         lab var  `v'_w  "`l`v'' - Winzorized top & bottom 5%"
{txt} 11{com}. {c )-}
{txt} 12{com}. 
. 
. gen lyhat = log(yhat_w)
{txt} 13{com}. gen ltotal_qty_w = log(total_qty_w + 1)
{txt} 14{com}. local time_avg "lyhat ltotal_qty_w"
{txt} 15{com}. foreach x in `time_avg' {c -(}
{txt} 16{com}.         bysort hhid : egen TAvg_`x' = mean(`x')
{txt} 17{com}. {c )-}
{txt} 18{com}. 
. ** CRE-TOBIT 
. tobit ltotal_qty_w lyhat subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem TAvg_ltotal_qty_w TAvg_lyhat TAvg_subsidy_qty_w TAvg_dist_market_w  TAvg_real_maize_price_mr TAvg_real_rice_price_mr TAvg_land_holding TAvg_real_hhvalue TAvg_org_fert TAvg_hh_headage TAvg_attend_sch TAvg_femhead TAvg_num_mem imr i.year, ll(0)
{txt} 19{com}. margins, predict(ystar(0,.)) dydx(*) post
{txt} 20{com}. restore
{txt} 21{com}. end
{txt}
{com}. bootstrap, reps(100) seed(123) cluster(hhid) idcluster(newid): myboot
{res}{txt}(running {bf:myboot} on estimation sample)

{p 0 9 2}
warning: {bf:myboot} does not set {bf:e(sample)}, so no 
observations will be excluded from the resampling because of 
missing values or other reasons. To exclude observations, press 
Break, save the data, drop any observations that are to be excluded, 
and rerun {bf:bootstrap}.{p_end}
{res}
{text}Bootstrap replications ({result:100}){text}: {res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}10{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}20{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}30{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}40{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}50{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}60{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}70{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}80{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}90{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}100{text} done
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,960}
{txt}{col 58}{lalign 13:Replications}{col 71} = {res}{ralign 5:100}

{txt}{ralign 90:(Replications based on {res:740} clusters in {res:hhid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}   Observed{col 38}   Bootstrap{col 66}         Norm{col 79}al-based
{col 26}{c |} coefficient{col 38}  std. err.{col 50}      z{col 58}   P>|z|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 19}lyhat {c |}{col 26}{res}{space 2}-1.707781{col 38}{space 2} .9547394{col 49}{space 1}   -1.79{col 58}{space 3}0.074{col 66}{space 4}-3.579036{col 79}{space 3} .1634735
{txt}{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2}-.0103913{col 38}{space 2} .0114778{col 49}{space 1}   -0.91{col 58}{space 3}0.365{col 66}{space 4}-.0328875{col 79}{space 3} .0121048
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2} .0027524{col 38}{space 2} .0055859{col 49}{space 1}    0.49{col 58}{space 3}0.622{col 66}{space 4}-.0081958{col 79}{space 3} .0137007
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2}-.0004983{col 38}{space 2} .0005815{col 49}{space 1}   -0.86{col 58}{space 3}0.391{col 66}{space 4} -.001638{col 79}{space 3} .0006413
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2}-.0001359{col 38}{space 2} .0004068{col 49}{space 1}   -0.33{col 58}{space 3}0.738{col 66}{space 4}-.0009333{col 79}{space 3} .0006615
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2}-.0029615{col 38}{space 2} .0545759{col 49}{space 1}   -0.05{col 58}{space 3}0.957{col 66}{space 4}-.1099284{col 79}{space 3} .1040054
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0003582{col 38}{space 2} .0003162{col 49}{space 1}   -1.13{col 58}{space 3}0.257{col 66}{space 4} -.000978{col 79}{space 3} .0002616
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2}-.1726162{col 38}{space 2} .4540211{col 49}{space 1}   -0.38{col 58}{space 3}0.704{col 66}{space 4}-1.062481{col 79}{space 3} .7172488
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}-.0095059{col 38}{space 2} .0176874{col 49}{space 1}   -0.54{col 58}{space 3}0.591{col 66}{space 4}-.0441726{col 79}{space 3} .0251607
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} .2477336{col 38}{space 2} .1520255{col 49}{space 1}    1.63{col 58}{space 3}0.103{col 66}{space 4}-.0502309{col 79}{space 3}  .545698
{txt}{space 17}femhead {c |}{col 26}{res}{space 2}-.2884065{col 38}{space 2} .3303192{col 49}{space 1}   -0.87{col 58}{space 3}0.383{col 66}{space 4}-.9358203{col 79}{space 3} .3590073
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2} .0002273{col 38}{space 2} .0563615{col 49}{space 1}    0.00{col 58}{space 3}0.997{col 66}{space 4}-.1102392{col 79}{space 3} .1106938
{txt}{space 7}TAvg_ltotal_qty_w {c |}{col 26}{res}{space 2} .7698712{col 38}{space 2} .0239178{col 49}{space 1}   32.19{col 58}{space 3}0.000{col 66}{space 4} .7229932{col 79}{space 3} .8167492
{txt}{space 14}TAvg_lyhat {c |}{col 26}{res}{space 2} 3.225857{col 38}{space 2} .5173542{col 49}{space 1}    6.24{col 58}{space 3}0.000{col 66}{space 4} 2.211861{col 79}{space 3} 4.239852
{txt}{space 6}TAvg_subsidy_qty_w {c |}{col 26}{res}{space 2} -.001848{col 38}{space 2} .0011557{col 49}{space 1}   -1.60{col 58}{space 3}0.110{col 66}{space 4}-.0041131{col 79}{space 3}  .000417
{txt}{space 6}TAvg_dist_market_w {c |}{col 26}{res}{space 2}-.0078227{col 38}{space 2} .0023527{col 49}{space 1}   -3.33{col 58}{space 3}0.001{col 66}{space 4}-.0124339{col 79}{space 3}-.0032115
{txt}TAvg_real_maize_price_mr {c |}{col 26}{res}{space 2}-.0000831{col 38}{space 2} .0008087{col 49}{space 1}   -0.10{col 58}{space 3}0.918{col 66}{space 4}-.0016681{col 79}{space 3}  .001502
{txt}{space 1}TAvg_real_rice_price_mr {c |}{col 26}{res}{space 2} .0004251{col 38}{space 2} .0002411{col 49}{space 1}    1.76{col 58}{space 3}0.078{col 66}{space 4}-.0000474{col 79}{space 3} .0008976
{txt}{space 7}TAvg_land_holding {c |}{col 26}{res}{space 2}-.0053026{col 38}{space 2} .0339823{col 49}{space 1}   -0.16{col 58}{space 3}0.876{col 66}{space 4}-.0719067{col 79}{space 3} .0613016
{txt}{space 7}TAvg_real_hhvalue {c |}{col 26}{res}{space 2}  .000498{col 38}{space 2} .0003702{col 49}{space 1}    1.35{col 58}{space 3}0.179{col 66}{space 4}-.0002276{col 79}{space 3} .0012236
{txt}{space 11}TAvg_org_fert {c |}{col 26}{res}{space 2} .6334004{col 38}{space 2} .1846045{col 49}{space 1}    3.43{col 58}{space 3}0.001{col 66}{space 4} .2715822{col 79}{space 3} .9952185
{txt}{space 9}TAvg_hh_headage {c |}{col 26}{res}{space 2}-.0078476{col 38}{space 2} .0077321{col 49}{space 1}   -1.01{col 58}{space 3}0.310{col 66}{space 4}-.0230022{col 79}{space 3}  .007307
{txt}{space 9}TAvg_attend_sch {c |}{col 26}{res}{space 2}-.3257611{col 38}{space 2} .1803195{col 49}{space 1}   -1.81{col 58}{space 3}0.071{col 66}{space 4}-.6791809{col 79}{space 3} .0276587
{txt}{space 12}TAvg_femhead {c |}{col 26}{res}{space 2} .0767689{col 38}{space 2} .2759618{col 49}{space 1}    0.28{col 58}{space 3}0.781{col 66}{space 4}-.4641062{col 79}{space 3}  .617644
{txt}{space 12}TAvg_num_mem {c |}{col 26}{res}{space 2} .0411847{col 38}{space 2} .0305177{col 49}{space 1}    1.35{col 58}{space 3}0.177{col 66}{space 4}-.0186288{col 79}{space 3} .1009983
{txt}{space 21}imr {c |}{col 26}{res}{space 2} .3452771{col 38}{space 2}  1.06558{col 49}{space 1}    0.32{col 58}{space 3}0.746{col 66}{space 4}-1.743222{col 79}{space 3} 2.433776
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2}  .180821{col 38}{space 2} .0957784{col 49}{space 1}    1.89{col 58}{space 3}0.059{col 66}{space 4}-.0069013{col 79}{space 3} .3685433
{txt}{space 19}2015  {c |}{col 26}{res}{space 2} .5500584{col 38}{space 2} .4031323{col 49}{space 1}    1.36{col 58}{space 3}0.172{col 66}{space 4}-.2400665{col 79}{space 3} 1.340183
{txt}{space 19}2018  {c |}{col 26}{res}{space 2} .5366388{col 38}{space 2} .2807287{col 49}{space 1}    1.91{col 58}{space 3}0.056{col 66}{space 4}-.0135792{col 79}{space 3} 1.086857
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. **************LEVEL
. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD1718_000000.tmp"
{txt}
{com}. 
. capture program drop myboot     
{txt}
{com}. program define myboot, rclass
{txt}  1{com}. ** CRE-TOBIT
.  preserve 
{txt}  2{com}. heckman real_tpricefert_cens_mrk subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem i.year, select (commercial_dummy= subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem good_soil  i.year) twostep
{txt}  3{com}. predict yhat, xb
{txt}  4{com}. predict imr, mills
{txt}  5{com}. 
. sum yhat, detail
{txt}  6{com}. 
. ************winzonrizing fertilizer market price
. foreach v of varlist  yhat  {c -(}
{txt}  7{com}.         _pctile `v' [aw=weight] , p(1 95) 
{txt}  8{com}.         gen `v'_w=`v'
{txt}  9{com}.         *replace  `v'_w = r(r1) if  `v'_w < r(r1) &  `v'_w!=.
.         replace  `v'_w = r(r2) if  `v'_w > r(r2) &  `v'_w!=.
{txt} 10{com}.         local l`v' : var lab `v'
{txt} 11{com}.         lab var  `v'_w  "`l`v'' - Winzorized top & bottom 5%"
{txt} 12{com}. {c )-}
{txt} 13{com}. 
. 
. local time_avg "yhat_w"
{txt} 14{com}. foreach x in `time_avg' {c -(}
{txt} 15{com}.         bysort hhid : egen TAvg_`x' = mean(`x')
{txt} 16{com}. {c )-}
{txt} 17{com}. ** CRE-TOBIT 
. tobit total_qty_w yhat_w subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem   TAvg_total_qty_w TAvg_yhat_w TAvg_subsidy_qty_w TAvg_dist_market_w  TAvg_real_maize_price_mr TAvg_real_rice_price_mr TAvg_land_holding TAvg_real_hhvalue TAvg_org_fert TAvg_hh_headage TAvg_attend_sch TAvg_femhead TAvg_num_mem  imr i.year, ll(0)
{txt} 18{com}. margins, predict(ystar(0,.)) dydx(*) post
{txt} 19{com}. restore
{txt} 20{com}. end
{txt}
{com}. bootstrap, reps(100) seed(123) cluster(hhid) idcluster(newid): myboot
{res}{txt}(running {bf:myboot} on estimation sample)

{p 0 9 2}
warning: {bf:myboot} does not set {bf:e(sample)}, so no 
observations will be excluded from the resampling because of 
missing values or other reasons. To exclude observations, press 
Break, save the data, drop any observations that are to be excluded, 
and rerun {bf:bootstrap}.{p_end}
{res}
{text}Bootstrap replications ({result:100}){text}: {res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}.{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}10{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}20{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}50{res}{text}{bf:x}{res}{text}.{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}.{res}{text}.{res}{text}60{res}{text}.{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}70{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}80{res}{text}.{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}{bf:x}{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}{bf:x}{res}{text}.{res}{text}100{text} done
{res}{text}{text:{bf:x}}: Error occurred when {bf:bootstrap} executed {bf:myboot}.
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,960}
{txt}{col 58}{lalign 13:Replications}{col 71} = {res}{ralign 5:59}

{txt}{ralign 90:(Replications based on {res:740} clusters in {res:hhid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}   Observed{col 38}   Bootstrap{col 66}         Norm{col 79}al-based
{col 26}{c |} coefficient{col 38}  std. err.{col 50}      z{col 58}   P>|z|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 18}yhat_w {c |}{col 26}{res}{space 2} -.116158{col 38}{space 2}  .263394{col 49}{space 1}   -0.44{col 58}{space 3}0.659{col 66}{space 4}-.6324008{col 79}{space 3} .4000847
{txt}{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2}-.0911175{col 38}{space 2} .6347028{col 49}{space 1}   -0.14{col 58}{space 3}0.886{col 66}{space 4}-1.335112{col 79}{space 3} 1.152877
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2} .2593069{col 38}{space 2} .2773758{col 49}{space 1}    0.93{col 58}{space 3}0.350{col 66}{space 4}-.2843397{col 79}{space 3} .8029535
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2}-.0296803{col 38}{space 2} .0333802{col 49}{space 1}   -0.89{col 58}{space 3}0.374{col 66}{space 4}-.0951043{col 79}{space 3} .0357436
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2}-.0233977{col 38}{space 2} .0444978{col 49}{space 1}   -0.53{col 58}{space 3}0.599{col 66}{space 4}-.1106118{col 79}{space 3} .0638164
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2} .9886934{col 38}{space 2} 3.195484{col 49}{space 1}    0.31{col 58}{space 3}0.757{col 66}{space 4}-5.274339{col 79}{space 3} 7.251726
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0246236{col 38}{space 2} .0123901{col 49}{space 1}   -1.99{col 58}{space 3}0.047{col 66}{space 4}-.0489078{col 79}{space 3}-.0003394
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2}-16.94695{col 38}{space 2}  22.7685{col 49}{space 1}   -0.74{col 58}{space 3}0.457{col 66}{space 4}-61.57238{col 79}{space 3} 27.67849
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2} .1108674{col 38}{space 2} 1.002164{col 49}{space 1}    0.11{col 58}{space 3}0.912{col 66}{space 4}-1.853338{col 79}{space 3} 2.075073
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} 6.987177{col 38}{space 2} 10.29253{col 49}{space 1}    0.68{col 58}{space 3}0.497{col 66}{space 4}-13.18581{col 79}{space 3} 27.16017
{txt}{space 17}femhead {c |}{col 26}{res}{space 2}-3.921903{col 38}{space 2} 32.40793{col 49}{space 1}   -0.12{col 58}{space 3}0.904{col 66}{space 4}-67.44029{col 79}{space 3} 59.59648
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2}-.0142706{col 38}{space 2} 3.257986{col 49}{space 1}   -0.00{col 58}{space 3}0.997{col 66}{space 4}-6.399806{col 79}{space 3} 6.371265
{txt}{space 8}TAvg_total_qty_w {c |}{col 26}{res}{space 2} .4992033{col 38}{space 2} .0236095{col 49}{space 1}   21.14{col 58}{space 3}0.000{col 66}{space 4} .4529295{col 79}{space 3} .5454772
{txt}{space 13}TAvg_yhat_w {c |}{col 26}{res}{space 2} .0971386{col 38}{space 2} .1205734{col 49}{space 1}    0.81{col 58}{space 3}0.420{col 66}{space 4}-.1391809{col 79}{space 3}  .333458
{txt}{space 6}TAvg_subsidy_qty_w {c |}{col 26}{res}{space 2}-.0545114{col 38}{space 2} .0585768{col 49}{space 1}   -0.93{col 58}{space 3}0.352{col 66}{space 4}-.1693199{col 79}{space 3} .0602971
{txt}{space 6}TAvg_dist_market_w {c |}{col 26}{res}{space 2}-.3668484{col 38}{space 2} .0976157{col 49}{space 1}   -3.76{col 58}{space 3}0.000{col 66}{space 4}-.5581716{col 79}{space 3}-.1755252
{txt}TAvg_real_maize_price_mr {c |}{col 26}{res}{space 2} .0283287{col 38}{space 2} .0345284{col 49}{space 1}    0.82{col 58}{space 3}0.412{col 66}{space 4}-.0393458{col 79}{space 3} .0960032
{txt}{space 1}TAvg_real_rice_price_mr {c |}{col 26}{res}{space 2} .0153083{col 38}{space 2} .0184614{col 49}{space 1}    0.83{col 58}{space 3}0.407{col 66}{space 4}-.0208753{col 79}{space 3} .0514919
{txt}{space 7}TAvg_land_holding {c |}{col 26}{res}{space 2} -2.25412{col 38}{space 2} 2.451746{col 49}{space 1}   -0.92{col 58}{space 3}0.358{col 66}{space 4}-7.059454{col 79}{space 3} 2.551214
{txt}{space 7}TAvg_real_hhvalue {c |}{col 26}{res}{space 2} .0237329{col 38}{space 2} .0158904{col 49}{space 1}    1.49{col 58}{space 3}0.135{col 66}{space 4}-.0074117{col 79}{space 3} .0548775
{txt}{space 11}TAvg_org_fert {c |}{col 26}{res}{space 2} 23.99858{col 38}{space 2} 7.739708{col 49}{space 1}    3.10{col 58}{space 3}0.002{col 66}{space 4} 8.829034{col 79}{space 3} 39.16813
{txt}{space 9}TAvg_hh_headage {c |}{col 26}{res}{space 2}-.2807688{col 38}{space 2} .4139806{col 49}{space 1}   -0.68{col 58}{space 3}0.498{col 66}{space 4}-1.092156{col 79}{space 3} .5306182
{txt}{space 9}TAvg_attend_sch {c |}{col 26}{res}{space 2}-9.200434{col 38}{space 2} 8.565505{col 49}{space 1}   -1.07{col 58}{space 3}0.283{col 66}{space 4}-25.98852{col 79}{space 3} 7.587648
{txt}{space 12}TAvg_femhead {c |}{col 26}{res}{space 2} 5.769606{col 38}{space 2} 11.37284{col 49}{space 1}    0.51{col 58}{space 3}0.612{col 66}{space 4}-16.52075{col 79}{space 3} 28.05996
{txt}{space 12}TAvg_num_mem {c |}{col 26}{res}{space 2}-.0633971{col 38}{space 2} 1.327868{col 49}{space 1}   -0.05{col 58}{space 3}0.962{col 66}{space 4} -2.66597{col 79}{space 3} 2.539176
{txt}{space 21}imr {c |}{col 26}{res}{space 2}-5.304331{col 38}{space 2} 34.54375{col 49}{space 1}   -0.15{col 58}{space 3}0.878{col 66}{space 4}-73.00884{col 79}{space 3} 62.40018
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2} 14.34782{col 38}{space 2} 5.966767{col 49}{space 1}    2.40{col 58}{space 3}0.016{col 66}{space 4} 2.653175{col 79}{space 3} 26.04247
{txt}{space 19}2015  {c |}{col 26}{res}{space 2} 33.98074{col 38}{space 2} 70.50309{col 49}{space 1}    0.48{col 58}{space 3}0.630{col 66}{space 4}-104.2028{col 79}{space 3} 172.1643
{txt}{space 19}2018  {c |}{col 26}{res}{space 2} 29.67095{col 38}{space 2} 48.87096{col 49}{space 1}    0.61{col 58}{space 3}0.544{col 66}{space 4}-66.11437{col 79}{space 3} 125.4563
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 79}Note: One or more parameters could not be estimated in 41 bootstrap replicates; standard-error estimates include only complete replications.{p_end}

{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD1718_000000.tmp"
{txt}
{com}. heckman real_tpricefert_cens_mrk subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem i.year, select (commercial_dummy= subsidy_qty_w dist_market_w real_maize_price_mr real_rice_price_mr land_holding real_hhvalue org_fert hh_headage attend_sch femhead num_mem good_soil  i.year) twostep
{txt}note: two-step estimate of rho = -1.0616514 is being truncated to -1
{res}
{txt}Heckman selection model -- two-step estimates   Number of obs     = {res}     2,960
{txt}(regression model with sample selection)              Selected    = {res}       777
                                                {txt}      Nonselected = {res}     2,183

                                                {txt}Wald chi2({res}14{txt})     =  {res}    32.74
                                                {txt}Prob > chi2       =     {res}0.0031

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      z{col 58}   P>|z|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}real_tpricefert_cens_mrk {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2} 4.373436{col 38}{space 2} 2.751364{col 49}{space 1}    1.59{col 58}{space 3}0.112{col 66}{space 4}-1.019138{col 79}{space 3} 9.766011
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2} 2.063591{col 38}{space 2} 1.418061{col 49}{space 1}    1.46{col 58}{space 3}0.146{col 66}{space 4}-.7157569{col 79}{space 3} 4.842939
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2} .0488846{col 38}{space 2} .2109908{col 49}{space 1}    0.23{col 58}{space 3}0.817{col 66}{space 4}-.3646499{col 79}{space 3}  .462419
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2}-.2270021{col 38}{space 2} .0814433{col 49}{space 1}   -2.79{col 58}{space 3}0.005{col 66}{space 4} -.386628{col 79}{space 3}-.0673761
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2}-17.93558{col 38}{space 2} 12.92684{col 49}{space 1}   -1.39{col 58}{space 3}0.165{col 66}{space 4}-43.27171{col 79}{space 3} 7.400557
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0197586{col 38}{space 2}  .088129{col 49}{space 1}   -0.22{col 58}{space 3}0.823{col 66}{space 4}-.1924883{col 79}{space 3}  .152971
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2}-144.6792{col 38}{space 2} 106.7724{col 49}{space 1}   -1.36{col 58}{space 3}0.175{col 66}{space 4}-353.9493{col 79}{space 3} 64.59099
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}  6.83863{col 38}{space 2} 4.225296{col 49}{space 1}    1.62{col 58}{space 3}0.106{col 66}{space 4}-1.442797{col 79}{space 3} 15.12006
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} 33.81684{col 38}{space 2} 54.51418{col 49}{space 1}    0.62{col 58}{space 3}0.535{col 66}{space 4}-73.02899{col 79}{space 3} 140.6627
{txt}{space 17}femhead {c |}{col 26}{res}{space 2} 129.6899{col 38}{space 2} 78.02021{col 49}{space 1}    1.66{col 58}{space 3}0.096{col 66}{space 4}-23.22686{col 79}{space 3} 282.6068
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2} -15.9813{col 38}{space 2} 10.88886{col 49}{space 1}   -1.47{col 58}{space 3}0.142{col 66}{space 4}-37.32308{col 79}{space 3} 5.360476
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2} 40.50388{col 38}{space 2} 49.73305{col 49}{space 1}    0.81{col 58}{space 3}0.415{col 66}{space 4} -56.9711{col 79}{space 3} 137.9789
{txt}{space 19}2015  {c |}{col 26}{res}{space 2} 271.5209{col 38}{space 2} 58.12423{col 49}{space 1}    4.67{col 58}{space 3}0.000{col 66}{space 4} 157.5995{col 79}{space 3} 385.4423
{txt}{space 19}2018  {c |}{col 26}{res}{space 2}  145.674{col 38}{space 2} 65.43834{col 49}{space 1}    2.23{col 58}{space 3}0.026{col 66}{space 4} 17.41719{col 79}{space 3} 273.9308
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} 415.1236{col 38}{space 2} 239.2162{col 49}{space 1}    1.74{col 58}{space 3}0.083{col 66}{space 4}-53.73155{col 79}{space 3} 883.9788
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}commercial_dummy         {txt}{c |}
{space 11}subsidy_qty_w {c |}{col 26}{res}{space 2}-.0094658{col 38}{space 2} .0010109{col 49}{space 1}   -9.36{col 58}{space 3}0.000{col 66}{space 4}-.0114471{col 79}{space 3}-.0074846
{txt}{space 11}dist_market_w {c |}{col 26}{res}{space 2}-.0055035{col 38}{space 2} .0006675{col 49}{space 1}   -8.24{col 58}{space 3}0.000{col 66}{space 4}-.0068119{col 79}{space 3}-.0041952
{txt}{space 5}real_maize_price_mr {c |}{col 26}{res}{space 2}-9.28e-06{col 38}{space 2} .0003372{col 49}{space 1}   -0.03{col 58}{space 3}0.978{col 66}{space 4}-.0006701{col 79}{space 3} .0006516
{txt}{space 6}real_rice_price_mr {c |}{col 26}{res}{space 2} .0002573{col 38}{space 2} .0000867{col 49}{space 1}    2.97{col 58}{space 3}0.003{col 66}{space 4} .0000873{col 79}{space 3} .0004272
{txt}{space 12}land_holding {c |}{col 26}{res}{space 2} .0343497{col 38}{space 2} .0167375{col 49}{space 1}    2.05{col 58}{space 3}0.040{col 66}{space 4} .0015449{col 79}{space 3} .0671545
{txt}{space 12}real_hhvalue {c |}{col 26}{res}{space 2}-.0000263{col 38}{space 2} .0001479{col 49}{space 1}   -0.18{col 58}{space 3}0.859{col 66}{space 4}-.0003162{col 79}{space 3} .0002636
{txt}{space 16}org_fert {c |}{col 26}{res}{space 2} .4108063{col 38}{space 2} .0769551{col 49}{space 1}    5.34{col 58}{space 3}0.000{col 66}{space 4} .2599771{col 79}{space 3} .5616355
{txt}{space 14}hh_headage {c |}{col 26}{res}{space 2}-.0151757{col 38}{space 2} .0026907{col 49}{space 1}   -5.64{col 58}{space 3}0.000{col 66}{space 4}-.0204494{col 79}{space 3} -.009902
{txt}{space 14}attend_sch {c |}{col 26}{res}{space 2} .0237964{col 38}{space 2} .0880822{col 49}{space 1}    0.27{col 58}{space 3}0.787{col 66}{space 4}-.1488416{col 79}{space 3} .1964344
{txt}{space 17}femhead {c |}{col 26}{res}{space 2}-.2174742{col 38}{space 2} .0835343{col 49}{space 1}   -2.60{col 58}{space 3}0.009{col 66}{space 4}-.3811984{col 79}{space 3}-.0537499
{txt}{space 17}num_mem {c |}{col 26}{res}{space 2}  .040345{col 38}{space 2} .0079508{col 49}{space 1}    5.07{col 58}{space 3}0.000{col 66}{space 4} .0247617{col 79}{space 3} .0559283
{txt}{space 15}good_soil {c |}{col 26}{res}{space 2} .1846169{col 38}{space 2} .0899343{col 49}{space 1}    2.05{col 58}{space 3}0.040{col 66}{space 4} .0083489{col 79}{space 3} .3608848
{txt}{space 24} {c |}
{space 20}year {c |}
{space 19}2012  {c |}{col 26}{res}{space 2}  .002548{col 38}{space 2} .0803549{col 49}{space 1}    0.03{col 58}{space 3}0.975{col 66}{space 4}-.1549448{col 79}{space 3} .1600408
{txt}{space 19}2015  {c |}{col 26}{res}{space 2}-.0770665{col 38}{space 2} .0856007{col 49}{space 1}   -0.90{col 58}{space 3}0.368{col 66}{space 4}-.2448407{col 79}{space 3} .0907077
{txt}{space 19}2018  {c |}{col 26}{res}{space 2}-.0780696{col 38}{space 2} .0965461{col 49}{space 1}   -0.81{col 58}{space 3}0.419{col 66}{space 4}-.2672965{col 79}{space 3} .1111572
{txt}{space 24} {c |}
{space 19}_cons {c |}{col 26}{res}{space 2} .0792183{col 38}{space 2} .2136186{col 49}{space 1}    0.37{col 58}{space 3}0.711{col 66}{space 4}-.3394663{col 79}{space 3}  .497903
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/mills                   {txt}{c |}
{space 18}lambda {c |}{col 26}{res}{space 2}-590.0043{col 38}{space 2} 349.6287{col 49}{space 1}   -1.69{col 58}{space 3}0.092{col 66}{space 4}-1275.264{col 79}{space 3}  95.2553
{txt}{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                     rho {c |} {res}  -1.00000
                   {txt}sigma {c |} {res}  590.0043
{txt}{hline 25}{c BT}{hline 64}

{com}. predict yhat, xb
{txt}
{com}. predict imr, mills
{txt}
{com}. 
. sum yhat, detail

                      {txt}Linear prediction
{hline 61}
      Percentiles      Smallest
 1%    {res} 447.5258       218.7105
{txt} 5%    {res} 577.0159       243.2747
{txt}10%    {res} 633.2141       294.4862       {txt}Obs         {res}      2,960
{txt}25%    {res} 757.1237       300.0134       {txt}Sum of wgt. {res}      2,960

{txt}50%    {res} 908.6301                      {txt}Mean          {res} 992.0242
                        {txt}Largest       Std. dev.     {res} 437.5684
{txt}75%    {res} 1097.606        4054.86
{txt}90%    {res} 1319.614        4101.92       {txt}Variance      {res} 191466.1
{txt}95%    {res} 1668.508       4107.859       {txt}Skewness      {res} 3.252726
{txt}99%    {res} 2981.603       4142.951       {txt}Kurtosis      {res} 18.15203
{txt}
{com}. 
. ************winzonrizing fertilizer market price
. foreach v of varlist  yhat  {c -(}
{txt}  2{com}.         _pctile `v' [aw=weight] , p(1 95) 
{txt}  3{com}.         gen `v'_w=`v'
{txt}  4{com}.         *replace  `v'_w = r(r1) if  `v'_w < r(r1) &  `v'_w!=.
.         replace  `v'_w = r(r2) if  `v'_w > r(r2) &  `v'_w!=.
{txt}  5{com}.         local l`v' : var lab `v'
{txt}  6{com}.         lab var  `v'_w  "`l`v'' - Winzorized top & bottom 5%"
{txt}  7{com}. {c )-}
{txt}(135 real changes made)

{com}. 
. 
. local time_avg "yhat_w"
{txt}
{com}. foreach x in `time_avg' {c -(}
{txt}  2{com}.         bysort hhid : egen TAvg_`x' = mean(`x')
{txt}  3{com}. {c )-}
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\obine\AppData\Local\Temp\STD1718_000000.tmp"
{txt}
{com}. tabstat total_qty_w yhat yhat_w [aweight = weight], statistics( mean median sd min max ) columns(statistics)

{txt}{ralign 12:Variable} {...}
{c |}      Mean       p50        SD       Min       Max
{hline 13}{c +}{hline 50}
{ralign 12:total_qty_w} {...}
{c |}{...}
 {res} 45.05122         0  118.0924         0      1000
{txt}{ralign 12:yhat} {...}
{c |}{...}
 {res} 999.9946  912.9205  463.9528  218.7105  4142.951
{txt}{ralign 12:yhat_w} {...}
{c |}{...}
 {res} 957.3525  912.9205  298.0685  218.7105  1754.106
{txt}{hline 13}{c BT}{hline 50}

{com}. 
{txt}end of do-file

{com}. exit, clear
